{
    "name": "Eccentric Vase",
    "id": "Eccentric_Vase",
    "desc": "Create a quantum tunnel of up to 1000m in length. Lasts 30 seconds.",
    "notes": "The Eccentric Vase is an equipment introduced in the Scorched Acres Update. It is unlocked and starts appearing in runs after completing the Blackout Challenge.\nWhen activated, a quantum tunnel will spawn, with one end at the holder's current location and the other end at their cursor. The tunnel can be up to 1000 meters long, and interacting with either end of the tunnel will cause the player to travel to the other end.\nEach quantum tunnel lasts 30 seconds and unlike the  Remote Caffeinator there is no limit to how many active tunnels can exist for each user at the same time.\n\n\n== Notes ==\nAny player can go through the quantum tunnel, not just the player who created it.\nA player going through the tunnel can exit early by jumping.\nIf the tunnel expires, the purple zipline will disappear but the player will continue travelling towards their destination as normal.\nEntering the tunnel will immediately end the duration of   Shadowfade.\nThe player is still vulnerable to damage while travelling through the tunnel.\nUpon entering the tunnel, the player accelerates at 30 m/s with an initial speed of 0. Since the maximum distance is 1000, it takes approximately 8.16 seconds to reach the other side with a final speed of approximately 245 m/s. Upon exiting the player retains half the speed they have acquired.\nThe player should be careful about aiming the tunnel towards the ground as a high exit speed can inflict massive fall damage.\n\n\n== Tips ==\nThis equipment can be used to skip charging pillars on Commencement by creating a tunnel directly to the   final boss's arena.\nThis is especially useful in multiplayer since only one player on the team needs a Vase. Most pillar-skipping strategies require all players to have sufficient mobility items and/or skills.\n\n\n== Lore ==\n“One of Robins’ most loved acts was the pitcher skit. \n\nThe skit would start off with Robins, playing the part of a flower keeper, getting ready to fill a vase with soil. He would pour, pour, and pour, but the vase wouldn’t seem to get any fuller – as if the soil was disappearing infinitely. \n\nRobins would inspect the vase, looking at it up and down, but there weren’t any holes in the thing. Finally, at the climax, Robins would hold it upside down over his head – upon which all of the soil poured in would land directly on his face.”\n\n- Biography of Charles Robins\n\n\n== Version History ==\nAnniversary Update\nMajor Content\nAdded New Lore Entry: Eccentric Vase\nEarly Access Hidden Realms Content Update\nGameplay Changes\n🌧Thicken zipline visuals\n🌧Zipline Acceleration: 20 ⇒ 30\nCooldown: 100s ⇒ 45s\nPC Early Access Patch (Build ID No.4233443)\nBug Fixes\nDying while traveling in Eccentric Vase no longer causes you to pop out the other end alive\nEarly Access Scorched Acres Content Update\nMajor Content and Changes\nAdded New Equipment: Eccentric Vase\n\n\n== Trivia ==\nThe Eccentric Vase's appearance is based on a Klein bottle, a theoretical object with only one surface which cannot be properly visualized in three dimensions without intersecting with itself.",
    "url": "https://riskofrain2.wiki.gg/wiki/Eccentric_Vase",
    "img_file": "Eccentric_Vase.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Equipment\\Eccentric_Vase",
    "rarity_raw": "Equipment"
}