{
    "name": "Shipping Request Form",
    "id": "Shipping_Request_Form",
    "desc": "A delivery containing 2 items (79%/ 20% / 1% ) will appear in a random location on each stage . (Increases rarity chances of the items per stack).",
    "notes": "The Shipping Request Form is an item in Risk of Rain 2, added in the Survivors of the Void expansion. \nWhen entering a new stage, if any player has this item, a Crashed Multishop \"Delivery\" will spawn somewhere in the stage (one per player who has a Shipping Request Form). The \"delivery\" is a burning Multishop Terminal which is different from a normal one in a few ways: it costs no gold to use, it has only 2 choices instead of the usual 3, and one of those 2 choices is a question mark icon (meaning the item of that rarity is unknown).\n\n\n== Notes ==\nThe crashed Multishop will never display any equipment.\nTerminals spawn even when the Artifact of Sacrifice is active.\n\n\n== Math ==\nThe weight for each tier of item is calculated as follows:\n\n.79 for common\n.2 * n for uncommon\n.01 * n^2 for legendary\nWhere n is the amount of Shipping Request Form.\nTo calculate the chance for a tier, add together all weights then divide that tier's weight by the total sum of all weights.\nFor example, if a player has 2 Shipping Request Form items, then the weights are 0.79 (common), 0.2 * 2 = 0.4 (uncommon), 0.01 * 2^2 = 0.04 (legendary). Then, the chance an item is legendary is 0.04 / (0.79 + 0.4 + 0.04) = 0.04 / 1.23, or approximately 0.0325, around 3%.\nThe table below shows the probabilities calculates for each value of n. Note however that each delivery includes 2 choices. See the section below for odds of at least one legendary.\n\n\n== Graph ==\n\n\n== At least 1 Legendary ==\nEach item tier is independent of each other, but each delivery drop contains 2 items. You can calculate the probability of getting at least one item from a tier by using the complement: 1 - (1 - x) ^ 2, where x is the probability of getting at least one that tier (shown above).\nFor example, with a stack of 3, the chance of one item being chosen as legendary is 6% = 0.06. The chance that it is not legendary is 1 - 0.06, so the chance that both are not legendary is (1 - 0.06)^2. The complement of this is the chance that at least one is legendary:  1 - (1 - .06)^2, roughly 11.5%.\nThe table below shows the probability that at least one legendary item will appear a given stack of Shipping Request Form.\n\n\n== Tips ==\nHaving the  Executive Card allows the player to obtain both items from the delivery, instead of choosing one over another.\nThis is even more effective in multiplayer when multiple players have Shipping Request Forms; the player with the Executive Card can open each of the other players' deliveries for them.\nUsing the  Radar Scanner allows the player to find the Crashed Multishop \"Delivery\" faster, as it will be represented as two adjacent chest icons () upon scan.\nIn multiplayer, all stacks of Shipping Request Form from every player will increase the item rarity of each Multishop spawned from this item. For example, if a player has 5 stacks of this item while another player has 1, both multishops that spawn from the two players holding it will have the item rarity of having 6 Shipping Request Form. So it is not advised for one person in multiplayer to hoard all the Shipping Request Forms, as you lose out on more loot.\n\n\n== Lore ==\nThis is an automated message. If you do not have reason to receive this message, please contact UES Customer Support.\n\nDear {customerFirstName} {customerLastName},\n\nWe regret to inform you that your delivery of {package} has been canceled. We at UES understand the inconvenience this has caused you, and have decided to reimburse you with a UES Shipping Request Form. When redeemed, we at UES will waive all shipping fees and upgrade your shipment to expedited shipping at no extra cost, allowing you to receive your package as quickly and smoothly as possible. We once again apologize for the inconvenience.\n\nThe reason your package was canceled is due to the shipping vessel it was on, UES Contact Light, has mysteriously disappeared in uncharted territories and we have not received communications since. If you or a loved one were aboard the Contact Light, please contact your local authorities if you have not done so already. Please let it be known that all of our efforts are going towards locating the Contact Light and her crew and returning them safely home with UES-ensured comfort and security.\n\nWe thank you for your continued support,\n\n{SysAdmin}\n\nIf you would like to join our reading list, reply with subject headline: UES.RL_JOIN\n\n\n== Trivia ==\nThis item has a very similar effect to the  Rusted Key's effect prior to the Anniversary Update.\n\n\n== Version History ==\nPC Patch v1.2.3\n🌧 Updated Shipping Request Form to be blacklisted for enemies\nSurvivors of the Void\n(Undocumented) Added New Item: Shipping Request Form",
    "url": "https://riskofrain2.wiki.gg/wiki/Shipping_Request_Form",
    "img_file": "Shipping_Request_Form.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Uncommon\\Shipping_Request_Form",
    "rarity_raw": "Uncommon"
}