{
    "name": "Happiest Mask",
    "id": "Happiest_Mask",
    "desc": "Killing enemies has a 7% chance to spawn a ghost of the killed enemy with 1500% damage . Lasts 30s (+30s per stack) .",
    "notes": "The Happiest Mask is a returning item in Risk of Rain 2. \nWhen the holder kills an enemy, there is a 7% chance that a ghost of that enemy will spawn as an ally, with greatly increased attack strength. The chance for this to happen is affected by Luck.\nThe ghost inherits all behaviors of the original monster. The level of the ghost equals the \"ambient\" level of the run, not the player's level.\nGhosts do not take damage through any normal means; instead, their health drops by a fixed percentage every second. Each ghost normally lasts 30 seconds (+30s per stack), though this can be prolonged if they are healed.\n\n\n== Notes ==\nWhen an entity is killed and resurrected as a ghost, it notably keeps all items it previously had. This means that Elites can be resurrected and keep their Elite status, while with the Artifact of Evolution or on Simulacrum they will also keep any enemy items.\nDespite being on the players' team, the ghosts of   Clay Dunestriders,   Grandparent, and             Void enemies may still harm or kill the player with their life-draining tendrils, solar flare, and void implosions, respectively.\nThe player can damage a ghost via friendly-fire items such as  Helfire Tincture, which may cause them to attempt to attack the player. However, the ghost will not do any damage.\nUnlike drones, ghosts won't travel between stages.\nIf a   Beetle Queen,   Solus Control Unit or the   Alloy Worship Unit becomes a ghost, any   Beetle Guards or   Solus Probes they spawn will not be ghosts, but they will still be allied with the player. This means they can spawn as Elites and will not lose any health over time.\n  Void Infestor ghosts will attempt to infest enemies. If successful, their targets will become {  Voidtouched but remain hostile to the player.\nWhen the Artifact of Vengeance is enabled, the holder can kill and resurrect an Umbra as a friendly ghost.\nLikewise, it is possible for an Umbra that holds the Happiest Mask to kill and resurrect a player as a ghost, which will be hostile towards other players.\nSince the ghost inherits all items, it will also inherit the item that causes Umbras to have special visuals and turn the screen purple. However, on death it will not drop any items, since the death is caused by health degeneration which does not trigger any on kill effects.\nIf the Artifact of Chaos is enabled, it is possible for the holder to kill and resurrect an ally, or even themself, as a ghost.\nIf a ghost falls off the stage, it respawns in bounds instead of dying.\n\n\n== Tips ==\nUse  Gorag's Opus to boost the attack speed and move speed of allied ghosts, making them even stronger.\nKeep an eye on the health of allied Clay Dunestriders, Grandparents, and void monsters. These monsters have powerful attacks that deal friendly-fire damage, which will hurt even more than normal since ghosts' stats are much higher than a normal monster's; however, they can only use these attacks after losing enough health. Clay Dunestriders only use their life-draining tendrils below 25% health, Grandparents only use their solar flare below 50%, and void monsters only use their implosion after dying.\nThis is especially pertinent in   Eclipse mode, since all allies spawn at 50% of their maximum health. This means that Grandparent ghosts will be able to use their solar flare immediately, and Dunestrider and void ghosts will use their dangerous attacks much sooner than normal.\nSince a ghost's lifespan is only limited by time, healing it can give the player a near-permanent and powerful ally. Ghosts can be healed by:\nCollecting  Monster Tooth orbs or   DIRECTIVE: Harvest fruits.\nBeing in the range of  Bustling Fungus,  Interstellar Desk Plant, a Shrine of the Woods,   Captain's   healing beacon, or an allied   Mini Mushrum (likely a ghost itself).\nBeing in the Teleporter radius when a  Lepton Daisy activates.\nIf the ghost had self-healing items before it was resurrected, such as  Medkits or  Leeching Seeds. This can occur in the   Void Fields, while the Artifact of Evolution is enabled, or if the ghost is a   Scavenger.\n\n\n== Lore ==\n//--AUTO-TRANSCRIPTION FROM RALLYPOINT DELTA --//\n\n“Sir, the ghosts are back.”\n\nThe man sighed. After a routine expedition, one of the crew members – a simple soldier - had recovered an artifact thought to have been aboard the Contact Light – a simple mask, adorned with a painfully happy grin. \n\n“I’ll take care of it.” The man trudged down the hall towards the barracks. The Lemurians he had killed earlier that day walked down the hall by him, barely earning a second glance from the man. This had become so commonplace that most of the crew members in this block had grown accustomed to having a ghostly room-mate.\n\nBut enough was enough. Stepping through the ghost of an Imp, the man slammed the door open. The lights were off, and in the corner sat the soldier.\n\n“Alright, we’ve had enough fun playing with the dead. Fork it over.”\n\nNo response. The man grunted and hoisted the soldier to his feet, giving him a few rough shakes. “Hey, can you hear me!? I said hand over the mask! I’m tired of waking up next to Beetles, so give it a rest already--”\n\nThe soldier’s limp body moved. Slowly, the soldier raised his finger – pointing directly at the man.\n\n“What are you...?” With a sense of dread, the man turned and saw the Lemurians he had killed earlier step into the room. Their mouths began to glow with an otherworldly glow.\n\nThe man cursed under his breath as he loaded his shotgun. “This planet, I tell you...”\n\n\n== Version History ==\nAnniversary Update\nMajor Content\nAdded New Lore Entry: Happiest Mask\nGameplay Changes\nHappiest Mask minions now scale to the 'ambient level' of the run.\nEarly Access Artifacts Content Update\nBug Fixes\nGhosts with curse no longer have shortened lifespans\nEarly Access Hidden Realms Content Update\nGameplay Changes\nGhost Damage Boost: 300% ⇒ 1500%\nGhost Proc Chance: 10% ⇒ 7%\n\n\n== Trivia ==\nA ghost is actually the original monster with three special hidden items equipped. One makes its health deplete over time; ghosts are awarded 30 of these per Happiest Mask the user has. The second makes it appear and behave like a ghost, so that it is invulnerable to normal damage and becomes transparent. The third boosts its damage; the ghost is supplied 150 of these.\nBecause the time a ghost lasts is tied only to a damage-over-time item it receives, it is possible that   Mini Mushrum ghosts can survive indefinitely because of their healing ability.\nBecause   Captain's   Defensive Microbots passive grants  Defensive Microbots to allies with the \"mechanical\" body tag, if Captain kills and resurrects either   MUL-T,   REX, or   CHEF as a ghost (via either the Artifact of Chaos or Artifact of Vengeance), he will give Defensive Microbots to the ghost.",
    "url": "https://riskofrain2.wiki.gg/wiki/Happiest_Mask",
    "img_file": "Happiest_Mask.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Legendary\\Happiest_Mask",
    "rarity_raw": "Legendary"
}