{
    "name": "Lepton Daisy",
    "id": "Lepton_Daisy",
    "desc": "Release a healing nova during the Teleporter event, healing all nearby allies for 50% of their maximum health . Occurs 1 (+1 per stack) times.",
    "notes": "The Lepton Daisy is an item introduced in the Skills 2.0 Update.\nDuring the Teleporter Event, all allies inside the Teleporter's radius are periodically healed by 50% of their maximum health. This effect occurs 1 (+1 per stack) time(s) per Teleporter Event.\nIn multiplayer, this item stacks based on the total amount held by all players combined (items held by   Engineer's   Turrets do not count), similar to the  Halcyon Seed.\n\n\n== Notes ==\nThe Lepton Daisy is one of the few blacklisted items that   Engineer's turrets will not inherit.\nLepton Daisies also activate in all 'holdout zones', including charging the cells in the   Void Fields, the pillars on   Commencement, the deep void signals on   Void Locus, and the Assessment Focus in the Simulacrum. The only exception is the rescue dropship zone on Commencement.\nThe item heals consistently at predetermined points in the Teleporter charge when stacked.\nFor example, with 2 Lepton Daisies, players will be healed once at 33% charge and again at 66%. With 3, they will be healed at 25%, 50%, and 75%. The intervals between these bursts of healing can be predicted with the equation 99/(amount + 1).\nBecause the Soul Pillars on Commencement discharge when no player is within their range, it is possible to trigger the Lepton Daisy at the same charge percentage by dipping in and out of the holdout zone.\n\n\n== Lore ==\nOrder: Lepton Daisy\n\nTracking Number: 23******\n\nEstimated Delivery: 07/23/2056\n\nShipping Method: Standard\n\nShipping Address: Duck Lake, Orlandus, Earth \n\nShipping Details:\n\nDear Stalnia,\n\nI haven't been able to visit for a while, so I hope you and Libra are doing well. I heard that you're clearing the land there and want to spruce things up. I'm sending this flower I picked in the Carbon Fields of Electron Valley. The terraformers there told me that, over time, landscaping efforts were improved by the organic-band signals sent out by this plant. I've been helping them build a new world.\n\nJust make sure to put it up high enough that Mushka can't get to it. I'm not sure what effect it'll have on dogs...\n\n\n== Version History ==\nAnniversary Update\nGameplay Changes\n🌧 Now activates in all ‘holdout zones’, like   Void Fields, and not just during the Teleporter Event\nEarly Access Content Update 5\nMajor Content\nAdded New Item Lore Entry: Lepton Daisy\nEarly Access 'Skills 2.0' Content Update\nMajor Content and Changes\nAdded New Item: Lepton Daisy\n\n\n== Trivia ==\nDespite being called a daisy, the Lepton Daisy more closely resembles a lily flower.",
    "url": "https://riskofrain2.wiki.gg/wiki/Lepton_Daisy",
    "img_file": "Lepton_Daisy.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Uncommon\\Lepton_Daisy",
    "rarity_raw": "Uncommon"
}