{
    "name": "Old Guillotine",
    "id": "Old_Guillotine",
    "desc": "Instantly kill Elite monsters below 13% (+13% per stack) health .",
    "notes": "The Old Guillotine is an item in Risk of Rain 2. It is unlocked and starts appearing in runs after completing the Cut Down Challenge.\nThe holder will instantly kill any Elite enemy that falls below 13% (+13% per stack) of its maximum health.\n\n\n== Notes ==\nIn a similar fashion to   Artificer's   Cast Nano-Spear and   Snapfreeze, an enemy is executed when its health is below the threshold and the Guillotine's holder deals damage to it.\nOnly the holder can execute an enemy; allies will not benefit from the holder's Guillotines.\nEnemies cannot be executed (by freezing or the Guillotine) if they have any shields. Therefore,    Overloading Elites effectively have a maximum execution threshold of 50% health.\nHowever,   Perfected Elites can be executed as normal at the appropriate threshold.\nThis item can be particularly useful for   Acrid if using   Poison, as it will allow the usually non-lethal passive to kill elite enemies the moment they fall below the threshold.\nThe Old Guillotine is one of the few items in the game with hyperbolic stacking.\n24 Old Guillotines are required to overcome the bonus health for Tier 1 Elite enemies (  Blazing ,  Overloading,   Glacial, and   Perfected), and 131 are needed to overcome the health bonus of Tier 2 Elites (  Malachite and   Celestine).\n  Voidtouched elites are affected by this item.\n  Void Infestor can infest and make a high health, previously non-elite enemy easier to kill as a result.\nSurvivors, and by extension Umbra of Survivors, are unable to be executed.\n  Engineer's   TR12 Gauss Auto-Turret and   TR58 Carbonizer Turret are able to be executed if they are elite.\nThe execution threshold visual will still increase.\nit would take around 111*^317 old guillotines in order to have a 100% threshold\n\n\n== Math ==\nThe threshold at which it will activate is determined by the formula: \nthresHold=(1−100100+13*items)*100;\n\nThe item effectively increase damage against elites by 13%, even if the thresholds differ.\n\n\n== Lore ==\nOrder: Old Guillotine\n\nTracking Number: 782*****\n\nEstimated Delivery: 04/29/2056\n\nShipping Method: Standard\n\nShipping Address: Warehouse 36, Anklar, Primas V \n\nShipping Details:\n\nEveryone is still operating on adrenaline here. We finally overthrew our oppressors and have taken back Primas V! I know some of the overlords will attempt to buy their way onto a stealth transport, but that’s going to be quite difficult due to their epic economic blunder.\n\nWe don’t just want blood for all the injustices we’ve suffered at their hands. We want to send a message to would-be sympathizers. This old guillotine will serve both as an execution method and a symbol to strike fear into their hearts wherever they might be hiding.\n\nPrimas V is alive!\n\n\n== Version History ==\n\n\n== Trivia ==\nThe Old Guillotine may be a reference to The Ol' Lopper from Risk of Rain 1. Both items are \"old,\" have a strong execution motif, and give the player an extreme benefit against low-health enemies: the Lopper causes the player to land guaranteed critical strikes against weakened enemies, while the Guillotine will instantly kill those enemies if they are Elite.\nThe Old Guillotine was the first item to have undergone a rarity change. It was originally added as a Common item before later being changed into an Uncommon item. This item was alone in being the only rarity change until V1.3.6, where  Breaching Fin had its rarity increased to fit its reworked functionality.",
    "url": "https://riskofrain2.wiki.gg/wiki/Old_Guillotine",
    "img_file": "Old_Guillotine.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Uncommon\\Old_Guillotine",
    "rarity_raw": "Uncommon"
}