{
    "name": "Mocha",
    "id": "Mocha",
    "desc": "Increases attack speed by 7.5% (+7.5% per stack) and movement speed by 7% (+7% per stack) .",
    "notes": "Mocha is an item in Risk of Rain 2, added in the Survivors of the Void expansion. \nThe item increases the holder's attack speed by 7.5% (+7.5% per stack), and their base movement speed by 7% (+7% per stack).\n\n\n== Notes ==\nThe  Soldier's Syringe increases the player's attack speed by 15%, and  Paul's Goat Hoof increases their movement speed by 14%. The buffs granted by Mocha are equal to exactly half the buffs granted by each of those items.\n\n\n== Lore ==\nOrder: To-Go Coffee Cup, 16 ounces\n\nTracking Number: 32******\\r\nEstimated Delivery: 05/04/2058\n\nShipping Method:  Standard\n\nShipping Address: Museum of Natural History, Ninten Island, Earth\n\nShipping Details:\nMy finest brew. Hope it doesn't spoil during transit. Remember to heat it back up to 176.23 degrees... that's when it's freshest. See you soon... Coo.\n\n\n== Placement ==\n\n\n=== Survivors ===\n  Commando places it on his left thigh, outwards.\n  Huntress places it on her right thigh, outwards.\n  Bandit places it on his right lower leg, outwards.\n  MUL-T places it resting on the back of its head's compartment.\n  Engineer does not have any visible placement for the Mocha.\n  Artificer places it on top of her hoverpack's left engine.\n  Mercenary places it on his left lower leg, outwards.\n  REX places it at the top of its frame, near the back.\n  Loader places it at the lower right corner of her exoskeleton's chest.\n  Acrid places it on its waist's right side.\n  Captain places it on his waist's right side, outside his jacket.\n  Railgunner places it on her right thigh, outwards.\n  Void Fiend places it on the crack along its helmet, bottom-side up.\n  Seeker places it on her left thigh, outwards.\n  False Son places it wedged in the space between his waist and his left thigh.\n  CHEF places it on the top of his chest piece, on the rightmost rear corner.\n  Operator places it to the right of his visor.\n  Drifter places it on her left lower leg, inwards.\n\n\t\t\n\n\n=== Non-Playable Characters ===\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n== Version History ==\nSurvivors of the Void\n(Undocumented) Added New Item: Mocha\n\n\n== Trivia ==\nThe icon on the cup bears a resemblance to the difficulty icon for   Drizzle.\nThis item's logbook entry is a reference to Brewster from the Animal Crossing series, a pigeon who runs a coffee shop (hence the \"coo\" at the end). He always reminds patrons to drink their coffee while it is still hot. The shipping address being \"Ninten Island\" is a further reference.\nThe item coincidentally does the same thing as the Coffee Bag item from the fan-made Risk of Rain mod Starstorm.",
    "url": "https://riskofrain2.wiki.gg/wiki/Mocha",
    "img_file": "Mocha.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Common\\Mocha",
    "rarity_raw": "Common"
}