{
    "name": "Medkit",
    "id": "Medkit",
    "desc": "2 seconds after getting hurt, heal for 20 plus an additional 5% (+5% per stack) of maximum health .",
    "notes": "The Medkit is a returning item in Risk of Rain 2. It is unlocked and starts appearing in runs after completing the Elite Slayer Challenge.\nWhen the holder takes damage, they get the {  Medkit Heal buff for 2 seconds. When the buff expires, the holder recovers 20 HP, plus an additional 5% (+5% per stack) of their maximum health. \n\n\n== Notes ==\nIf the player takes damage again while they have the Medkit Heal buff, the buff's duration will be reset and they will have to avoid damage for another 2 seconds to receive healing. This makes the item ineffective for recovering from most damage-over-time effects or rapidly-firing attacks.\nAs {  Medkit Heal is a buff, it can not be cleared to activate its effects early by using  Blast Shower.\n\n\n== Tips ==\nAt 20+ stacks, receiving Medkit healing will fully recover the player's health. The number required to do this is reduced by having any  Rejuvenation Racks; having one Rack requires half as many Medkits (10), having two Racks requires a third as many (7), so on and so forth.\nIf the player intentionally takes damage less than the amount they would recover, such as slight fall damage or suffocation from the   Void Fields, the Medkit can be used to gain net positive health, albeit slowly.\n Tougher Times can afford the player more opportunities to heal, as it can block damage that would otherwise reset the Medkit's charge time.\nObtaining the  Strides of Heresy affords the player enough time to receive the Medkit's healing, in addition to the extra healing that comes from   Shadowfade. This comes at the cost of that Survivor's utility skill.\n\n\n== Lore ==\n\"I suggest you stay indoors and rest.\"\n\nMED-E, the medical bot, has been working overtime. The survivors felt very grateful that their escape pod landed near Med Bay cargo - they would have most likely perished without it.\n\n\"I suggest you stay indoors and rest.\"\n\nThe robot was speaking to a tall man, gaunt but strong. \"I'd love to, but we're running low on food.\" Even though his expression was hidden underneath his blue combat helmet, it was obvious the man was extremely tired. \"And everyone else is recovering from last night's attacks. Without the enforcers, we probably wouldn't have-\"\n\n\"I suggest you stay indoors and rest.\" \n\nIt was apparent that MED-E only had a limited set of lines. However, the man continued to respond. \"I can't, MED-E. They're counting on me. You know that.\"\n\n\"I suggest you stay indoors and rest.\" \n\nThis time the man did not humor a reply. Grabbing his shotgun, he turned away from the echoing robot. Weaving his way between countless sleeping bags and stretchers, he set out into the wilderness again. Everyone was counting on him.\n\n\"Please stay indoors and rest.\" \n\n\n== Trivia ==\nThe soldier in the logbook entry might be an Enforcer, which is a playable character in Risk of Rain and Risk of Rain Returns. This is suggested by their blue combat helmet, shotgun, and their statement, \"And everyone else is recovering from last night's attacks. Without the enforcers, we probably wouldn't have-\"\n\n\n== Version History ==\nEarly Access Content Update 5\nGameplay Changes\nHealing: 24 (+24 per stack) ⇒ 20\n🌧Now also heals for 5% (+5% per stack) of maximum health\n(Undocumented) Heal delay: 3s ⇒ 2s\nEarly Access Artifacts Content Update\nGameplay Changes\nHeal: 15 hp (+15 per stack) ⇒ 25 hp (+25 per stack)\nHeal delay: 2.0s ⇒ 3.0s\nEarly Access Hidden Realms Content Update\nBug Fixes\nFix Medkit sound not playing over the network\nEarly Access Release\nIntroduced as \"Heal for 10 (+10 per stack) health 1.1 seconds after getting hurt.\"",
    "url": "https://riskofrain2.wiki.gg/wiki/Medkit",
    "img_file": "Medkit.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Common\\Medkit",
    "rarity_raw": "Common"
}