{
    "name": "Ignition Tank",
    "id": "Ignition_Tank",
    "desc": "Ignite effects deal +300% (+300% per stack) more damage over time.",
    "notes": "The Ignition Tank is an item in Risk of Rain 2, added in the Survivors of the Void expansion. \nAny of the holder's attacks or items that would inflict   Ignite instead inflict   Stronger Burn. Stronger Burn deals 300% (+300% per stack) more damage over time than Ignite. \n\n\n== Activating ==\nDamage from the following items ignite:\n\n Gasoline\n Molten Perforator\n Sautéed Worms\n Molotov (6-Pack)\n Helfire Tincture\n Ifrit's Distinction\n Wake of Vultures\nDamage from the following skills ignite:\n\n  Artificer's   Flame Bolt,   Flamethrower.\n  CHEF's   Sear.\n  Operator's   CMD-SWARM (on crit).\n  Drifter's   Cleanup (Molotov Projectile).\nDamage from the following drones ignite:\n\n  Incinerator Drone\n    ADMIN-OVERRIDE\n\n\n== Notes ==\nEnemies inflicted with   Stronger Burn spark with reddish-white energy.\nCommon misconceptions are that this item would affect fire-related items such as  Kjaro's Band or  Will-o'-the-wisp\nBut like the item specifies, it only affects ignite effect / the burn damage over time effect, and as such has no affect on these items.\n\n\n== Tips ==\n  Artificer can reap huge benefits from this item. Having just a single stack makes   Flame Bolt and   Flamethrower deal nearly twice as much total damage, with further stacks increasing their lethality even more.\n  CHEF can also benefit greatly through the use of   Sear.\nAlthough the  Helfire Tincture's debuff is invisible, it is affected by the Ignition Tank. This is a double-edged sword, since it will deal immense damage but also hurt the user much more.\nAside from skills, Ignite can be inflicted with  Gasoline, the  Molten Perforator, and the  Molotov (6-Pack).\nBecoming   Blazing due to  Ifrit's Distinction or  Wake of Vultures will cause all the player's skills to inflict Ignite as well, making the Ignition Tank dramatically increase almost all damage.\n\n\n== Lore ==\nOrder: 128 oz. Gas Tank\n\nTracking Number: 33******\n\nEstimated Delivery: 05/8/2058\n\nShipping Method: Priority\n\nShipping Address: Death Valley, Earth\nShipping Details: Contains a cocktail of the galaxy's most flammable substances. Y'know, methane, ethylene, butane... A single spark would be more than enough to set this baby off!\n\nEr, hold that thought. It spontaneously combusted while I was writing this. I'll get you a new one in case it burns during transit, this happens a lot!\n\n\n== Version History ==\nPC Patch v1.2.2.0\nFixed Ignition Tank’s descriptions being inaccurate to its behavior\nSurvivors of the Void\n(Undocumented) Added New Item: Ignition Tank",
    "url": "https://riskofrain2.wiki.gg/wiki/Ignition_Tank",
    "img_file": "Ignition_Tank.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Uncommon\\Ignition_Tank",
    "rarity_raw": "Uncommon"
}