{
    "name": "Trophy Hunter's Tricorn",
    "id": "Trophy_Hunter_s_Tricorn",
    "desc": "Execute any enemy capable of spawning a unique reward , and it will drop that item . Equipment is consumed on use.",
    "notes": "The Trophy Hunter's Tricorn is an equipment in Risk of Rain 2, introduced in the Survivors of the Void expansion.\nThe Tricorn cannot be activated in most circumstances; it can only be used when the user is aiming at a boss monster that has an associated boss item, in which case a ghostly diamond-shaped reticle will appear over the monster in question. Activating the Trophy Hunter's Tricorn while this reticle is active will instantly kill that monster, and cause the corresponding item to drop from the point where it dies. The Trophy Hunter's Tricorn is then \"consumed,\" replacing the ghostly, incorporeal version of the hat with a standard-looking tricorn, and removing the floating blunderbuss entirely.  \nActivating the consumed Tricorn will send the message \"Ahoy!\" in the chat, as if typed by the player using it. This ability has a cooldown of 60 seconds. This functionally does nothing except allow the user to trigger equipment activation items, such as  War Horn.\n\n\n== Notes ==\nIf used on the   Alloy Worship Unit, it will drop  Empathy Cores, the boss item normally reserved for the   Solus Control Unit. As the Worship Unit never shows up as a Teleporter Boss in normal gameplay, and thus has no unique boss item of its own, it presumably borrows the Control Unit's item just so that the Worship Unit can also be targeted by the Tricorn.\nIf used on   Aurelionite in the Gilded Coast, then Aurelionite itself will drop a  Halcyon Seed, in addition to the guaranteed Halcyon Seed that normally drops near the gold portal.\nAurelionite cannot be targeted while it is immune to damage.\nIf you have Artifact of Chaos active it can also be used on a friendly Aurelionite when it's summoned by a Halcyon Seed during a teleporter event. Doing so will kill the Aurelionite but reward you with a Halcyon Seed.\nIf used on a   Magma Worm or   Overloading Worm, the  Molten/ Charged Perforator will drop where the worm's head is. Time the shot carefully so that the item does not end up in an inaccessible location or stuck underground.\n\n\n== Tips ==\nKeep in mind that activating the Tricorn will put the equipment slot it occupies on a 60 second cooldown, despite its primary effect being single-use. This may cause a delay in usability if the player plans to swap to another equipment item promptly after using the Tricorn, or if the Artifact of Enigma is enabled.\nTechnically the Tricorn has a cooldown of 0 seconds and its consumed counterpart has 60 seconds. Upon activation, the transformation takes place before calculating the cooldown based from the current equipment. However, this makes the Tricorn, along with the  Executive Card, ideal for refreshing all equipment charges in one go due to their extremely low cooldown.\nAlthough the additional equipment charges provided by holding one or more  Fuel Cells might appear to indicate that the Tricorn's boss-killing effect can be used several times in succession, the first successful use of a Tricorn always transforms the item into its consumed version. Any remaining charges afterwards will simply send \"Ahoy!\" instead.\nBe wary of picking up  Gesture of the Drowned while holding the Tricorn, or vice-versa, as it will cause the Tricorn to be immediately used on the first applicable boss that the player looks at. This may result in the dropped item being unobtainable if the boss in question is over a pit or some otherwise inaccessible terrain at the time, or may net the player a boss item that they are uninterested in.\nSince this item is single-use and cannot be activated at all under most circumstances, giving it to an   Equipment Drone might be worth considering, as this can free up the player's personal equipment slot for something more useful in the long-term. However, this also means that the Equipment Drone will automatically use it to execute the first boss enemy it sees, so the aforementioned Gesture caveat also applies here.\nNote that once an Equipment Drone has used the Tricorn's one-off boss-slaying effect, it will be replaced with the consumed version of the Tricorn, and the Drone will begin saying \"Ahoy!\" in the game chat about once every 12 seconds. While it will function as little more than a pirate-themed target for enemies to shoot at until it breaks, this does at least allow it to draw some fire away from any nearby players. An already-consumed Tricorn can also be given to an Equipment Drone, much to the same effect.\nThe consumed Tricorn's \"Ahoy!\" has a hard second cooldown of two seconds. This cooldown can be reached with sufficient  Fuel Cells and Gesture of the Drowned.\nThe Wandering CHEF can restore this item when combining it with  Armor-Piercing Rounds\n\n\n== Lore ==\n\"I've always thought,\" said Rainsford, \"that the Bighorn Bison is the most dangerous of all big game.\"\n\nFor a moment the general did not reply; he was smiling his curious red-lipped smile. Then he said slowly, \"No. You are wrong, sir. The Bighorn Bison is not the most dangerous big game.\" He sipped his wine. \"Here in my preserve on this planet,\" he said in the same slow tone, \"I hunt more dangerous game.\"\n\n\"...Sir?\" General Hadbury turned to Rainsford. \"Tell me, Rainsford, what makes game... dangerous?\" Rainsford thought for a moment. \"...The, er, size, sir? Big animals are often pretty tough to take down.\" Habury nodded. \"Indeed, size can be important, but that's not it. In my eye, what makes game dangerous is... intelligence.\" Hadbury met Rainsford's gaze with a twinkle in his eye.\n\n\"The best hunt is always a match of wits. Say I were to lay some traps - how would I go about disguising them so that my prize won't spot them from a mile away? It makes things so much more fun, you see.\" Hadbury turned, walking towards the railing of the balcony overlooking his reserve. \"There's no fun to the hunt, or any game for that matter, if there is no risk involved... if there is no story to the prize. That is why, dear Rainsford, my halls are decorated with the spoils of hunts that could only be described as legendary.\" Hadbury's red-lipped smile grew into a red-lined grin. \"Now get the men ready, for we are going to hunt.\"\n\n\n== Version History ==\nPC Patch v1.2.2.0\n(Undocumented) Bug Fix\n(Undocumented) The Trophy Hunter's Tricorn can now be used on the   Void Devastator\nSurvivors of the Void Update\nMajor Content\nIntroduced.\n\n\n== Trivia ==\nThis item's logbook entry is a reference to the short story \"The Most Dangerous Game\".\nWhen held by   Acrid, the spectral blunderbuss that usually appears next to a player with the Trophy Hunter's Tricorn will appear to be both backwards and upside-down. It is unclear whether this is meant to reflect how the character in question is an animal with no knowledge of how guns work, or if the unusual placement is simply a developer oversight.\nWhile the Trophy Hunter's Tricorn can be recycled into another equipment by the  Recycler, the Consumed Tricorn cannot.",
    "url": "https://riskofrain2.wiki.gg/wiki/Trophy_Hunter%27s_Tricorn",
    "img_file": "Trophy_Hunter_s_Tricorn.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Equipment\\Trophy_Hunter_s_Tricorn",
    "rarity_raw": "Equipment"
}