{
    "name": "Corpsebloom",
    "id": "Corpsebloom",
    "desc": "Heal +100% (+100% per stack) more. All healing is applied over time . Can heal for a maximum of 10% (-50% per stack) of your health per second .",
    "notes": "The Corpsebloom is a lunar item in Risk of Rain 2.\nAll the player's healing is increased by 100% (+100% per stack), but unlike the  Rejuvenation Rack, regeneration is not increased. Additionally, all healing is applied over time; whenever the player would heal, it is instead stored in the Corpsebloom. Every 0.2 seconds, the Corpsebloom takes from this store and heals the holder up to 2% of their maximum health (up to 10% per second). This healing cap is halved per additional stack. \nThe healing increase scales linearly, while the amount of maximum health that can be healed scales hyperbolically.\n\n\n== Notes ==\nThe holder can only store up to 100% of their maximum health as healing.\nThe  Rejuvenation Rack affects the Corpsebloom twice: it increases the healing when it is stored, and increases it again when the healing is actually applied. Additionally, the Rack's second healing increase is applied after the Corpsebloom caps the healing over time, meaning that the Rack also increases the maximum amount of health that can be recovered per second. For instance, with a single Corpsebloom and Rejuvenation Rack, the player receives 8 times as much healing and can recover a maximum of 20% of their health per second.\nAssuming the player has at least 1 Corpsebloom, the full formula for how much healing the player receives is DirectHealing ⋅ (Corpseblooms + 1) ⋅ (RejuvenationRacks +1)^2\n\n\n== Tips ==\nWhether or not to pick up the Corpsebloom basically depends on how much healing the player currently has; if they cannot heal at least 10% of their max health per second, then the Corpsebloom is almost entirely beneficial. If their healing exceeds the cap, or they have large bursts of healing (e.g. from the  Foreign Fruit), then the Corpsebloom will likely be detrimental.\nAs a result, the Corpsebloom is generally more effective on short runs e.g. going for Mithrix without looping, and typically falls off in effectiveness on long runs, as enemies deal much more damage and thus the player must heal much more.\n  REX suffers a delay on healing from all abilities while holding Corpsebloom.\nWhile holding a  Planula and a Corpsebloom, the user heals 30 HP upon taking damage. The Planula is unlikely to exceed the Corpsebloom's healing cap.\n  Shadowfade heals 18.2% of the user's max health total over 3 seconds. While holding  Strides of Heresy and one Corpsebloom,   Shadowfade heals 30% of max health while intangible and the remaining 6.4% of max health 1 second later.\nStand still while holding Bustling Fungus to store healing quickly. This can be useful during waiting periods or between waves of various battles.\n\n\n== Math ==\nThe maximum healing per second is determined by the formula 0.1 ⋅ 1/(amount)\n\n\n== Lore ==\n========================================\n\n====   MyBabel Machine Translator   ====\n\n====     [Version 12.45.1.009 ]   ======\n\n========================================\n\nTraining… <100000000 cycles>\n\nTraining… <253421 cycles>\n\nComplete!\n\nDisplay result? Y/N\n\nY\n\n========================================\n\nThe body is received and placed in a special containment unit. Proper care must be taken to ensure most efficient growth conditions.\n\nThe seeds are planted in the body.\n\nOne day passes.\n\nFlesh softens and stretches. Youth returns to the face. Bones harden.\n\nAnother day passes.\n\nDead skin falls away from the body, and muscles gain strength. Hair resumes its original luster.\n\nAnother day passes.\n\nThe flowers have fully bloomed and the body is as good as new.\n\nNo signs of life, but not necessary.\n\n\n== Version History ==\nAnniversary Update\nMajor Content\nAdded New Lore Entry: Corpsebloom\n\n\n== Trivia ==\nInitially, the Corpsebloom would give the player a 5% critical strike chance and a chance to \"critically heal,\" doubling the amount of HP restored. The chance for this to happen would be determined by critstat/corpseblooms, and the player's chance to deal critical damage would be lowered by this amount. This was abandoned before the Early Access release because \"[crit heal] wasn't as cool as it sounded\". The Corpsebloom still has the internal name 'CritHeal' as a relic from this early development stage. This is not to be confused with 'HealOnCrit', which would be the  Harvester's Scythe.\nSimilarly to how the Rejuvenation Rack affects the Corpsebloom's healing, the effect of   Eclipse 5 reduces healing twice when calculating the heal for Corpsebloom. This makes even a single Corpsebloom a useless item to pick up on Eclipse 5 and higher.\nIn the RoR2 Discord poll of June 10th 2019, the Corpsebloom was voted the least favorite lunar item.\n\n\n== References ==",
    "url": "https://riskofrain2.wiki.gg/wiki/Corpsebloom",
    "img_file": "Corpsebloom.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Lunar\\Corpsebloom",
    "rarity_raw": "Lunar"
}