{
    "name": "Sentient Meat Hook",
    "id": "Sentient_Meat_Hook",
    "desc": "20% (+20% per stack) chance on hit to fire homing hooks at up to 10 (+5 per stack) enemies for 100% TOTAL damage .",
    "notes": "The Sentient Meat Hook is an item in Risk of Rain 2. It is unlocked and starts appearing in runs after completing the Deja Vu? Challenge.\nWhen the holder damages an enemy, there is a 20% chance (+20% per stack) that a burst of hooks will shoot out from that enemy, pulling in up to 10 other enemies (+5 per stack) within 30m and dealing 100% total damage to each.\nEach hook has a proc coefficient of 0.33.\nThis item stacks hyperbolically in the chance to fire hooks, and linearly in the number of hooked enemies.\n\n\n== Math ==\nThe chance to activate is determined by the formula 1−1/(1+0.2∙x), with x being the amount of Sentient Meat Hooks.\n\n\n== Tips ==\nSimilarly to the  Primordial Cube, this item is useful for gathering up many enemies into one spot to strike them all with area-of-effect items or abilities.\nBecause a large number of enemies are hooked at once, it is possible for just a single activation of the Sentient Meat Hook to activate other total damage items easily, even though its own proc coefficient is low.\nDue to the hyperbolic stacking, a single Sentient Meat Hook will activate more frequently when stacked with  57 Leaf Clovers than additional stacks of Sentient Meat Hook. The only drawback to this is the number of enemies it can hook, but this is rarely an issue.\nTo get an even higher chance, you can get more meat hooks along with clovers.\n\n\n== Lore ==\n\"When artificial intelligence became more commonplace, many companies jumped on the trend for \"smart\" products. This included smart doors, lights, coffee makers, lawnmowers, vacuum cleaners, bedding, kitchen knife sets, and other home goods. After a series of gruesome lawsuits stemming from hacked smart appliances, most products soon went back to their more traditional, analog lines.\"\n\n-\"Why Is Smart So Dumb? VII\"\n\n\n== Version History ==\nPC Patch v1.0.1.1 (Build ID No.5440050)\nBug Fixes\nFix Meat Hook causing a cascade of issues, preventing certain on-hit effects from working when it would trigger\nEarly Access Scorched Acres Content Update\nGameplay Changes\nDamage: 100% additive damage ⇒ 100% total damage",
    "url": "https://riskofrain2.wiki.gg/wiki/Sentient_Meat_Hook",
    "img_file": "Sentient_Meat_Hook.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Legendary\\Sentient_Meat_Hook",
    "rarity_raw": "Legendary"
}