{
    "name": "Fuel Array",
    "id": "Fuel_Array",
    "desc": "Looks like it could power something. EXTREMELY unstable...",
    "notes": "The Fuel Array is a single-use equipment introduced in the Scorched Acres Update.\nIt can only be obtained during the first stage, by interacting with a hatch on the back of the Escape Pod that the player spawns from.\nUnlike most other equipment, the Fuel Array cannot be activated normally. Instead, it automatically activates if the holder falls to 50% of their maximum health. When this happens, the Fuel Array triggers a 30m explosion that deals severe fixed damage after  3 seconds; any entity in range of the explosion are damaged for 300% of the holder's maximum health and suffer heavy knockback. This explosion has a proc coefficient of 0.0 and cannot critically strike.\nWhen the Fuel Array is activated and explodes, it is destroyed and removed from the player's inventory, regardless of any  Fuel Cells they have.\nThe main purpose of the Fuel Array is for repairing the broken robot in   Abyssal Depths. If the player interacts with the robot while they have a Fuel Array equipped, it will clear the Power Plant challenge and unlock   REX as a playable Survivor. This will also remove the Fuel Array from the player's inventory.\n\n\n== Notes ==\nThe Fuel Array cannot be selected from Orange Command Essence.\nThe Fuel Array's explosion will damage any entity within its radius.\nThe damage dealt by the explosion is 3 ⋅ (maxHealth + maxShields) . This can be reduced with armor.\nWith sufficient barriers,   MUL-T can survive the blast while in   Transport Mode or   Power Mode.\n  Mercenary can use   Blinding Assault or   Eviscerate to become   invincible and take no damage from the explosion.\n  Seeker can use   Sojourn to take no damage from the explosion.\nObtaining the  Strides of Heresy gives the player access to the powerful  Shadowfade skill, which makes them completely invulnerable. This is helpful for avoiding damage and healing to keep the Fuel Array from exploding, or for staying alive if it does explode.\nSince the Fuel Array will explode when the player falls under half health, things like fall damage,   Stone Golem lasers, and other high instant-damage sources are much more dangerous than normal.\nActivating a Shrine of Blood with the Fuel Array equipped is guaranteed death, unless the player has built up some extra barriers.\nIt is possible for  Tougher Times to negate the damage taken from the Fuel Array. Likewise,  Safer Spaces can also negate the damage if timed correctly.\nItems and effects that reduce the player's maximum health value will not cause the Fuel Array to explode, as this is not treated as damage dealt.\nThese are the Shaped Glass,  Tonic Affliction, and   Permanent Curse.\n  MUL-T,   Acrid,   Void Fiend and   False Son are unable to obtain the Fuel Array in a single-player run, as they do not begin runs in an Escape Pod.\nIf MUL-T is below 50% health and   switches to the equipment slot containing the Fuel Array, this will instantly begin the countdown. This can be stopped by switching back to the other equipment slot, as long as that other slot is not another Fuel Array.\nIn multiplayer, it is possible to obtain multiple Fuel Arrays, though this can only be done by having another player drop theirs by exchanging it with another equipment item.\nIn multiplayer, if one player uses the Fuel Array to repair REX, only that player will complete the Power Plant challenge, and thus only that player will unlock REX.\nIt is possible for multiple players to repair REX with their own individual Fuel Arrays in the same session.\nIf given to an   Equipment Drone, the Fuel Array will become unusable, and is impossible to recover when the drone dies.\nIf an another equipment is first picked up, and then swapped with the Fuel Array while it is still in the Escape Pod, then the other equipment item's display model will take the Fuel Array's place in the pod.\n\n\n== Tips ==\nThe Fuel Array's explosion does not bypass one-shot protection, so it can theoretically be weaponized to deal massive area damage if the player's one-shot protection becomes active. This can only be done with large amounts of healing, however, since the player will need to recover at least 40% of their health before the Fuel Array explodes.\nThe  Medkit is triggered only 2 seconds after taking damage while the explosion countdown is 3 seconds.\nThe  Power Elixir heals 75% of the player's health if they have fallen below 25%. Therefore, if the player falls just below 50% to trigger the countdown, they may be incentivized to intentionally take further damage to activate the effect. However, the player cannot fall below 15% health in attempting to trigger this item, as they will not recover sufficient health to then activate the one-shot protection.\nWhen carrying the Fuel Array, the  Old War Stealthkit and  Genesis Loop become nearly useless, as falling below 50% health leads to almost-certain death. However, this also means that the player will always benefit from the  Delicate Watch.\n  Engineer can make excellent use of the Fuel Array's volatile nature, as his   turrets will also have their own Fuel Arrays. While this does cut their lifespan short, they will explode when sufficiently damaged and inflict colossal damage on any enemies nearby.\nThis is especially effective when using Engineer's   TR58 Carbonizer Turrets, which will charge straight towards enemies.\nThis strategy is much more feasible in multiplayer runs than singleplayer, as dying from the Fuel Array will not immediately end the run.\n\n\n== Version History ==\nPC Early Access Patch (Build ID No.4233443)\nBug Fixes\nFix Fuel Array sometimes missing in multiplayer\nEarly Access Patch (Build ID No.3961583)\nGameplay Changes\nIncrease damage of Fuel Array explosion from 100% of your health to 300% of your health\nFuel Array no longer pierces armor\nAdd new graphics to Fuel Array to clarify that it is not a  Sticky Bomb\nEarly Access Scorched Acres Content Update\nMajor Content and Changes\nAdded New Equipment: Fuel Array",
    "url": "https://riskofrain2.wiki.gg/wiki/Fuel_Array",
    "img_file": "Fuel_Array.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Equipment\\Fuel_Array",
    "rarity_raw": "Equipment"
}