{
    "name": "Breaching Fin",
    "id": "Breaching_Fin",
    "desc": "Grounded enemies hit with any skill are launched and stunned . Enemies hit while airborne are launched again up to 2 times (+1 per stack) . Launched enemies take increased damage by 10% from all sources per launch.",
    "notes": "Breaching Fin is an item in Risk of Rain 2, added in the Seekers of the Storm expansion.\nWhen the holder hits a grounded enemy, it is knocked vertically into the air and gains 2 stacks of   Breaching Fin Debuff (+1 per stack). Enemies with the debuff take 10% increased damage from all sources for each stack of the debuff inflicted. When hit, debuffed enemies are launched upward again and lose one stack of the debuff. After losing all stacks of the debuff, the damage penalty is cleared and the enemy will no longer launch upward on hit. \nAfter triggering the item once, it is put on cooldown for 10 seconds.\n\n\n== Notes ==\nThe   Breaching Fin Ready status effect above the health bar indicates whether it is charged or not. The effect changes to   Breaching Fin Cooldown while it is recharging, but unlike   Elemental Rings Cooldown and   Singularity Band Cooldown, the recharge period is not indicated with multiple stacks.\nThe   Breaching Fin Debuff will automatically clear itself after a short delay if the inflicted enemy falls to the ground and is not hit again.\nThis item does not work on mid-air enemies, enemies immune to fall damage, and any enemy that is not on the ground.\nIt does, however, work on champions, bosses, and final bosses.\nThis item can be used to inflict  Marked for Death.\n\n\n== Lore ==\nOrder: Breaching Fin\nEstimated Delivery: 01/01/2057\nShipping method: Biological\nShipping Address: Fort Joseph, UES B1053 Port Station, Boron System\nShipping details:\n\nImpressed? I know you are.\nWe finally cleared our grid, but man did it put up a fight. We lost James and Kight. This fin knocked them off the U.E.S.S. [REDACTED] with so much force we heard them hit the water in pieces. At least it was quick.\n\nThere isn’t a speck of land on this blasted planet but now it’s safe enough to build our first dock. It’s not land, but it’s a step up from this flotsam. I won’t miss giant sea creatures bumping the ship in the night, or losing my lunch to this damn swaying.\n\nGet us a good commission for it will ya? And send down some playing cards, the silence is killing us. \n\n- Private Bowen\n\n\n== Version History ==\nUpdate Notes V1.3.7\nBase damage increase of Breaching Fin reduced to 10% (was 20%) however each additional juggle increases damage by 10% (with a single item the total bonus is 30% with a fully-juggled enemy, gaining further stacks of Breaching Fin gives you an extra juggle and a further +10% damage for each additional juggle.)\nUpdate Notes V1.3.6\nKnockback Fin - Renamed to Breaching Fin\nOld Functionality - 7.5% (+7.5% per stack) chance on hit to knock enemies into the air. (height increases per stack).\nNew Functionality - Grounded enemies hit with any skill are launched and stunned. Enemies hit while airborne are launched again up to 2 times (+1 per stack.) Launched enemies take increased damage by 20% from all sources per launch. Recharges after 10s. Increased to Uncommon (green) rarity.\nBlacklisted  Unstable Transmitter, Breaching Fin and  Sonorous Whispers from situations where enemies can obtain items (such as Simulacrum.)\nSeekers of the Storm\nAdded 18 Pickups\nKnockback Fin\n\n\n== Trivia ==\nWhen its effect is activated, the Breaching Fin's model on the player character will appear to go limp, and will straighten out again after the cooldown.",
    "url": "https://riskofrain2.wiki.gg/wiki/Breaching_Fin",
    "img_file": "Breaching_Fin.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Uncommon\\Breaching_Fin",
    "rarity_raw": "Uncommon"
}