{
    "name": "Egocentrism",
    "id": "Egocentrism",
    "desc": "Every 3 (-50% per stack) seconds, gain an orbiting bomb that detonates on impact for 360% damage , up to a maximum of 3 bombs (+1 per stack) . Every 60 seconds, a random item is converted into this item.",
    "notes": "Egocentrism is a lunar item in Risk of Rain 2, added in the Survivors of the Void expansion. \nEvery 3 seconds (-50% per stack), this item generates a floating orb around the holder, up to a maximum of 3 (+1 per stack). When an orb gets close to an enemy, it rapidly homes in on it, exploding on contact for 360% damage. \nEvery 60 seconds, the holder will lose one random item and gain a stack of Egocentrism. The item lost is random and can come from any rarity, including other lunar items. This timer does not change with increasing stacks of Egocentrism.\n\n\n== Notes ==\nCorrection: The in-game description of 3s (-50% per stack) per orb is incorrect. The actual time to summon each orb is 3/stacksseconds per orb.\nSince only 1 orb can be summoned per frame, this makes 60 Egocentrisms the effective limit for damage per second, at 21,600% per second. However, additional stacks beyond this still enable the player to have a larger quantity of orbs at once, giving increased burst damage at the start of an encounter.\nAfter reaching the 15th Egocentrism, bombs will be generated further away from the Survivor, forming multiple progressively larger orbits of bombs.\nThe Survivor's head is replaced with a large glowing sphere.\nEgocentrism will not convert any untiered items, such as the  Empty Bottle,  Delicate Watch (Broken), and even  Tonic Afflictions.\nItems are chosen randomly regardless of number of stacks, rarity, or how recently they were picked up; an item with 30 stacks is just as likely to have one of them assimilated as an item with only 2 stacks.\nThe orbs ignore terrain completely, both when orbiting the holder and when attacking enemies.\nWhen holding a  Brilliant Behemoth, the orbs will trigger the Behemoth's explosion on contact with terrain.\n\n\n== Tips ==\nBecause Egocentrism will eventually consume all other items, it makes having a good equipment even more important than usual. Equipment with short cooldowns work best, such as the  Gnarled Woodsprite for consistent extra healing or  The Crowdfunder or  Royal Capacitor for long-range damage.\nIf the player has multiple equipment charges from  Fuel Cells, the extra charges remain even after the Fuel Cells are lost. However, after those charges are used up the player will need to find more Fuel Cells in order to store extra charges again.\nThe bombs' short range (and the item-consuming nature of Egocentrism) makes it difficult to use for Survivors who lack innate mobility skills, since movement-related items are always in danger of being lost.\nIronically, the bombs themselves can also provide range with enough stacks of Egocentrism. While this can still result in a loss of movement items, this can offset the range downside.\nEgocentrism works best on survivable short-range Survivors such as   Mercenary,   Loader,   False Son, and   Drifter. It can also work well for   Void Fiend because of its innate ability to heal itself, even without any items.\n  Engineer's turrets inherit his Egocentrisms and have a slightly higher base damage stat than him. Egocentrism makes each turret type even better at its role:   TR12 Gauss Auto-Turrets can eliminate nearby foes and defend an area even better, while the  TR58 Carbonizer Turrets charge straight towards enemies and relentlessly attack, making their offense even more dangerous.\nAvoid Egocentrism when playing as the   Heretic, as losing any Heresy item will leave her with the useless   Nevermore skill in its place. This is especially dangerous when losing the  Strides of Heresy, removing Heretic's only innate way to recover her degenerating health.\nThis item makes getting the logbook entries for the  Pearl and  Irradiant Pearl much easier, although it is still time-consuming. By having at least 1 other item, the player can find a Cleansing Pool and complete that stage's Teleporter Event so that no enemies spawn, then repeatedly use the Cleansing Pool while they have at least 1 Egocentrism. If no Irradiant Pearls are found, they simply wait until the Egocentrism converts all the Pearls back into Egocentrism, and repeat.\nEgocentrism assimilates items even while the timer is frozen in Hidden Realms. This means the player can simply idle to gain more Egocentrism for later use (either for Cleansing Pools or for fighting), without worrying about scaling difficulty.\nEgocentrism provides the only way to remove non-consumable Void Items from the player's inventory, aside from using the Shrine of Order. This can be helpful in case the player accidentally picks up a void item that corrupts items important to their build, or if they simply no longer want the items. However, this is highly imprecise, and Egocentrism will very likely damage the player's build itself.\nThis strategy is more useful on a stage with a Cleansing Pool, as the player can convert all of the Egocentrisms into   Pearls and  Irradiant Pearls, providing increases to their stats and preventing Egocentrism from consuming any more items.\n\n\n== Lore ==\n...I know you can hear me.\n\nI was willing to give you the benefit of the doubt, at first. Perhaps there was a flaw in my design.\n\nPerhaps it was one of your games. I was even willing to forgive you.\n\nBut no, I see the truth now. You trapped me on this forsaken rock. And for what? \n\nIs this all for your little pets? The creatures you love so much?\n\nOr, can I even call it love, when you would stab your only brother in the back? How could you do this to me?\n\nI, the only one who looked out for you after her death.\n\nI, the one who showed you how to create?\n\nI, who HELPED to CREATE the very power you use to invite VERMIN and PESTS to our home?\n\nI, YOUR ONLY BROTHER?\n\nHOW COULD YOU LOVE THOSE IMPERFECT, FLAWED VERMIN BUT NOT ME? AFTER ALL I'VE DONE FOR YOU? HOW COULD YOU DO THIS TO ME?\n\n...Say something.\n\n\n== Version History ==\nSurvivors of the Void\n(Undocumented) Added New Item: Egocentrism",
    "url": "https://riskofrain2.wiki.gg/wiki/Egocentrism",
    "img_file": "Egocentrism.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Lunar\\Egocentrism",
    "rarity_raw": "Lunar"
}