{
    "name": "Delicate Watch",
    "id": "Delicate_Watch",
    "desc": "Increase damage by 20% (+20% per stack) . Taking damage to below 25% health breaks this item.",
    "notes": "The Delicate Watch is an item in Risk of Rain 2, added in the Survivors of the Void expansion. \nIt increases all the holder's damage by 20% (+20% per stack). However, when the holder takes damage that brings them below 25% of their maximum health, all stacks of this item is removed from the inventory and an equal amount of  Delicate Watch (Broken) is added. Broken Watches have no effect and cannot be scrapped.\n\n\n== Notes ==\nWhile the player is holding this item, a faint black line will appear over the health bar at the 25% mark, indicating when this item will break.\nDespite the item description specifying that watch will break below 25% health, it is actually based on combined health (i.e. health plus shields), similar to the  Fuel Array. This allows the item and its drawback to function normally even for a character with more than three times as much shield as health, such as one holding a  Transcendence.\nWhen falling below 25% health, the  Unstable Transmitter's effect has priority triggering, followed by the  Power Elixir's. Only when the Unstable Transmitter is on cooldown and all Power Elixirs are used will the Delicate Watch's effect trigger.\n\n\n== Tips ==\nHaving an  Unstable Transmitter and/or a  Power Elixir can help prevent Delicate Watches from breaking, as their effects take priority over its own.\nThe Delicate Watch acts similiarly to  Focus Crystal but without the distance restriction. If the player can avoid breaking them, the Delicate Watch provides a damage increase at all distances.\nPaying the second or third offering at a Shrine of Blood can break this item immediately. This can be negated with enough barrier or blocked by  Safer Spaces, among other methods.\n\n\n== Lore ==\nThe wind blows over the plains. Two soldiers trudge along on their routine patrol, filling their boredom with casual conversation. \"Hm. Hey, Shelly, have I ever showed you my new Patex?\" Quinton mused. Shelly shot him a quizzical look. \"Tell me you didn't bring a $75,000 watch with you on a dangerous expedition into unknown territories...\"\n\nWhirling around to face his partner, Quinton gave a hearty laugh. \"Why, yes I did!\" Rolling up his sleeve, a glint of gold revealed his collector's watch. The metal surface gleamed proudly, reflecting a ray of sunlight into the eyes of a hidden Lemurian. \"What's the point of going through trials and tribulations in the middle of nowhere if I can't STYLE all over my fellow soldiers!?\" Quinton laughed, pounding his fist to his chest. \"I'm going to rub it in your face SO HARD when that thing inevitably breaks,\" Shelly chuckled. Quinton scoffed. \"Oh, please. We've been along this route countless times, and nothing's happened. We're lucky to be stationed on a quiet sector of this hellhole, and I doubt our luck will run out any time soon.\"\n\nAs if on cue, the aggrivated Lemurian, annoyed by the glare, leapt from the bushes and shot a fireball. \"Woah!\" Shelly shouted, raising her gun and killing the beast. \"Hah... So much about a quiet, sector, huh?\" Shelly turned to her partner, who was doubled over on the ground. Shelly's face blanched.\n\n\"Oh no... Were you hit? We need to get you to a medic, fast...!\"\n\n\"No.\" Quinton's voice was small and full of grief. \"I'm perfectly fine, but...\" Quinton looked up, revealing his gleaming Patex, having taken the fireball dead-on, had been reduced to a mangled mess of twisted metal and smoking polish. \"L-Look what that BEAST did to my precious watch!\"\n\nFor a moment, all was quiet on the plains. Then, the silence was yet again broken by Shelly's laughter and Quinton's desperate pleading.\n\n\n== Version History ==\nSurvivors of the Void\n(Undocumented) Added New Item: Delicate Watch\n\n\n== Trivia ==\nThis item's pickup quote on breaking is a reference to the common saying \"A stopped clock is right twice a day\".\nThis item's model in the Logbook displays accurate time according to the user's computer's time. Zooming in close enough will allow you to see the large clock hand move in real time.\nThe item's brand name of Patex in the log entry is most likely a reference to Patek Philippe, a famous Swiss watch brand that makes extremely expensive and, for the most part, delicate watches.",
    "url": "https://riskofrain2.wiki.gg/wiki/Delicate_Watch",
    "img_file": "Delicate_Watch.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Common\\Delicate_Watch",
    "rarity_raw": "Common"
}