{
    "name": "Genesis Loop",
    "id": "Genesis_Loop",
    "desc": "Falling below 25% health causes you to explode, dealing 6000% base damage . Recharges every 30 / (2 +1 per stack ) seconds .",
    "notes": "The Genesis Loop is a boss item introduced in the Hidden Realms Update, dropped by the   Wandering Vagrant.\nIf the holder falls to 25% of their max health or less, they create a 100m explosion that inflicts 6000% damage on any enemies in the vicinity, similar to the Vagrants' signature supernova attack. This explosion has a short charging period, which decreases with increased attack speed.\nThe player can only explode once every 15 seconds, though this cooldown period is reduced by having more Genesis Loops. If the player happens to still be below 25% health when this cooldown is finished, they will immediately prepare to explode again, even if they have not taken damage recently.\nThe explosion has a proc coefficient of 1.0.\n\n\n== Notes ==\nCorrection: The in-game description of 30s (-50% per stack) is incorrect.\nThe Survivor's model will visibly crackle with electricity when the Genesis Loop is fully charged.\nThe 25% HP threshold is calculated using maximum HP plus maximum shield. For instance, if the player has 750 max HP and 250 max shield, the Genesis Loop will trigger when they reach 250 HP.\n\n\n== Tips ==\nWhile the explosion is charging, the player should try to find the best place to explode and damage the most possible enemies.\nThe  Old War Stealthkit makes this easier, since both items are triggered by taking extensive damage and the Stealthkit grants increased movement speed.\n  Engineer makes excellent use of this item, as his turrets are expendable enough to reliably trigger the explosion without putting Engineer himself in peril.\n  REX's self-damaging abilities make activating the Genesis Loop much easier, and since they can rapidly recover health they can recover from peril safely.\nBy paying the second or third offering at a Shrine of Blood, the player can take a fixed amount of damage and explode on demand, without needing to risk taking damage from enemies.\nBy obtaining 38 stacks of  Personal Shield Generator, and making sure their shield never regenerates, the player can stay permanently below the detonation threshold, though this many stacks of Personal Shield Generator may be difficult to obtain in a normal run.\nThe  Power Elixir triggers simultaneously with the Genesis Loop and does not prevent the explosion from going off, healing the player immediately once they reach the threshold to activate the Genesis Loop. This makes it considerably safer to activate, although this is limited by how many Power Elixirs the player has.\n\n\n== Math ==\nThe cooldown is determined by the formula 30 / (amount + 1)\n\nThe full time between blasts is determined by the formula 30 / (amount + 1) + 3 / attackSpeed + 2\n\n30 / (amount + 1) is the recharge time, after detonation.\n3 / attackSpeed is the charge time, after the Genesis Loop activates but before detonation.\n2 is the detonation duration.\n\n\n== Lore ==\nLab Dissection Analysis File\n\nSubject: Genesis Loop\n\nTechnician: Eleanor Veirs\n\nTable Spec: Dissection 5B4 with Ele-Maintenance Kit\n\nNotes: \n\n> Genesis Loop is highly conductive organ, contains conductive filaments stretching from one end to the other\n\n> Both sides of loop have organelles at end; one has positive charge, one has negative charge\n\n> Sticking ends of loop together generates voltage\n\n> Connected loop and fed organ 50 volts\n\n> Hair stood up on end, touching loop resulting in numbness in fingers\n\n> Upping voltage to 100 volts\n\n> Shooting arcs from organ, loop shudders and glows bright, dissonant humming is heard\n\n> Upping voltage to 200 volts\n\n> Bright flash, a loud crack as loop releases a blast that knocks me back\n\n> Lights go out\n\n> Dissection Table hardware damaged by voltage\n\n> I hope I don’t get in trouble for this\n\n\n== Version History ==\nAnniversary Update\nMajor Content\nAdded New Lore Entry: Genesis Loop\nEarly Access Artifacts Content Update\nBug Fixes\nFix Genesis Loop area indicator being half the actual size of the blast\nEarly Access Hidden Realms Content Update\nMajor Content\nAdded New Boss Item: Genesis Loop\n\n\n== Trivia ==\nThe Genesis Loop is the successor to the Nematocyst Nozzle from Risk of Rain 1, the Wandering Vagrant's boss item in that game.\nUniquely, this boss item was an equipment instead of a regular item. When activated, it would summon multiple homing orbs in the same way that Vagrants do.",
    "url": "https://riskofrain2.wiki.gg/wiki/Genesis_Loop",
    "img_file": "Genesis_Loop.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Boss\\Genesis_Loop",
    "rarity_raw": "Boss"
}