{
    "name": "Sticky Bomb",
    "id": "Sticky_Bomb",
    "desc": "5% (+5% per stack) chance on hit to attach a bomb to an enemy, detonating for 180% TOTAL damage .",
    "notes": "The Sticky Bomb is a returning item in Risk of Rain 2. \nOn hit, the holder has a 5% (+5% per stack) chance to attach a sticky bomb to an enemy. The sticky bomb explodes after 1.5 seconds, dealing 180% total damage in a 10m radius with a proc coefficient of 0.0. The explosion suffers from sweet spot falloff.\n\n\n== Notes ==\nFor reference, a 10m explosion radius is slightly smaller than the fire from 1  Gasoline, and twice as large as an   Overloading Elite lightning bomb.\nOn attacks with proc coefficients of 1.0, and assuming the bomb does not explode after a target has died, one stack of Sticky Bomb averages out to a 9% damage increase.\n\n\n== Lore ==\nIn the blaring heat, a silhouette could be seen, hiding in the cool shade of a nearby cave. She was waiting for the sandstorm to pass.\n\nShe heard a noise and turned around, recognizing another silhouette. It bounded into the cave with excitement. As the figure got closer, she alarmingly noticed the cargo.\n\n\"Woah, what the hell?! Why are you holding like, fifty bombs? Get away from me! \"\n\n\"What! We need these – this planet is trying to kill us! \"\n\n\"You’re a walking bomb. Those are so unstable. Get away! Where did you even find those things? \"\n\n\"I found an industrial 3D printer nearby, and it was assigned to the blueprints of these bombs. Awesome, right? Unlimited bombs!\"\n\n\"…What materials?\"\n\n\"Huh?\"\n\n\"What materials did you put in? We barely had anything.\"\n\n\"I just put in everything.\"\n\n\n== Version History ==\nPS4 & Xbox One Patch\nBug Fixes\nSolved an issue where the Sticky Bomb item would not correctly deal 180% damage.\nAnniversary Update\nQuality of Life\n🌧 Improved Sticky Bomb’s logic for sticking to enemies\nEarly Access Hidden Realms Content Update\nMajor Content\nAdded New Item Lore Entry: Sticky Bomb\nEarly Access 'Skills 2.0' Content Update\nGameplay Changes\n🌧︎Proc Chance: 5%(+2.5% per stack) ⇒ 5%(+5% per stack)\nTier 1 items are the most commonly stacked, and should therefore linearly stack without diminishing returns in most cases.\nEarly Access Scorched Acres Content Update\nGameplay Changes\nDamage: 250% (+125% per stack) additive damage ⇒ 180% total damage\nEarly Access Launch\nIntroduced as \"5% (+2.5% per stack) chance on hit to attach a bomb to an enemy, detonating for 250% additive damage (+125% per stack)\".\n\n\n== Trivia ==\nThe logbook entry likely references the Sticky Bomb before it was changed in the Scorched Acres update; that iteration of Sticky Bomb increased the bomb's damage as well as proc chance with every stack, so finding a Sticky Bomb 3D Printer was often a victorious occurence.",
    "url": "https://riskofrain2.wiki.gg/wiki/Sticky_Bomb",
    "img_file": "Sticky_Bomb.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Common\\Sticky_Bomb",
    "rarity_raw": "Common"
}