{
    "name": "Effigy of Grief",
    "id": "Effigy_of_Grief",
    "desc": "ALL characters within are slowed by 50% and have their armor reduced by 20 . Can place up to 5 .",
    "notes": "The Effigy of Grief is a lunar equipment in Risk of Rain 2.\nWhen activated, a pillar-like effigy is placed at the player's cursor (similarly to  Forgive Me Please), which inflicts {  Cripple on all entities (players and monsters alike) within a 15m radius. Each player can have up to 5 effigies active at once, and if a new one is placed the oldest one expires. The effigies do not disappear otherwise.\n\n\n== Tips ==\nTiming and correct placement is key for utilizing this item to its full potential. Be aware of the surrounding environment and place the effigy at the right time and in the right place to maximize damage.\nAvoid the  Gesture of the Drowned while holding this equipment, as the effigies will automatically be placed when ready.\nThis item is not recommend for melee Survivors like the   Mercenary, since they must get close to enemies to attack and are likely to be Crippled by this item.\nThe  Death Mark has some good synergy with this item, as Cripple contributes to the 4 debuffs necessary and also reduces enemies' armor, causing them to take even more damage.\nSurvivors with a high enough hit rate for  Shattering Justice can potentially lower an enemy's armor by another 60 points, on top of the 20 armor loss from Cripple. Depending on the enemy's base armor, this could range from a 37.50% to 44.44% damage increase.\nShattering Justice also contributes to Death Mark with {  Pulverize Buildup and {  Pulverized (though not at the same time).\nThe effigies have collision and are perpendicular to the surface they are placed on. They can therefore be used for platforming, although the reduced movement speed from Cripple may make this more trouble than it's worth.\nThis also makes the effigies capable of activating the pressure plates on   Abandoned Aqueduct.\n Ben's Raincoat's debuff immunity also applies to the effects of Effigy of Grief, making the player immune to being Crippled.\n\n\n== Lore ==\n“This relic tells a story... But it is not a fairy tale. It’s a tragedy. A story of betrayal, regret, and sorrow. A story of two.”\n\n“Uh… okay…? How the hell do you know that?”\n\n\n== Version History ==\nAnniversary Update\nMajor Content\nAdded New Lore Entry: Effigy of Grief\nEarly Access Content Update 5\nGameplay Changes\nNow placed at where you’re aiming, rather than at your feet\nNo longer is consumed on use.\nNow limited to 5 per map per character.\n\n\n== Trivia ==\nThe Effigy appears to be a sculpture of an abstract/uncanny resemblance of a lizard or   Lemurian. It likely is made to look like it is screaming or reeling in pain.\nThe key features of the Effigy are its stalked/bulging eyes, flailing tongue, and nostrils on the very top of the sculpture towards the end of its muzzle.",
    "url": "https://riskofrain2.wiki.gg/wiki/Effigy_of_Grief",
    "img_file": "Effigy_of_Grief.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Lunar_Equipment\\Effigy_of_Grief",
    "rarity_raw": "Lunar Equipment"
}