{
    "name": "Eclipse Lite",
    "id": "Eclipse_Lite",
    "desc": "When a skill comes off cooldown, gain a temporary barrier for 1% (+0.25% per stack) of your maximum health per second of the skill's base cooldown.",
    "notes": "The Eclipse Lite is an item in Risk of Rain 2, added in the Alloyed Collective expansion.\nWhenever any of the user's skills come off cooldown, they gain barrier equal to 1% (+0.25% per stack) of their maximum health per second of the skill's base cooldown.\n\n\n== Notes ==\nRegaining charges of a skill through  Backup Magazines,  Hardlight Afterburner, and  Lysate Cell does not apply barrier.\nSurvivors that naturaly have extra charges to their skills (  Acrid's leaps,   Railgunner's mines,  False Son's spikes) can recharge barrier simultaniously.\nIt takes around 11 Eclipse Lites to combat natural barrier decay on its own.\n  Bandit's Burst and Blast will not give barrier when reloading the barrel.\n\n\n== Tips ==\n  Mercenary can utilize the barrier gain very well due to his low skill cooldowns and   Expose  reducing them further.\n  Drifter's   Trash to Treasure passive can make Eclipse Lite more effective by reducing her skill cooldowns while she is holding  Item Scrap, Yellow.\n Brainstalks allows you to gain large amounts of barrier as skills recharge quickly.\n Bandolier will activate Eclipse Lite for every skill on cooldown.\nReducing skill cooldowns through  Purity and  Alien Head is recommended, as getting skill charges don't give barrier and leave more time for skills to stay off cooldown, reducing barrier gains.\n  Hungering Gaze grants a large amount of barrier when it reloads. This interaction may be unintended.\n\n\n== Lore ==\nWelcome to DataScraper (v3.1.53 – beta branch) \n\n$ Scraping memory... done. \n\n$ Resolving... done. \n\n$ Combing for relevant data... done. \n\nComplete! \n\nOutputting local audio transcriptions... \n\nProject G Commercial - Draft #05\n\n\"Man, killing these aliens has got me all tuckered out. I could sure use a drink that restores my energy AND quenches my thirst!\" Jean exclaimed as he finished off some Lemurians. \"But what could I find on this hostile alien planet?\" Out of the corner of his eye, Jean spots his saving grace - an Eclipse Lite, mercifully undamaged in an open crate. \"Eureka!\" Jean scooped up the perspiring bottle and hastily unscrewed the cap. Taking a swig, Jean exclaimed in joy. \"Wow, not only is it delicious, it's full of electrolytes! It's what thirsty soldiers on alien planets crave! Thank you Eclipse Zero, bravely frontiering new worlds of flavor!\"\n\nThis log entry has been brought to you by Eclipse: the Galactic Quencher\n\n\n== Placement ==\n\n\n=== Survivors ===\n  Commando places it on his belt, to the left.\n  Huntress places it on her belt, to the right.\n  Bandit places it on his coat, by his waist's right side.\n  MUL-T places it on the right side of its body, below its chest.\n  Engineer places it on his belt, above his left thigh.\n  Artificer places it on her waist, to the left.\n  Mercenary places it on his waist, to the left.\n  REX places it to the right side of its body, between its right legs.\n  Loader places it on her waist, to the left.\n  Acrid places it on its waist, to the left.\n  Captain places it on his belt, to the right (normally covered by his coat).\n  Railgunner places it on her waist, to the left.\n  Void Fiend places it on its waist, to the left.\n  Seeker places it on her waist, to the right.\n  False Son places it resting above his waist, to the left.\n  CHEF places it above its roller pin's left fork leg.\n  Operator places it on his visor's left side.\n  Drifter places it outside of her bag's left pocket.\n\n\t\t\n\n\n=== Non-Playable Characters ===\n\n\t\t\n\t\t\n\t\t\n\n\n== Version History ==\nAlloyed Collective\n\nAdded New Item: Eclipse Lite\n\n\n== Trivia ==\nEclipse Lite was originally named \"Gup Gulp\" during development.\nThis is why the item creates orange splat particles when it activates.\n\"It's full of electrolytes! It's what thirsty soldiers on alien planets crave!\" Is a reference to the movie \"Idiocracy\".",
    "url": "https://riskofrain2.wiki.gg/wiki/Eclipse_Lite",
    "img_file": "Eclipse_Lite.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Common\\Eclipse_Lite",
    "rarity_raw": "Common"
}