{
    "name": "Pluripotent Larva",
    "id": "Pluripotent_Larva",
    "desc": "Upon death , this item will be consumed and you will return to life with 3 seconds of invulnerability , and all of your items that can be corrupted will be. Corrupts all Dio's Best Friends .",
    "notes": "The Pluripotent Larva is a void item added in the Survivors of the Void expansion, and the corruption of  Dio's Best Friend. \nUpon dying, the holder will be revived after a few seconds. This will trigger any on-death effects, such as the ice explosions from {  Glacial Elites. Upon reviving, the holder gets 3 seconds of {  invincibility, and the item is consumed. Additionally, all items in the player's inventory that have a void variant will become corrupted.\n\n\n== Notes ==\nThe following lists all items that will be corrupted by Pluripotent Larva:\n\n Lens-Maker's Glasses →  Lost Seer's Lenses\n Rusted Key →  Encrusted Key\n Tri-Tip Dagger →  Needletick\n Tougher Times →  Safer Spaces\n Bustling Fungus →  Weeping Fungus\n Fuel Cell →  Lysate Cell\n AtG Missile Mk. 1 →  Plasma Shrimp\n Ukulele →  Polylute\n Will-o'-the-wisp →  Voidsent Flame\n Chronobauble →  Tentabauble\n Kjaro's Band /  Runald's Band  →  Singularity Band\n 57 Leaf Clover →  Benthic Bloom\nAll boss items (excluding  Artifact Key) →  Newly Hatched Zoea\n\n\n== Tips ==\nDue to a Legendary items' rarity,  Dio's Best Friend is much harder to find than Pluripotent Larva. As a result, the Pluripotent Larva is an excellent alternative to extra lives and can be found much easier with the use of  Encrusted Keys.\nDepending on how many items can be corrupted at the time of revival, this item could be detrimental depending on the corruptible items in question.\n Lysate Cell may be useless with certain abilities such as   MUL-T's   Retool, where its uncorrupted variant could be far more useful.\nConverting 57 Leaf Clovers into  Benthic Blooms removes the player's luck and also begins randomly upgrading their items to higher tiers, which could remove valuable common/uncommon items.\n Newly Hatched Zoea will convert all boss items, which can take away very powerful sources of damage.\nConverting  Lens-Maker's Glasses  into  Lost Seer's Lenses can be very detrimental if the player has several skills or items involved with crit, or is planning to fight one of the final bosses.\n Runald's and  Kjaro's Bands will be converted to  Singularity Bands, which can be devastating to high burst damage survivors like   Loader,   Artificer, and   Railgunner, as the Singularity Band deals much less damage than the other bands, and has double the cooldown.\nIf the player encounters a  Benthic Bloom and has access to a  Recycler, they can convert the item into a Pluripotent Larva 100% of the time. This is because these are the only two Void Legendary items in the pool and the Recycler cannot recycle something into the same object.\n\n\n== Lore ==\n\"Life finds a way. Even in the depths of creation, there's bound to be something crawling along the sand, just hoping to make it through the day.\n\nWhy don't you take a ride in their shoes, just for one day? You may come out of the experience with a brand new perspective.\"\n\n\n== Version History ==\nSurvivors of the Void\n(Undocumented) Added New Item: Pluripotent Larva\n\n\n== Trivia ==\nThe original concept for this item would revive you as a   Void Reaver instead.\nInstead than the usual \"Revived!\" message that appears when triggering the uncorrupted variant, Pluripotent Larva will instead display \"Revived..?\"\nThe term \"pluripotent\" refers to a cell that can give rise to a variety of different cells; this is referenced by how this item gives rise to void items.\nThis item, on the character model of whoever is holding it, constantly moves its eye. However, this can only be noticed if the holder stands still.\nItems that are obtained for the first time with this corruption do not count for the logbook.",
    "url": "https://riskofrain2.wiki.gg/wiki/Pluripotent_Larva",
    "img_file": "Pluripotent_Larva.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Void\\Pluripotent_Larva",
    "rarity_raw": "Void"
}