{
    "name": "Bolstering Lantern",
    "id": "Bolstering_Lantern",
    "desc": "Increase your attack speed by 10% (+3.5% per stack) for up to 3 (+1 per stack) enemies and allies within 20 meters.",
    "notes": "Bolstering Lantern is an item in Risk of Rain 2, added in the Seekers of the Storm expansion.\nEach enemy and ally within 20m grants the holder a   Lantern Buff stack, increasing the holder's attack speed by 10% (+3.5% per stack). The Lantern Buff can stack up to 3 (+1 per stack) times.\n\n\n== Notes ==\nThe Bolstering Lantern's area of effect is indicated by a blue-green ring on the ground around the holder.\nIndividual stacks of the Lantern Buff are immediately added/removed as enemies and allies enter/leave the radius.\n\n\n== Lore ==\nTo proceed with construction of our [hope], we must master the powers of this temple, and so, regrettably-\nONE DESECRATED FRAGMENT, STOLEN FROM A HOLY STRUCTURE.\nTo proceed is already difficult, I wish you wouldn’t say it like that-\nI WATCH THE SLOW LEMURIAN CARVE PROTECTIVE RUNES.\n-…I see you’ll be testing my patience in this collaboration.\nLET US BEGIN.\nI see a fine light, but we’re hoping to use it for strength when we’re wound-\nA PALM OF AMETHYST DUST – THIS IS FOR STRENGTH.\nA PINCH OF [powder] – THIS IS FOR S-.\nStop stop! We are not ready to introduce Soul yet, it’s unstable. We want something to make us, and our [hope], stronger.\nHOW WILL IT MAKE FRIENDS WITHOUT SOUL, ELDER ONE?\n\n\n== Placement ==\n\n\n=== Survivors ===\n  Commando places it on his left thigh.\n  Huntress places it on the back of her belt, to the left.\n  Bandit places it on his belt, to the left.\n  MUL-T places it on its 'waist', to the left.\n  Engineer places it on his belt, to the right.\n  Artificer places it on her waist, to the right.\n  Mercenary places it on the back of his waist, to the left.\n  REX places it near the bottom of its body, on its right side.\n  Loader places it on her waist, to the left.\n  Acrid places it over its left leg.\n  Captain places it on his waist, to the left.\n  Railgunner places it on her left thigh.\n  Void Fiend places it on its waist, to the right.\n  Seeker places it on the rope around her waist, over her right thigh.\n  False Son places it on his waist, to the left.\n  CHEF places it hanging from the bottom of its chest piece, on the leftmost rear corner.\n  Operator places it on his belt, over his right thigh.\n  Drifter places it on the side of her puffer jacket, over her right thigh.\n\n\t\t\n\n\n=== Non-Playable Characters ===\n\n\t\t\n\t\t\n\nThe   Scavenger has no visible placement for this item.\n\n\n== Version History ==\nUpdate Notes V1.3.8\nScaling is now more focused on the item's utility rather than increasing its effective range. It now grants 10% (+ 3.5% per stack) attack speed (up from a flat 7.5%). That effect is granted per Monster or Ally in a 20 meter range up to 3 (+ 1 per stack). The range no longer scales with additional Lanterns.\nUpdate Notes V1.3.7\nAttack speed bonus has been reduced from 10% to 7.5% per enemy within 20 meters.\nUpdate Notes V1.3.6\nOld Functionality - When below 50% health, receive a damage increase of 20%\nNew Functionality - Increase your attack speed by 10% for up to 4 (+2 per stack) enemies and allies within 20 (+5 per stack meters.)\nSeekers of the Storm\nAdded 18 Pickups\nBolstering Lantern\n\n\n== Gallery ==",
    "url": "https://riskofrain2.wiki.gg/wiki/Bolstering_Lantern",
    "img_file": "Bolstering_Lantern.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Common\\Bolstering_Lantern",
    "rarity_raw": "Common"
}