{
    "name": "Little Disciple",
    "id": "Little_Disciple",
    "desc": "Fire a tracking wisp for 300% (+300% per stack) damage . Fires every 1.6 seconds while sprinting. Fire rate increases with movement speed .",
    "notes": "The Little Disciple is a boss item introduced in the Scorched Acres Update, dropped by the   Grovetender. \nWhile the holder is sprinting, they periodically shoot homing wisps at enemies, dealing 300% (+300% per stack) damage per wisp. The speed at which the wisps are fired increases as movement speed increases.\nThe wisps have a range of 40m and a proc coefficient of 1.0.\n\n\n== Math ==\nThe time in seconds between each fired wisp is determined by the formula 35 / (3 ⋅ movementSpeed)\n\n\n== Tips ==\nThis item is most useful on Survivors that have the Agile keyword on their skills, such as   Huntress, allowing them to sprint constantly while using their skills and gain many bonus attacks from the Little Disciple.\nDespite their movement,   Engineer's   TR58 Carbonizer Turrets do not benefit from this item, as they are not sprinting.\n\n\n== Lore ==\nHELLO, LITTLE ONE. HOW WAS YOUR ADVENTURE TODAY?\n\nOH\n\nYOUR FORM IS BROKEN, LITTLE ONE. WHAT TRICKERIES HAVE YOU GOTTEN YOURSELF INTO?\n\nOH\n\nDO YOU TIRE OF ADVENTURE? \n\nWOULD YOU LIKE TO HELP ME TEND TO THE GARDEN, MY LITTLE ONE?\n\nI UNDERSTAND. OH, YOUR FORM! DO NOT WORRY. COME CLOSER.\n\nHERE - TWO COILS OF DENKU ROPE. THOSE ARE FOR STRENGTH.\n\nHERE - FOUR CARDS OF OBSIDIAN. THOSE ARE FOR SELF-CONFIDENCE.\n\nI GIVE YOU NOTHING FOR SPIRIT.\n\nOH, DO NOT WORRY! WE WILL STILL GO ON ADVENTURES. THEY WILL BE QUIET ADVENTURES. \n\nCOME CLOSER - CLOSER NOW. \n\nCLOSER!\n\nNOW WATCH - WATCH CLOSELY. \n\nWATCH HOW I TEND TO OUR GARDEN.\n\n\n== Version History ==\nPC Patch v1.0.1.1 (Build ID No.5440050)\nBug Fixes\nFix Little Disciple always triggering once as soon as it’s picked up, regardless of sprint state\nEarly Access Content Update 5\nGameplay Changes\nFire Rate: 0.5s ⇒ 1.6s\nDamage Coefficient: 100% (+100% per stack) ⇒ 300% (+300% per stack)\n🌧Fire Rate now scales with movement speed\nEarly Access 'Skills 2.0' Content Update\nMajor Content and Changes\nAdded New Item Lore Entry: Little Disciple\nEarly Access Scorched Acres Content Update\nMajor Content and Changes\nAdded New Boss Item: Little Disciple",
    "url": "https://riskofrain2.wiki.gg/wiki/Little_Disciple",
    "img_file": "Little_Disciple.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Boss\\Little_Disciple",
    "rarity_raw": "Boss"
}