{
    "name": "Benthic Bloom",
    "id": "Benthic_Bloom",
    "desc": "Upgrades 3 (+3 per stack) random items to items of the next higher rarity at the start of each stage . Corrupts all 57 Leaf Clovers .",
    "notes": "The Benthic Bloom is a void item in Risk of Rain 2, added in the Survivors of the Void expansion, and corrupts all  57 Leaf Clover's . \nAt the start of each stage, the item selects 3 (+3 per stack) random Common or Uncommon items in the holder's inventory. Each stack of a selected item randomly transforms into an equal-sized stack of a random item of the next higher rarity (for example, a stack of 4  Mocha would transform into 4 of a random green item). \n\n\n== Notes ==\nLegendary, boss, Meal, void, lunar, and untiered items (such as  Tonic Affliction,  Empty Bottle, etc) cannot be transformed.\nThe items are chosen at random regardless of rarity, stacks, or pick-up history. The items in the transformation rarity are shuffled and if the selected item belongs in any of the Damage, Healing, or Utility categories, the items in the transformation rarity are ordered to include those first. For example,  Mocha will prioritise any Uncommon Damage/Utility items to transform into.\nThis means if the selected item is either White Scrap or Green Scrap, no items will be prioritised for the transformation.\n 57 Leaf Clover is not excluded from being upgraded into, meaning the Benthic Bloom will inevitably start to duplicate itself at an exponential rate.\nIf a player has less items than the total that Benthic Bloom would upgrade at once, it's possible for it to select the same item twice. This means that an item can go straight from Common to Legendary in a single stage.\nAdditionally, identical items are consolidated into a single stack even in the middle of the Bloom's transformation sequence. This means a stack of a Common item can be upgraded twice if it combines with a stack of an Uncommon item the player already has. For example, if the player has 1  Mocha, 1  Soldier's Syringe, and 1  Shuriken, it is possible for the Benthic Bloom to first upgrade the Mocha and Soldier's Syringe into 2 Shurikens (for a total stack of 3 Shurikens). After this, it is possible that the third and final upgrade will be to upgrade the Shurikens into 3  Brilliant Behemoth. While this is an improbable scenario, it is not impossible.\n\n\n== Tips ==\nObtaining a Benthic Bloom in the first few stages of a run can lead to a massive boost in power by giving the player more Uncommon and Legendary items than normal by the end of the first loop, with the tradeoff of not having as many stacks of Common items.\nOn the other hand, since the Benthic Bloom transforms full stacks of the chosen items, obtaining it very late in a looping run may cause more trouble than it is worth. Suddenly losing all stacks of offensive items such as  Lens-Maker's Glasses or  AtG Missile Mk. 1 can drastically reduce damage output, losing healing & utility items such as  Leeching Seed or  Tougher Times can make it much harder to survive, and because very few legendary items grant movement speed or mobility, this can be a big issue if  Paul's Goat Hoof,  Energy Drink, or  Wax Quail are lost.\nOne of the largest downsides of this item is that it will eventually consolidate the players items into stacks of Legendary items, most of which have very weak benefits when being stacked.\n Growth Nectar is one of the only reliable sources of speed and other stats as well as stacking very well, however the lack of lower tier items can make it harder to retain buffs for its effects\n Wake of Vultures is the most reliable method to retain multiple buffs especially when gaining multiple stacks. Getting stacks of both of these items can highly offset the downsides of Benthic Bloom.\nMaking good use of the items that cannot be converted is the most reliable way to keep on top of Benthic Bloom's random variance.\nBecause Void items cannot be transformed, corrupting items can keep them \"safe\" from being lost, albeit with a different effect.\nMeal items are also unable to be transformed, allowing the player to always be able to rely on their powerful effects.\nLunar items can also help cover for any weaknesses the player may suffer from. A full uptime  Spinel Tonic can help with speed,  Shaped Glass can help with damage and  Corpsebloom is extremely powerful healing due to the very high chance of gaining multiple stacks of  Rejuvenation Rack.\nPicking up this item will entirely prevent the player from obtaining  Ultimate Meal for the run since it specifically requires using clovers to be crafted.\nHowever if the player were to craft Ultimate Meal first they can make use of Benthic Bloom's effects while still retaining a large luck increase.\n\n\n== Lore ==\n\"Luck? Who needs luck, in a place like this.\n\nTo survive here, you'd need more than just luck. You need intuition. Instinct. The right tools. Power.\n\nI know you're scared. And I am too. But if there's anything this hell hole has taught me...\n\nWe make our own luck.\"\n\n- Signal Echoes, UES Contact Light\n\n\n== Version History ==\nSurvivors of the Void\n(Undocumented) Added New Item: Benthic Bloom\n\n\n== Trivia ==\nIn keeping with the deep-sea theming of the Void, the term \"benthic\" refers to the very bottom of a body of water; in the context of this item, it can be surmised that the Benthic Bloom originates from the deepest recesses of the Void.\nThis may also be why the Benthic Bloom is the corruption of a legendary item, to reflect its scarcity and difficulty to obtain due to the depth of the Void it originates from.",
    "url": "https://riskofrain2.wiki.gg/wiki/Benthic_Bloom",
    "img_file": "Benthic_Bloom.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Void\\Benthic_Bloom",
    "rarity_raw": "Void"
}