{
    "name": "Will-o'-the-wisp",
    "id": "Will_o__the_wisp",
    "desc": "On killing an enemy, spawn a lava pillar in a 12m (+2.4m per stack) radius for 350% (+280% per stack) base damage .",
    "notes": "The Will-o'-the-wisp is a returning item in Risk of Rain 2. \n1 second after the holder kills an enemy, a fiery blast spawns where that enemy died. The blast has a 12m (+2.4m per stack) radius and deals 350% (+280% per stack) base damage. This damage suffers from sweet spot damage falloff.\nThe explosion has a proc coefficient of 1.0.\n\n\n== Math ==\n\n\n== Tips ==\nStacking both Will-o'-the-wisps and  Crowbars can allow the player to rapidly chain together kills against grouped enemies, or at the very least inflict heavy damage.\nThis is especially effective with the Artifact of Swarms enabled.\nUsing the Will-o'-the-wisp with the  Forgive Me Please allows the player to throw the doll at enemies for effective area damage.\nThe knock-back effect created from the explosion can scatter targets, which is not only useful for crowd control, but can also send light airborne targets like   Lesser Wisps and   Jellyfish crashing against terrain, dealing massive damage.\n\n\n== Lore ==\nAudio transcription complete from portable recorder.\n\nPrinting...\n\n\"You don’t want to re-name it Bill-o-the-Wisp?\"\n\n\"NO.\"\n\n\"JAR-ed?\"\n\n\"NO.\"\n\n\"Then what about FLARE-ed?\"\n\n\"STOP.\"\n\n\"It needs a name, it’s no dif-FIRE-ent than you or me.\"\n\n\"Next time we’re at base I’m applying for a transfer.\"\n\n\"You know that won’t go through until at least Dec-EMBER.\"\n\n\"How long have you been waiting to use these?\"\n\n\"Coming up with them on the spot. I’ve got a good head on my SMOULDERS.\"\n\n\"You can stop emphasizing those words so much. I get it.\"\n\n\"I will never stop FUELING around.\"\n\n\"...\"\n\n\"...\"\n\n\"...\"\n\n\"Want to grab something to eat when we get back?\"\n\n\"Thank the stars that’s over, yes. I hope they’re not serving that gruel we had yesterday.\"\n\n\"Maybe they’ll cook you a pep-PYRO-ni pizza?\"\n\n\"...\"\n\n\"Hey, wait up! I can’t run holding this thing, it might go off!\"\n\n\n== Version History ==\nEarly Access Content Update 5\nMajor Content\nAdded New Item Lore Entry: Will-o'-the-wisp\nEarly Access Patch (Build ID No.3703355)\nBug Fixes\nFalloff models for delayed blast attacks (Willowisp) are now properly assigned. This may cause them to do more damage than before.",
    "url": "https://riskofrain2.wiki.gg/wiki/Will-o%27-the-wisp",
    "img_file": "Will_o__the_wisp.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Uncommon\\Will_o__the_wisp",
    "rarity_raw": "Uncommon"
}