{
    "name": "Ghor's Tome",
    "id": "Ghor_s_Tome",
    "desc": "4% (+4% on stack) chance on kill to drop a treasure worth $25 . Scales over time.",
    "notes": "Ghor's Tome is an item introduced in the Hidden Realms Update.\nWhen the holder kills an enemy, there is a 4% (+4% per stack) chance for that enemy to drop a gold nugget. Picking up the gold nugget awards the player with gold equal to the value of one Small Chest. \n\n\n== Notes ==\nThe gold from nuggets is awarded to all players.\nUnlike the on-kill drops from the  Bandolier and  Monster Tooth, gold nuggets do not always gravitate towards the player as they approach.\nGold nuggets also never despawn, unlike the ammo boxes and healing orbs.\nThe infinitely respawning, destructible rocks in Sky Meadow can drop treasures.\nThe same is true for the clay pots in Abandoned Aqueduct and the exploding barrels on Rallypoint Delta, although these objects are significantly more dangerous.\nThe chance to drop a gold nugget is affected by Luck.\nThe effective stacking limit is 25, for a 100% chance to drop gold.\nIf a Monster activates its own Ghor's Tome and collects it, it will not increase the money obtained from killing it.\n\n\n== Tips ==\nThis item is significantly less helpful if the Artifact of Sacrifice is active, as almost all uses for gold are no longer present.\nActivating  Forgive Me Please with a Ghor's Tome can drop up to 8 gold nuggets.\n\n\n== Lore ==\nOrder: “Ghor’s Tome”\n\nTracking Number: 19******\n\nEstimated Delivery: 07/07/2056\n\nShipping Method: Priority\n\nShipping Address: 99th Floor, Crumbling Tower, Venus\n\nShipping Details:\n\nAncient secrets... transmutation... homunculi... alchemy. Nothing more than nonsense - pursuits of rightly intentioned but grossly misled minds. Or so I thought. This item's... unexpected physical properties are reason enough to stay my immediate dismissal.\n\nStrange fortune led this book to me, and stranger knowledge still fills the pages. Chilling, even. It concludes, in chapter eight, that even iron can become gold - but only through a ritual of intense bloodletting, a thought disturbing enough without considering the bountiful riches that accompanied the estate.\n\nThe takeaway, above all else, seems to be that you cannot get something from nothing; even the very paper of the tome turned to ash as I tried to make photocopies. Whatever was on the first two pages is lost forever. I need transcriptions of the rest by hand, and I know you take pride in your precision. \n\nAnd more importantly, Kosta, I trust you. Don't do anything that would draw attention to yourself. I will try to find the other volumes. This is knowledge too dangerous to lose.\n\n\n== Version History ==\nEarly Access Artifacts Content Update\nMajor Content\nAdded New Item Lore Entry: Ghor's Tome\nEarly Access Hidden Realms Content Update\nMajor Content\nAdded New Item: Ghor’s Tome\n\n\n== Trivia ==\nThe item is named after Jeffrey \"Ghor\" Hunt, main programmer for Hopoo Games.\nGhor is the name of a bounty hunter in Metroid Prime 3: Corruption.\nGhor has stated that the item was based off of alchemy, and that this being his item was only in name. Its original name was going to be \"Alchemist's Tome.\"",
    "url": "https://riskofrain2.wiki.gg/wiki/Ghor%27s_Tome",
    "img_file": "Ghor_s_Tome.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Uncommon\\Ghor_s_Tome",
    "rarity_raw": "Uncommon"
}