{
    "name": "The Crowdfunder",
    "id": "The_Crowdfunder",
    "desc": "Fires a continuous barrage that deals 100% damage per bullet . Costs $1 per bullet. Cost increases over time.",
    "notes": "The Crowdfunder is an equipment in Risk of Rain 2. It is unlocked and starts appearing in runs after completing the Funded! Challenge.\nIt is different from most equipment in that it has no cooldown; instead, activating the Crowdfunder toggles it between an \"on\" and \"off\" state. When activated, the Crowdfunder will fire 3 shots per second, slowly increasing its fire rate over 10 seconds and visibly spinning faster. Once spun up, it fires 15 shots per second. Each bullet fired from the Crowdfunder deals 100% damage with default damage falloff and a proc coefficient of 1.0, but also costs the holder 1 gold per shot (though this cost scales with the holder's level).\nIf the holder has no gold remaining, the Crowdfunder stops firing, but will immediately begin firing again once the holder gains enough gold to finance it.\n\n\n== Notes ==\nCorrection: The in-game description of Cost increases over time. is incorrect. The cost of each shot fired is equal to: 1 + (player level - 1)/4\nThe Crowdfunder's attacks are actually hitscans; the \"bullets\" fired are purely visual.\n Fuel Cell and  Bottled Chaos have no effect when using the Crowdfunder.\nThis makes it an especially good equipment option when using  Lysate Cells.\nHaving a  Gesture of the Drowned causes the Crowdfunder to always be active. This can make it difficult to buy anything, as the player is constantly losing gold. This is particularly problematic in the early game, when players likely do not have the firepower to rapidly kill monsters (and the monsters do not drop much gold anyways), but it becomes less of an issue late game due to difficulty scaling, as mentioned previously.\n\n\n== Tips ==\nAlthough giving up gold for damage may not initially seem like a good tradeoff, the Crowdfunder's sheer damage output more than makes up for it. For reference, at its maximum fire rate, the Crowdfunder deals 2.5 times as much damage per second as   Commando's   Double Tap, with 2.5 times the procs as well.\nSince enemy level and gold drops increase considerably faster than player level (especially on higher difficulty), the Crowdfunder's consumption of gold is rarely an issue past the second stage, especially if the player has  Ghor's Tome,  Roll of Pennies or a  Brittle Crown.\nThe Crowdfunder becomes self-sustaining while holding the  Brittle Crown, but the player must not take damage and thus lose gold.\nHaving the Artifact of Sacrifice enabled can make the Crowdfunder more usable, since players will not need money to obtain most items.\nThe Crowdfunder can be a great way to get multiple stacks of effects such as bleed.\n\n\n== Lore ==\nOrder: The Crowdfunder\n\nTracking Number: 783*****\n\nEstimated Delivery: 05/09/2056\n\nShipping Method: Standard\n\nShipping Address: 206 29th Ave, High Chariot, Mercury \n\nShipping Details:\n\nThe wealthy overlords on Primas V went to great measures to break the will of the lower class. They kept the threat of injury and death constant, which helped to keep their servants in check, but this was only half of their method. \n\nTo further highlight the vast differences in status, their extravagant weapons were fueled by currency - they were literally throwing money at them.\n\nI don’t have to tell you how that turned out for them. It’s why my client is in hiding now and has to pawn these things off. He thanks you for your patronage in these trying times.\n\n\n== Version History ==\nPC Patch v1.1.1.2\nBug Fixes\nFixed The Crowdfunder not working on characters without the display (i.e   Heretic)\nEarly Access Content Update 5\nMajor Content\nAdded New Item Lore Entry: The Crowdfunder\nEarly Access 'Skills 2.0' Content Update\nGameplay Changes\nProc Coefficient: 0.2 ⇒ 1\n\n\n== Trivia ==\nWhile in use, the Crowdfunder makes the same sound as the slot machines (while spinning) in Ratchet and Clank 1-3, Size Matters and Secret Agent Clank.\nThis item may be a reference to the Coin Gun from Terraria, an extremely rare and powerful weapon that shoots the player's coins as bullets.\nIt may also be a spiritual successor to the Golden Gun from the first Risk of Rain game, which was an uncommon item that boosted the holder's damage the more gold they had.\nThe Crowdfunder is unlocked by collecting $30,480 gold, a reference to the amount pledged on Kickstarter for the first Risk of Rain game.",
    "url": "https://riskofrain2.wiki.gg/wiki/The_Crowdfunder",
    "img_file": "The_Crowdfunder.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Equipment\\The_Crowdfunder",
    "rarity_raw": "Equipment"
}