{
    "name": "Shatterspleen",
    "id": "Shatterspleen",
    "desc": "Gain 5% critical chance . Critical Strikes bleed enemies for 240% base damage . Bleeding enemies explode on death for 400% (+400% per stack) damage, plus an additional 15% (+15% per stack) of their maximum health .",
    "notes": "The Shatterspleen is a boss item in Risk of Rain 2, dropped by the   Imp Overlord. \nThe player gains 5% critical strike chance, and all critical strikes will inflict   Bleed on enemies. Additionally, any enemy that dies while bleeding will explode, inflicting 400% (+400% per stack) damage plus 15% (+15% per stack) of its maximum health to nearby enemies within 16m.\n\n\n== Notes ==\nCorrection: The in-game description does not specify the +5% critical strike chance.\nThe Bleed applied by the Shatterspleen is the same as the Bleed inflicted by the Tri-Tip Dagger; if both items are held, only one instance of bleed can be applied at a time.\nCorrupting any Tri-Tip Daggers into  Needleticks  will not replace the Bleed from Shatterspleen with   Collapse.\nWhen paired with the  Ocular HUD’s effect, all damage the player deals will stack Bleed for the duration.\nIf the target is killed in one shot by a critical hit, it will not explode, since it dies before any Bleed is applied to it.\n\n\n== Lore ==\nLab Dissection Analysis File\n\nSubject: Shatterspleen\n\nTechnician:  Professor Mehri Daimera\n\nTable Spec: Spillproof BDC-3\n\nNotes:\n\n> This will be my third attempt at a dissection of an Imp organ\n\n> First attempt resulted in rupture\n\n> Second attempt resulted in rupture\n\n> Cutting into the outer layer produces copious amounts of fluid discharge\n\n> As the fluid flows, the rest of the organ, inexplicably, swells\n\n> Swelling will ultimately result in violent rupture\n\n> Made use of the stemming tools on the BDC-3 to successfully proceed without incident\n\n> Surprised to find sharp needle point objects (bones?) inside\n\n> Timestamping for break\n\n> Came back to leave some final notes\n\n> Third attempt aborted after I injured my hand\n\n> Eventually was able to stop my own bleeding. The organ seems to contain immense anticoagulant properties.\n\n\n== Version History ==\nSurvivors of the Void\n(Undocumented) Instances of Bleed from Shatterspleen no longer stack when combined with Tri-Tip Dagger.\nEarly Access Content Update 5\nMajor Content\nAdded New Boss Item: Shatterspleen\nAdded New Item Lore Entry: Shatterspleen\n\n\n== Gallery ==",
    "url": "https://riskofrain2.wiki.gg/wiki/Shatterspleen",
    "img_file": "Shatterspleen.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Boss\\Shatterspleen",
    "rarity_raw": "Boss"
}