{
    "name": "Shaped Glass",
    "id": "Shaped_Glass",
    "desc": "Increase base damage by 100% (+100% per stack) . Reduce maximum health by 50% (+50% per stack) .",
    "notes": "The Shaped Glass is a lunar item in Risk of Rain 2. \nThe holder's base damage is doubled (x2 per stack), but in exchange, their total maximum health is halved (x0.5 per stack). Both these effects stack exponentially, meaning that stacking Shaped Glass will dramatically increase damage but reduce the holder's health to nearly nothing.\n\n\n== Notes ==\nThe main drawback of Shaped Glass is the removal of one-shot protection, meaning the player is always in danger of dying from a single attack. Strong-hitting enemies like the   Stone Golem become more threatening when holding this item.\nBarrier items like the  Topaz Brooch pair well with Shaped Glass, as barrier decays slower with lower maximum health and provides much-needed survivability.\n Tougher Times and  Repulsion Armor Plate are invaluable items to use with Shaped Glass. The Armor Plate mitigates damage-over-time effects such as{  Burn, and attacks from light-hitting enemies like the  Lesser Wisp.\nTougher Times's void counterpart,  Safer Spaces, may prove more reliable than its uncorrupted version, as it is guaranteed to block a hit. The  Oddly-shaped Opal provides a similar benefit, drastically reducing the damage from a single hit. However, players must be aware of these items' cooldowns.\nFixed damage, such as  N'kuhana's Opinion and  Helfire Tincture, is not increased by the Shaped Glass, since these items do not use the Survivor's base damage stat.\nThis also means that any total damage items activated by these sources, such as  AtG Missile Mk. 1 and  Ukulele, are not increased by the Shaped Glass.\nDue to the limits of the floating-point number system, Shaped Glass has a stacking limit of 127. When holding 128 or more, the holder's health rounds to 0 and they immediately die.\n\n\n== Math ==\nThe damage is determined by the formula damage ⋅ 2 ^ amount\nThe maximum health is determined by the formula health ⋅ 0.5 ^ amount\n\n\n== Lore ==\n========================================\n====   MyBabel Machine Translator   ====\n====     [Version 12.45.1.009 ]   ======\n========================================\nTraining... <100000000 cycles>\nTraining... <100000000 cycles>\nTraining... <100000000 cycles>\nTraining... <50912157 cycles>\nPaused...\nDisplay partial result? Y/N\nY\n================================\nPairings\n\nUnstructured glass, from the heart of the [Moon]. Sung out, in ethereal wisps, over the course of 3 cycles. Pause.\n\nWe fold time into its material - twice. Our time and <his>. A cost <he> was willing us to pay. Folded and shaped, with a god's designs.\n \n<He> wields it, in one of many great hands. The time we injected is unfolded in <his> grasp. Outputs quicken - muscles compress twice. Twice as many intentions. Twice the ordered complexities, folded upon themselves. Loops loop back onto [?] in pairs. Time dependent functions. Pause.\n\n<He> sunders a construct into a thousand pieces.\n\nBut time is fair. Microtears begin to uncoil in pairs. Muscles begin to snap, twice as fast. The cost of folded time. But <he> has plenty of time.\n\n================================\nContinue training? Y/N\nY\n\n\n== Version History ==\nEarly Access Hidden Realms Content Update\nGameplay Changes\n🌧Add special death message for dying while carrying Shaped Glass\n\n\n== Trivia ==\nPrior to the 1.0 Update, one-shot protection was unaffected by Shaped Glass, but now Shaped Glass removes the player's one-shot protection entirely.\nObtaining Shaped Glass does not cause the player to take damage, despite the health bar's red animation.\nShaped Glass may be based upon Rupert's Glass, a strange phenomena where a droplet shaped piece of glass is borderline invulnerable from one side, but absolutely vulnerable on the other.\nDying while holding Shaped Glass results in a unique death animation, where the player's Survivor shatters into shards of glass. Additionally, the death message while holding Shaped Glass is unique, displaying \"You have shattered into innumerable pieces.\"\nThis animation is identical to the one used when the player obliterates themself at the Obelisk in A Moment, Fractured. However, the character's model will ragdoll as if they died normally for a moment before shattering.",
    "url": "https://riskofrain2.wiki.gg/wiki/Shaped_Glass",
    "img_file": "Shaped_Glass.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Lunar\\Shaped_Glass",
    "rarity_raw": "Lunar"
}