{
    "name": "Charged Perforator",
    "id": "Charged_Perforator",
    "desc": "10% chance on hit to down a lightning strike, dealing 500% (+500% per stack) damage .",
    "notes": "The Charged Perforator is a boss item in Risk of Rain 2, dropped by the   Overloading Worm. \nWhen the holder damages an enemy, there is a 10% chance that lightning will strike that enemy, dealing 500% (+500% per stack) total damage.\nThe lightning strike has a proc coefficient of 1.0.\n\n\n== Notes ==\nCorrection: This item does total damage, meaning it deals 500% of the damage of the hit that triggered it, not 500% base damage.\nThe lightning strike is almost identical to that of the  Royal Capacitor, in which they both have a delayed strike that can be avoided by the target if said target is fast enough.\nUnlike all other total damage items, the Charged Perforator rolls its critical strike chance independently of the triggering hit; the rest of the total damage items will land critical strikes if and only if the activating hit is a critical strike.\n\n\n== Tips ==\nThe Charged Perforator is especially effective for dealing with flying monsters, since the lightning strike deals severe downward knockback. An airborne enemy struck by lightning will be pushed down at high speeds, suffering heavy damage when it collides with the ground.\nThis is even more effective for monsters flying above bottomless pits, as they will be instantly killed when shoved downwards.\n\n\n== Lore ==\nLab Dissection Analysis File\n\nSubject: Charged Perforator\n\nTechnician: Dema \"Dembones\" Brown\n\nTable Spec: GEC-4\n\nNotes:\n\n> Using GEC-4 due to electricity above safe levels.\n\n> Removing charged enamel and placing aside for substance analysis. It’s solid, yet swimming.\n\n> Upon structural investigation, found cavities and internal batteries\n\n> Reduce lab electricity by 10 kilowatts\n\n> Electron generating veins present - charge is being supplied to the tooth?\n\n> Removed my lab coat, very staticky\n\n> Electron generation is still occurring in the severed object\n\n> Put some more ice in my drink WOW it's electric\n\n> Timestamping for dance break\n\n\n== Version History ==\nAnniversary Update\nMajor Content\nAdded New Boss Item: Charged Perforator\nAdded New Lore Entry: Charged Perforator\n\n\n== Trivia ==\nThis item's logbook entry is a word-for-word parody of the  Molten Perforator's.",
    "url": "https://riskofrain2.wiki.gg/wiki/Charged_Perforator",
    "img_file": "Charged_Perforator.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Boss\\Charged_Perforator",
    "rarity_raw": "Boss"
}