{
    "name": "Gnarled Woodsprite",
    "id": "Gnarled_Woodsprite",
    "desc": "Gain a Woodsprite follower that heals for 1.5% of your maximum health /second . Can be sent to an ally to heal them for 10% of their maximum health .",
    "notes": "The Gnarled Woodsprite is an equipment in Risk of Rain 2. It is unlocked and starts appearing in runs after completing the One with the Woods Challenge.\nWhile the Woodsprite is equipped, the holder will continuously heal for 1.5% of their maximum health per second, unless it is sent to an ally. \nWhen activated, the Woodsprite will travel to the selected ally (indicated by a green circle around the target) and immediately heal them for 10% of their maximum health, as well as healing them continuously instead of the holder. \nThe Woodsprite can only heal one ally at a time, but multiple charges from  Fuel Cells can redirect the Woodsprite to new targets. \nThe holder of the Woodsprite can also target themself, recalling the Woodsprite and healing themself immediately, similarly to the  Foreign Fruit.\n\n\n== Notes ==\nThe player can activate the Woodsprite even while targeting the ally that it is currently accompanying. This will give that ally the instant healing, but it will not increase the healing over time they receive.\nThe Woodsprite's owner can target allies that are behind terrain.\n  MUL-T will not receive healing over time when the Gnarled Woodsprite is switched to the off-hand equipment slot with   Retool.\nIf MUL-T sends the Woodsprite to an ally and then uses Retool to swap to the other equipment slot, the Woodsprite will still remain with that ally. When MUL-T switches back to the Woodsprite's slot after sending it, it is immediately recalled.\nIf the Woodsprite's owner has sent it to an ally, and that ally dies, the Woodsprite will return to its owner.\nThe Gnarled Woodsprite cannot be sent to ghosts from the  Happiest Mask.\nThe Woodsprite cannot be sent to an ally that already has a Woodsprite accompanying them (whether their own or sent by another ally).\n\n\n== Tips ==\nThe Gnarled Woodsprite pairs well with the  Corpsebloom, doubling the healing over time without any worry of reaching the healing cap.\nDue to the Woodsprite's extremely short cooldown (the shortest in the game, tied with the  Effigy of Grief, and excluding the unusual case of the  Executive Card) and has no negative effects, it is one of the best equipments in the game for activating  Bottled Chaos.\n\n\n== Lore ==\nOrder: Gnarled Woodsprite\n\nTracking Number: 447*****\n\nEstimated Delivery: 01/16/2056\n\nShipping Method: High Priority/Biological\n\nShipping Address: Happy Hope Children's Hospital, Waleton, Earth\n\nShipping Details:\n\nDr. Coleas's studies on the benefits of sprite-assisted care have paved the way for hospitals across Earth. These little guys take every opportunity to radiate amongst the injured and sick. \n\nWe've seen significant decreases in the recovery times of almost all patients. While effective, I'm not certain if this aura effect is transmitting anything at all. It might all be placebo; people could just be reacting to the spectacle of a cute lifeform putting on a light show in front of them.\n\nEither way, it's good to have them around, and I think they enjoy being around us too. I'm lucky enough to get to keep one in my home... for study purposes, of course. It may seem a little crass, but shipping these little guys in from off world does not seem to impact their attitude in the slightest.\n\n\n== Version History ==\nEarly Access Content Update 5\nMajor Content\nAdded New Item Lore Entry: Gnarled Woodsprite\nEarly Access Scorched Acres Content Update\nBug Fixes\n☂ Fix an issue with the Gnarled Woodsprite healing the player every time it was picked up\nFix equipment targets not being updated at the moment of firing (i.e Woodsprite not being able to select targets with  Gesture)",
    "url": "https://riskofrain2.wiki.gg/wiki/Gnarled_Woodsprite",
    "img_file": "Gnarled_Woodsprite.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Equipment\\Gnarled_Woodsprite",
    "rarity_raw": "Equipment"
}