{
    "name": "Royal Capacitor",
    "id": "Royal_Capacitor",
    "desc": "Call down a lightning strike on a targeted monster, dealing 3000% damage and stunning nearby monsters.",
    "notes": "The Royal Capacitor is an equipment in Risk of Rain 2. It is unlocked and starts appearing in runs after completing the Ascendant Challenge.\nWhile equipped, a targeting reticle appears over the monster nearest to the player's cursor. Activating the equipment while an enemy is targeted in this way calls a lightning strike on it after a half second delay, dealing 3000% damage in a 3m radius and stunning monsters nearby.\n\n\n== Notes ==\nThe lightning strike occurs 0.5 seconds after equipment activation. Character position is updated every frame for 0.2 seconds after equipment activation.\nTherefore, the targeted character has 0.3 seconds to escape the 3m explosion radius, or move 10 m/s away from the last position update.\n\n\n== Tips ==\nThe Royal Capacitor deals high damage in a single hit. Stacking  Crowbars can significantly increase this equipments damage.\nUsing the Royal Capacitor with many  Gesture of the Drowned,  Fuel Cells, and Crowbars will instantly activate the equipment with limited cooldown.\nBe mindful of entering the Bazaar Between Time with this combination, as it may damage the Newt and lock the player out of the Bazaar. Avoid this by looking away from the Newt.\nDue to the Royal Capacitor's short cooldown, it benefits from the  Soulbound Catalyst.\nThis is particularly effective with the aforementioned Gesture of the Drowned strategy.\nThe Royal Capacitor is a strong item for   Equipment Drones, as their innate cooldown reduction allows them to activate the equipment every 4 seconds with a target in sight.\n\n\n== Lore ==\nOrder: ZAP2-K “Royal” Capacitor\n\nTracking Number: 145***************\n\nEstimated Delivery: 04/30/2056\n\nShipping Method:  Standard\n\nShipping Address: Power Plant 005, Route 10, Venus\n\nShipping Details: \n\nHere’s a replacement for your damaged equipment. Crazy how gang activity is starting up again – even crazier that they’d steal a capacitor from you guys. Anyway, you guys know the drill – make sure routinely discharge the capacitor’s storage cells, as it may hold on to latent voltage. Oh, and make sure not to point it at anybody when you do.\n\n- The Saturn Reporter, Front Page Headline\n\n\n== Version History ==\nAnniversary Update\nMajor Content\nAdded New Lore Entry: Royal Capacitor\nBug Fixes\nFixed certain survivors not removing their limbs when picking up the Royal Capacitor\nEarly Access Artifacts Content Update\nGameplay Changes\nLightning now strikes where the target was 0.3s before the strike lands, instead of where they currently are.\nAdd new visuals warning before lightning strikes\nAdd glow and improve visuals so it’s more noticeable (hmm…)\nEarly Access Patch (Build ID No.3703355)\nBug Fixes\nEquipment - Royal Capacitor now requires line of sight to use.\n\n\n== Trivia ==\n\nThe Royal Capacitor is possibly inspired or referenced off of Sprague Powerlytic Capacitors, which have the same structure as the text on the texture for the Royal Capacitor.\nThe text on the texture reads as:\nCalorum - Company that made it\nPowerlytic - The name that they called their capacitor\n3600DE - The type of Powerlytic\n40000-810000DC - The range of voltage in direct current\n910256L - Inductance\nIn reality, the capacitor should have a capacitance value listed, not an inductance.\nAdditionally, although L is the letter used to represent inductance as a concept, the unit of measure for inductance is actually Henris (H).\nWhen equipped by any survivor, their right arm is replaced by a constant streak of electricity",
    "url": "https://riskofrain2.wiki.gg/wiki/Royal_Capacitor",
    "img_file": "Royal_Capacitor.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Equipment\\Royal_Capacitor",
    "rarity_raw": "Equipment"
}