{
    "name": "Defensive Microbots",
    "id": "Defensive_Microbots",
    "desc": "Shoot down 1 (+1 per stack) projectiles within 20m every 0.5 seconds . Recharge rate scales with attack speed .",
    "notes": "Defensive Microbots are an item in Risk of Rain 2.\nThe Microbots intercept and destroy enemy projectiles, such as  Lemurian fireballs, within 20m of the holder. This ability recharges every 0.5 seconds, although it recharges faster with greater attack speed. The maximum number of projectiles that can be shot down at once is equal to the number of held Microbots.\nAlthough the Defensive Microbots have a defined rarity, they cannot be found in Chests, traded for using Cauldrons or 3D Printers, or obtained through any other typical method. They are near-exclusive to the   Captain, who is granted one due to his   passive skill of the same name.\n\n\n== Notes ==\nMany attacks that aren't conventional projectiles can be destroyed, such as   Mini Mushrum spore clouds and fire pools,   Alloy Worship Unit's Alloy Supercharged Detonation, {  Malachite Elite urchin pits, {  Gilded Elite spikes, {  Overloading Elite bombs, the   Wandering Vagrant's Homing Orb Bomb,   Lunar Chimera Exploder's fiery blaze,   Beetle Queen's acid pools,   Imp Overlord's lingering shatter spikes, as well as   Mithrix's blue flame pillars and the shockwaves generated by his shockwave attack and phase 3 hammer slam. The Microbots can even destroy flying rocks on Sky Meadow, though rocks destroyed this way will not grant a charge of  Infusion.\nHitscan attacks, like   Lesser Wisp shots or   Stone Golem lasers, cannot be blocked by Defensive Microbots, regardless of the distance between the holder and the attacker.\nThe Microbots can also shoot down player projectiles. This is only relevant if the Artifact of Vengeance is active (if an Umbra has Microbots), the Artifact of Chaos is active, or if the   final boss steals Microbots during his final phase.\nThere are only two legitimate methods of obtaining Defensive Microbots, other than starting a run as Captain:\nRisking a Shrine of Order can convert all other held legendary items into Microbots.\nEnabling the Artifact of Metamorphosis and randomly becoming the Captain during a stage. His passive skill will grant the player the item, which will remain in the player's inventory even after metamorphosing into a different Survivor.\nWhen starting a run as the Captain and beginning the Trial of Metamorphosis in Bulwark's Ambry, the randomly chosen Survivor will keep the Defensive Microbots for the rest of the run.\nIn past versions of the game, enabling the Artifact of Vengeance and defeating an Umbra of Captain could drop Microbots. However, since the Survivors of the Void Update, this is not possible (even with the expansion disabled). Instead, playing as the Captain automatically unlocks the logbook entry for the item.\nHolding Defensive Microbots as a Survivor other than Captain will not grant allied Drones and Turrets their own Defensive Microbots. That ability is the result of the Captain's passive skill, not the item itself.\n\n\n== Math ==\nThe Defensive Microbots' recharge rate scales inversely proportional to attack speed, with the formula\n\nThe recharge rate does not get slower with less than 1 attack speed, and cannot be slower than 0.5s\n\n\n== Lore ==\n“Captain, look out!” \n\nA voice cried from the old man’s periphery. But he knew he was in no danger – with a chirp, his companion microbots activated and fired, disintegrating the fireball. Just as it did every time. \n\nQuickly spinning on his heel, the old man fired his shotgun, decapitating the Lemurian with a swift and pronounced BOOM.\n\n“I’d worry more about your own safety than mine, private.”\n\n\n== Version History ==\nAnniversary Update\nMajor Content\nAdded New Lore Entry: Defensive Microbots\nEarly Access Content Update 5\n(Undocumented) Added Defensive Microbots",
    "url": "https://riskofrain2.wiki.gg/wiki/Defensive_Microbots",
    "img_file": "Defensive_Microbots.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Legendary\\Defensive_Microbots",
    "rarity_raw": "Legendary"
}