{
    "name": "Kinetic Dampener",
    "id": "Kinetic_Dampener",
    "desc": "Increases armor by 30 (+30 per stack) while you have a shield . When shield breaks, release a stunning pulse for 100% damage plus an amount equal to 100% (+10% per stack) of your max shield . Grants a shield for 4% of your max health .",
    "notes": "The Kinetic Dampener is an item in Risk of Rain 2, added in the Alloyed Collective expansion.\nThe item increases the user's armor by 30 (+30 per stack) when they have a shield. Breaking the shield releases a stunning pulse which deals 100% damage, plus an amount equal to 100% (+10% per stack) of the user's max shield.\nThe explosion has a set radius of 12.5m, no damage fall off, and a Proc Coefficient of 1.0.\n\n\n== Notes ==\nShields cannot be healed by conventional means, and will only replenish after avoiding damage for 7 seconds.\n\n\n== Tips ==\n Transcendence is a good pairing with Kinetic Dampener. Although you won't be able to trigger the stunning pulse (unless you somehow manage to get to only 1 health), you effectively have a permanent increase to your armor.\nIf the player picks up  Plasma Shrimp while holding this item, the Kinetic Dampener and the stunning pulse will turn pink, along with the pulse gaining a black wave effect. This is purely visual.\n\n\n== Lore ==\nOrder: Kinetic Dampener Module \n\nTracking Number: 008521*********** \n\nEstimated Delivery: 01/9/2056 \n\nShipping Method: Fragile\n\nShipping Address: PO Box 521-05-C, Plaza Tower, Venus \n\nShipping Details: \n\nA prototype fresh off the assembly line. Improves kinetic field stability by 581% - that's an increase of 58% over the previous model - and the modular construction allows you to attach it to any shield generator. New features include a brand new safety mechanism that channels shield power into an electromagnetic pulse in the event your shield is punctured. Let me know what the board thinks and we can get this into production ASAP.\n\n\n== Version History ==\nAlloyed Collective\nAdded New Item: Kinetic Dampener",
    "url": "https://riskofrain2.wiki.gg/wiki/Kinetic_Dampener",
    "img_file": "Kinetic_Dampener.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Uncommon\\Kinetic_Dampener",
    "rarity_raw": "Uncommon"
}