{
    "name": "The Back-up",
    "id": "The_Back_up",
    "desc": "Call 4 Strike Drones to fight for you. Lasts 25 seconds.",
    "notes": "\"Backup\" redirects here. For the common item, see  Backup Magazine.\nThe Back-up is a returning equipment in Risk of Rain 2. It is unlocked and starts appearing in runs after completing the Mechanic Challenge.\nWhen activated, it summons 4   Strike Drones that follow the player and attack nearby enemies with fast-firing machine guns. After 25 to 28 seconds, the Strike Drones automatically self-destruct.\n\n\n= Striker Drone =\n\n\n== Skill & Behavior ==\n\n\n== Tips ==\nThis equipment is extremely beneficial for   Captain, since his   passive skill grants every Strike Drone  Defensive Microbots until their duration runs out.\nGiving The Back-up to an   Equipment Drone is quite useful, since the drone itself will activate the equipment when enemies are near. Both the Equipment Drone and Strike Drones will follow the player nearly all the time, since the Equipment Drone reduces its equipment's cooldown by about 80%.\nThis is especially useful as Captain, as the Equipment Drone and the Strike Drones will get Defensive Microbots.\nDue to its 100 second cooldown, it's best to use this against a horde of enemies or during the Teleporter Event, as the drones have a high rate of fire and can draw enemies' attention.\nThis item has a hard limit of 20 drones that can be active at any one time. This cap is affected by other drones the player already has, and activating it will no longer have any effect if they have 20 drones already.\nIt's possible to gain permanent uptime of the drones by having a  Gesture of the Drowned and at least five  Fuel Cells.\nInterestingly, this equipment can still benefit from gathering more Gestures and/or Fuel Cells even after permanent uptime is achieved, since more than 4 drones can be summoned at once.\nDrones summoned will not receive the visual drone augmentations provided by  Spare Drone Parts but will receive the stat boosts.\n\n\n== Lore - Equipment ==\n\"The inclusion of Rapid Response Drone Squadrons (RRDS) by local law enforcement marked a dire turning point of Plank's Rebellion. After its massive \"success\" in quelling the Rebellion - and subsequent implementation across Mercury - underground drone hackers became highly sought after by black market users.\"\n\n-Overview of Drone Technology, Vol.2\n\n\n== Lore - Drone ==\nAccessing database... done!\nReading specs... done!\nPrinting information for review... done!\n\nProduct Name: TC-55 Strike Drone\nManufacturer: Provost Interplanetary Security, Drone Division 5\nSerial No.: #5533501023453606844\n\nNotes:\n- Heavy armament compatible with naval ammunition calibers.\n- Expanded power output and aerial lift allows for greater range deployments.\n- Gyroscopic aim compensation allows for full-effect firing at top speeds.\n- Fusion pack allows for full output on rapid sorties.\n- Primary uplink to Command Units for full-squadron interoperability.\n\n\n== Version History ==\nAlloyed Collective\nStrike Drones now scale with level like the other Drones, as well as having their speed and regen increased.\nAnniversary Update\nQuality of Life\nGraphics Updates\nUpdate visuals to match other assets\nEarly Access Artifacts Content Update\nSound & Music\nFix The Back-up equipment not playing activation SFX correctly over the network\nEarly Access Hidden Realms Content Update\nGameplay Changes\nIncrease size of   Backup Drones\nEarly Access Scorched Acres Content Update\nQOL\n☂ Add 0.5s cooldown to repeatedly using The Backup equipment\n\n\n== Trivia ==\nPrior to the Anniversary Update, the Strike Drones shared the same model as the   Missile Drone.\nThe Back-up has a retro \"walkie talkie\" styled LCD screen, which can be read if examined in the logbook. It has a signal strength (or battery) indicator at the top, says that it's connected to Channel 2, and is set to 0/100 Voice Mod SVL (presumably standing for sound velocity levels).",
    "url": "https://riskofrain2.wiki.gg/wiki/The_Back-up",
    "img_file": "The_Back_up.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Equipment\\The_Back_up",
    "rarity_raw": "Equipment"
}