{
    "name": "Repulsion Armor Plate",
    "id": "Repulsion_Armor_Plate",
    "desc": "Reduce all incoming damage by 5 (+5 per stack) . Cannot be reduced below 1 .",
    "notes": "The Repulsion Armor Plate is an item in Risk of Rain 2.  \nThe item reduces all damage taken by 5 (+5 per stack), but it cannot reduce damage taken below 1. \n\n\n== Tips ==\nThis item is most effective at counteracting damage over time effects inflicted by enemies, as each individual damage tick is affected by the flat damage reduction. This also includes multiple low damage hits from enemies like   Clay Templar,   Lesser Wisp or   Lunar Chimera (Wisp), though their level also plays a huge factor as the reduction of the armor plate is flat.\nThe damage reduction from this item is applied after the damage reduction from armor.\nThe Repulsion Armor Plate pairs well with the  Planula, since the Planula's healing triggers when damaged and the Armor Plate reduces that damage taken. It's possible to gain health rapidly when attacked with rapid and weak damage.\nBoth the Armor Plate and Planula fall off in effectiveness as the difficulty increases, however.\nThis item does not block damage from the Void Fog.\n\n\n== Lore ==\nOrder: Repulsion Armor Replacement Piece\n\nTracking Number: 09******\n\nEstimated Delivery: 08/15/2056\n\nShipping Method:  Standard\n\nShipping Address: System Police Station 13, Port of Marv, Ganymede\n\nShipping Details:\n\nLuckily no one was hurt during the shootout. Just a few rough characters at the bar by the docks. Nothing we couldn’t handle. Jaime took a shot to his shoulder but his armor took all the impact. We’ll need to order him a replacement part before he can go back out in the field.\n\nThe segmented design is nice because I don’t have to shell out the cash for a whole new set. Frankly, the station’s coffers have seen better days. The next time a rookie damages their equipment they might be looking at a desk job for a while.\n\n\n== Placement ==\n\n\n=== Survivors ===\n  Commando places it below his right knee, on his leg.\n  Huntress places it above her left knee, on her thigh.\n  Bandit places it below his right knee, on his leg.\n  MUL-T places it above its hand, on its right forearm.\n  Engineer places it below his right knee, on his leg.\n  Artificer places it above her left knee, on her thigh.\n  Mercenary places it above his left knee, on his thigh.\n  REX places it on its left front leg, past the second joint.\n  Loader places it below her left knee, on her leg.\n  Acrid places it above its right knee, on its thigh.\n  Captain places it above his right knee, on his thigh.\n  Railgunner places it on her backpack's left side.\n  Void Fiend places it on the back of its right lower leg.\n  Seeker places it on her right lower leg, inwards.\n  False Son places it below his right knee, on his leg.\n  CHEF places it centered below its bag.\n  Operator places it horizontally on the back of his visor.\n  Drifter places it below her left knee, on her leg.\n\n\t\t\n\n\n=== Non-Playable Characters ===\nThe   TR12 Gauss Auto-Turret, the   TR58 Carbonizer Turret, and the   Scavenger all lack any visible placement.\n\n\n== Version History ==\nEarly Access Content Update 5\nGameplay Changes\nNow properly reduces damage from environmental effects\nBug Fixes\nFixed Repulsion Armor Plate not applying against posthumously dealt damage\nPC Early Access Patch (Build ID No.4892828)\nBug Fixes\nFix a typo in the Repulsion Armor log entry\nFix enemies benefiting from Repulsion Armor more than players\nEarly Access Artifacts Content Update\nMajor Content\nAdded New Item: Repulsion Armor Plate\nAdded New Item Lore Entry: Repulsion Armor Plate\n\n\n== Gallery ==\n\n\t\t\n\n\n== Trivia ==\nThe Repulsion Armor Plate is a reference to the Repulsion Armor from the first Risk of Rain, which greatly reduces damage taken and reflects damage for a short period after the holder is damaged 6 times. Presumably, the Repulsion Armor Plate is a piece of this armor.",
    "url": "https://riskofrain2.wiki.gg/wiki/Repulsion_Armor_Plate",
    "img_file": "Repulsion_Armor_Plate.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Common\\Repulsion_Armor_Plate",
    "rarity_raw": "Common"
}