{
    "name": "Longstanding Solitude",
    "id": "Longstanding_Solitude",
    "desc": "On level up gain a free unlock for the next purchase (+1 per stack) but all gold is converted to experience. Anything that costs gold is increased by 50% (+50% per stack) .",
    "notes": "Longstanding Solitude is a lunar item in Risk of Rain 2, added in the Seekers of the Storm expansion.\nWhen the holder levels up, they are granted an instance (+1 per stack, up to 3 per level) of the   Free Unlock buff, allowing them to use any interactable for free. However, any gold obtained while holding this item is converted into experience, and gold costs are increased by 50% (+50% per stack).\n\n\n== Math ==\nEvery 25 (Scaled With Time) gold that would be gained is instead converted into 12% (+1.25% per stack, up to 20.75% at 8 stacks) of the experience required to reach the next level.\nThe cost per level up is decided by this formula and calculated on entering a stage:\n\nFor more information check The Math of Scaling Difficulty\n\nThe cost of a level increases over time, at the same rate as other gold costing interactable.\nThe cost is unaffected by Longstanding Solitudes downside.\nLarge amounts of Gold are often cut off and will not necessarily always equate to a level up, but gradual gold gains can use this table as a general reference.\n\nGaining $209, 3 times, results in 3 Levels.\nGaining $627 all at once, results in ~~2.2 levels\n\n\n== Notes ==\nCorrection: The increased XP gain per stack is not mentioned in-game.\nThe cost per XP gain does not increase by 50% like the cost of interactables.\nThis makes stacking not have a downside in Single-Player\nThis is one of the few items that has arbitrary stack limitations.\nStacking past 3 does not increase the amount of   Free Unlock per level.\nStacking past 8 does not increase the amount of XP per 25$.\nGaining multiple leves at once through too much gold, will not result in multiple   Free Unlock.\nThis is very unlikely to happen in regular gameplay.\nThe holder gains the experience from converted gold in addition to the experience they would normally get with killing an enemy\nThis item prevents the player from charging Halcyon Shrine's, as they are unable to hold gold.\nThis item prevents getting more missiles with  War Bonds.\nUpon reaching the level cap of 94, the player will be unable to get more free purchases.\nIf they run out of their   Free Unlocks, they will be unable to purchase anything until they get rid of the item.\n\n\n== Tips ==\nEconomy items like the  Brittle Crown,  Defiant Gouge, the  Roll of Pennies, or the  Ghor's Tome greatly amplify the upside of this item.\n Brittle Crown can be especially strong since the player will always be at 0 gold and therefore be unable to lose any when getting hit.\n Defiant Gouge is especially strong when you find a Shrine of Chance, since it may take several of your   Free Unlocks to get both items.\nIt's best to avoid   Gilded Coast while holding Longstanding Solitude in single-player, as it will take 7   Free Unlock stacks to activate the beacons and kill   Aurelionite.\nIf you dont kill the boss fast enough, you would need to repeat this.\nIf the player is already at the level cap, you are locked in the area without escape.\n\n\n== Lore ==\nDay 1\nThe chilly coin in my pocket hums softly, drawing me off path. A pulsing blue pod is lodged in the earth here, covered in morning frost. Even through gloves, the coin burns colder than ever. I’m terrified and compelled to place the coin on the pod, it snaps open.\nA dark gel oozes out, carrying a round device and tablet to my feet. The device activates and pulls the tablet with it into a hover. A construct? I know I should have shot it down, but I… feel it wants to help me get stronger.\nI touch the construct. Thousands of years push their way into my skull, the mounting pressure makes me howl in a voice I don’t recognize, then nothing.\n---\nA pounding migraine wakes me. Midday. I feel moss under me and shield my eyes against the canopy light. I am closer to RallyPoint, but how? Disfigured beetles lay dead in a radius around me, faces distorted, limbs bent. I vomit. The construct hovers protectively nearby. How did it do this?\nDay 2\nStudying the tablet brings no comfort. I worry about Huang. The isolation grates on me, I’m exhausted, hungry, angry. I finally found a supply chest but the construct absorbed my coin before I could use it. This lowly thing thinks it knows best. I don’t know what came over me but I attacked the construct. It didn’t seem to mind but that only made me feel worse. I am not myself.\nDay 3\nThe full moon’s light makes me itch. It pursues me from it’s dark sea, sluggish and unnerving. I stare into it, nearly falling into it’s gaze. For hours I run terrified in the wrong direction. I cannot face it, not how I am. Under a deep canopy I draw familiar power from the construct. Inky feathers break through the skin of my arms and hands. I black out.\nDay 4\nThat blasted thing isn’t cheap, the construct is obsessed with coin, but I can’t argue with the results. The Lemurians barely put up a fight, obliterated, distracted by their song.\nThe last one drops from my talons.\nThey never should have been here in the first place. Where they are blind, I see the shapes of things and truly know them. I must reach…someone, somewhere. I cannot quite remember.\nIt is day\nRatssratsRATS gther n your shadow brother. Scrub, scrub it clean. Yoo LOom\novr the trees, for me?\nI’m\nontheWAy\n\n\n== Version History ==\nUpdate Notes V1.3.6\nLongstanding Solitude - “free unlock” buff is now retained between stages. Gold cost for interactables (in multiplayer) now increased by 50% (down from being increased by 100%)\nSeekers of the Storm - First Patch\nLongstanding Solitude will no longer sometimes show pinged interactables at 2x cost.\nSeekers of the Storm\n(Undocumented) Added new item: Longstanding Solitude",
    "url": "https://riskofrain2.wiki.gg/wiki/Longstanding_Solitude",
    "img_file": "Longstanding_Solitude.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Lunar\\Longstanding_Solitude",
    "rarity_raw": "Lunar"
}