{
    "name": "Her Biting Embrace",
    "id": "Her_Biting_Embrace",
    "desc": "Glacial Glacial (Affix Buff) Gain the power of a Glacial Elite. Leave an ice explosion on death, and apply an 80% slow on hit.",
    "notes": "Her Biting Embrace is an Elite equipment in Risk of Rain 2. It can only be found as a rare drop from a   Glacial Elite. The drop chance is 1/4000 from each Glacial Elite, but this chance is affected by  57 Leaf Clover and  Purity.\nA player equipped with Her Biting Embrace gains the power of a Glacial Elite; their attacks all  greatly slow enemies hit. The duration of the slowing is affected by the proc coefficient, with a base time of 1.5 seconds. Additionally, when the equipped player dies, they will explode for 150% damage and freeze enemies caught in the blast, with a proc coefficient of 0.75. Enemies frozen this way can be executed as though they were frozen by   Artificer. However, without items that grant extra lives, such as  Dio's Best Friend, this is not very useful.\nAlthough Her Biting Embrace is held in the equipment slot, it works passively and cannot be activated. Equipment cooldown reduction and additional equipment charges from  Fuel Cells do not affect its behavior.\n\n\n== Tips ==\n  Engineer can make somewhat better use of this equipment than other Survivors, since his turrets will become Glacial and explode on death as well. However, since the only other benefit is the slowing effect, it still may not be worthwhile for him.\nAdditionally, Engineer's   TR58 Carbonizer Turrets already   slow enemies without the need for this equipment. These slowing effects do stack, however.\nThe slowing debuff is stacked separately from the   slowness inflicted by the  Chronobauble, so combining these items will halt most enemies in their tracks.\nThey also both count towards  Death Mark separately, making it easier to get bonus damage.\nCombine these effects with   REX's innate   Weak debuff to bring enemies to an effective standstill.\n\n\n== Version History ==\nEarly Access Scorched Acres Content Update\nBug Fixes\nFix the Ice Crown on   Brass Contraptions hanging in the air after death\nEarly Access Patch (Build ID No.3703355)\nBug Fixes\nFalloff models for delayed blast attacks (Ice Affix Death) are now properly assigned. This may cause them to do more damage than before.\n\n\n== Gallery ==",
    "url": "https://riskofrain2.wiki.gg/wiki/Her_Biting_Embrace",
    "img_file": "Her_Biting_Embrace.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Equipment\\Her_Biting_Embrace",
    "rarity_raw": "Equipment"
}