{
    "name": "N'kuhana's Opinion",
    "id": "N_kuhana_s_Opinion",
    "desc": "Store 100% (+100% per stack) of healing as Soul Energy . After your Soul Energy reaches 10% of your maximum health , fire a skull that deals 250% of your Soul Energy as damage .",
    "notes": "N'kuhana's Opinion is an item in Risk of Rain 2. It is unlocked and starts appearing in runs after completing the Her Concepts Challenge.\nAs the holder heals, the item stores 100% (+100% per stack) of the healing as a hidden value, dubbed \"Soul Energy.\" When this value reaches 10% of the holder's maximum health, the player launches a homing skull that deals fixed damage equal to 25% of their maximum health with a proc coefficient of 0.2 within a 40m radius. \n\n\n== Notes ==\nThe skulls trigger even when healing at full health.\nSkulls are fired one at a time, so a large burst of healing (e.g.  Foreign Fruit) will fire multiple skulls back to back.\nThere is a minimum 0.1 second cooldown between skulls, for a maximum fire rate of 10 skulls per second. This results in a potential maximum DPS of 250% of the holder's max HP per second, assuming consistent healing.\n\"Healing\" implies actively regaining health from a source, where green numbers appear around the player signifying the healed amount; players' passive health regeneration, even when amplified by a  Cautious Slug,  Spinel Tonic, or  Titanic Knurl, will not trigger any skulls to fire.\nAlthough the skulls can trigger on-hit healing effects, such as the  Leeching Seed or  Super Massive Leech, the healing from these items is not added to the Soul Energy value if the triggering hit is a skull.\nShields count as maximum health for the purpose of this item, even if the shields are currently damaged.\nThe Soul Energy value cannot exceed the holder's full combined health (max health plus max shields). Given the item's high rate of fire, this is usually not a problem, however.\nAdditionally, once the player's Soul Energy accumulates enough to activate N'kuhana's Opinion, it will deplete Soul Energy and attempt to fire, even if no enemies are in range. This makes it impossible to stockpile more than one second's worth of attacks, no matter how much healing the player has.\n\n\n== Tips ==\nN'kuhana's Opinion is uniquely one of the only items that does not use the Survivor's damage stat or Total Damage; its damage is directly tied to your combined Max Health and Shields. As the holder's health increases per-level and though items like  Infusion and  Personal Shield Generator , the skulls' damage increases, but so does the healing required to fire each skull.\nFlat healing, such as from  Harvester's Scythe, isn't penalized for this increased health, as the increased damage typically offsets the higher threshold. However, fewer skulls may mean fewer item procs, so it's important to keep any flat healing up to scratch to keep N'kuhana's up to speed (and for the holder to avoid dying, as is typical of any run).\nPercentage-based healing, such as from  Bustling Fungus, grows stronger as the holder's max health increases, as the skulls fire at the same speed and simply deal more damage. However, it's important to remember that N'Kuhana's takes shield into account while these sources do not;  Transcendence would increase the skulls' damage by 50%, but drop the holder's max HP to 1, effectively erasing any percentage-based healing.\n\nN'kuhana's does not benefit from the damage doubling from  Shaped Glass, and the halved HP cuts each skull's damage and required healing in half. As a side effect, flat healing can hit the 10% max HP threshold twice as quickly, while percentage-based healing does not benefit.\n Corpsebloom has some unusual interactions with N'kuhana's. Because it stores all healing and releases it at 10% of the holder's maximum health per second, large bursts of healing will fire one skull per second for an extended period of time. However, this means that the fire rate of those skulls is capped at 1 skull per second (compared to the limit of 10 per second) unless this is bypassed using  Rejuvenation Rack. Generally, Corposebloom is a downgrade if the user can reliably and continuously heal above 10% max health per second.\nUniquely, because Corpsebloom steals and then releases all healing itself, it ignores the restrictions of on-hit healing triggered by skulls. This means a skull can activate on-hit healing, and since Corpsebloom is the item providing the final healing, it will count towards the Soul Energy value where it would normally be filtered out. This means one could theoretically have an infinite loop of consistent, if slow, N'Kahuna's skulls and healing, though this is difficult in practice.\nAlthough the skulls do not use the Damage stat, they can still critically strike and are powered up by the  Focus Crystal,  Crowbar, and  Armor-Piercing Rounds, when applicable.\nThis item can be extremely useful on   Engineer's   TR12 Gauss Auto-Turrets when combined with Bustling Fungus. The turrets can consistently keep the Bustling Fungus active, since they do not move and are immune to knockback. Additionally, since both of the turrets and Engineer himself receive healing from the fungus and independently fire skulls, placing the turrets such that the healing zones overlap will activate N'kuhana's Opinion very rapidly, dealing high damage at very long range.\n  REX excels with N'kuhana's Opinion, as their entire kit revolves around healing and life-steal. They will be able to activate this item very often.\n  Heretic performs extremely well with this item, since her   Shadowfade skill heals a large portion of her maximum health and her health is much higher than any other Survivor's.\nThe  Rejuvenation Rack pairs exceptionally well with this item, effectively doubling the number of skulls fired.\n\n\n== Lore ==\n\"Let us begin.\n\nWhat is your oath?\n\nNot very long ago, health and time were in perfect synergy. Pain and love. Death and memories. The great equalizer. She would always come for us. \n\nBut! Disparity now plagues our generations - and our children's. Not many pass, but so many are born. So many doomed souls, saved. Our hubris as a race continues to grow - unchecked. Unrestrained. \n\nNow there is no volume in our world for death, and she cannot visit us. But is being alive only an offset from death? Without contrast, won't we all be dead in life? The standard has shifted, and now we are all so very close to never living again.\n\nWe must make volume for her name - to restore the balance. Let us consume the Concepts, so we may begin to drain the bloated cistern that is our world. As disciples, we will spread her words and opinions. As pupils, we will sow death. And should we be lucky... be granted an audience by Her.\n\nWeshan!\"\n\n-The N'tormat, Chapter I, Stanza I, Verse II\n\n\n== Version History ==\nEarly Access Scorched Acres Content Update\nGameplay Changes\nFix item pickup not having both horns highlighted\n\n\n== Gallery ==\n\n\t\t\n\t\t\n\n\n== Trivia ==\nThe projectiles are referred to internally as \"devil orbs.\"\nIn early versions of the game, N'kuhana's Opinion was an uncommon item, and instead caused the character to explode in a poison nova when healed.\n\n\n== References ==",
    "url": "https://riskofrain2.wiki.gg/wiki/N%27kuhana%27s_Opinion",
    "img_file": "N_kuhana_s_Opinion.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Legendary\\N_kuhana_s_Opinion",
    "rarity_raw": "Legendary"
}