{
    "name": "Red Whip",
    "id": "Red_Whip",
    "desc": "Leaving combat boosts your movement speed by 30% (+30% per stack) .",
    "notes": "The Red Whip is a returning item in Risk of Rain 2. \nAfter 5 seconds of using no offensive skills, the holder gets the {  Whip Boost buff, increasing their movement speed by 30% (+30% per stack) until they use an offensive skill again. \n\n\n== Notes ==\nUnlike the  Cautious Slug, getting the Whip Boost buff requires the player to not use any skills (except for mobility skills) for 5 seconds, and has nothing to do with avoiding damage.\nAs of the 1.0 Launch update, all mobility skills are considered \"sprinting,\" meaning that the buff won't be removed if the player uses such skills.\nAs of the Hidden Realms update, taking damage no longer disables the buff.\nEquipment, be it damaging or not, does not disable the buff.\nDamaging items like  Little Disciple and  Unstable Tesla Coil do not disable the buff.\nSkills that do not disable the buff include:\n  Commando's   Tactical Dive and   Tactical Slide\n  Bandit's   Smoke Bomb\n  Huntress's   Blink and   Phase Blink\n  MUL-T's   Transport Mode,   Retool, and   Power Mode\nWhile initiating his    Power-Saw will cancel the buff, holding it does not affect it, meaning the speed boost can be utilized while attacking after 5 seconds.\n  Engineer's   Thermal Harpoons,   TR12 Gauss Auto-Turret, and   TR58 Carbonizer Turret\nHis turret's attacks are combat skills, while placing them is not.\nOddly, despite firing damaging missiles, Thermal Harpoons does not count as a combat skill, but   Bubble Shield does.\n  Void Fiend's   Trespass,   Suppress, and   Corrupted Suppress\nDespite dealing no damage,   Corrupted Trespass counts as a combat skill.\n  Heretic's   Nevermore and   Shadowfade ( Strides of Heresy)\n  Railgunner's   Concussion Device and   Polar Field Device\nScoping in with   M99 Sniper or   HH44 Marksman counts as a combat skill, even without firing.\n  Alloy Vulture Utility skill which switches between grounded and flight.\n  Blind Pest Primary skill which fires an acid projectile.\n  Hermit Crab's Mortar Volley\n  Parent's Utility skill (Teleport)\n  Mithrix's Special skill (Shock Wave) and Utility skill (Sprint forward)\n\n\n== Lore ==\n“...going to 594 South River, Io. Check. One Whip, Red, Priority shipping. Going to... to, um... Oh, wow...”\n\n-Signal echoes, UES Contact Light\n\n\n== Version History ==\nAnniversary Update\nMajor Content\nAdded New Lore Entry: Red Whip\nEarly Access Hidden Realms Content Update\nGameplay Changes\n🌧Getting hurt no longer disables the buff\n🌧Update whip model, texture, and icon\nMove whip movespeed over to a {  buff so it shows up in the bar",
    "url": "https://riskofrain2.wiki.gg/wiki/Red_Whip",
    "img_file": "Red_Whip.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Uncommon\\Red_Whip",
    "rarity_raw": "Uncommon"
}