{
    "name": "Purity",
    "id": "Purity",
    "desc": "All skill cooldowns are reduced by 2 (+1 per stack) seconds. All random effects are rolled +1 (+1 per stack) times for an unfavorable outcome .",
    "notes": "The Purity is a lunar item in Risk of Rain 2. It is unlocked and starts appearing in runs after completing the The Calm Challenge.\nIt is the counterpart to  57 Leaf Clover. It reduces all the holder's skill cooldowns by a flat 2 seconds (+1 second per stack), but will make their chance effects less likely to occur by rolling them 1 extra time (+1 per stack) to be unsuccessful.\nThe following chance-based items can reach 100% chance, and therefore are useful even with the Purity:  Lens-Maker's Glasses (and other critical strike items),  Sticky Bomb,  Tri-Tip Dagger, and Ghor's Tome.\nThe following chance-based items cannot reach 100% chance, and are therefore less useful the more negative luck the player has:  Stun Grenade,  AtG Missile Mk. 1,  Bandolier,  Ukulele,  Happiest Mask,  Sentient Meat Hook,  Molten Perforator,  Charged Perforator,  Brittle Crown, and   Tentabauble.\nItems that have guaranteed effects, such as the  Chronobauble or  Kjaro's Band and  Runald's Band, are unaffected by Purity.\n\n\n== Math ==\nIf p is the probability of a favorable event occurring without any luck modifiers, the probability of the favorable event is p ^ (x + 1), where x is the number of Purities held. \n\nFor example, if the player has 1 Purity and 2  Sticky Bombs, the probability of a bomb without any Luck modifiers is 10%. Therefore, the probability of a bomb with 1 Purity is 0.1 ^ 2 = 1%\n\n\n== Notes ==\nThe luck stat affected by Purity is the same as the one affected by the  57 Leaf Clover, and as such, equal stacks of Purity and the Clover cancel each other out.\nThe flat cooldown reduction of Purity is applied after the reductions of  Alien Head,  Light Flux Pauldron,  Lysate Cell and  Hardlight Afterburner, making it stack extremely well with them.\n Tougher Times is unaffected by Purity, due to it being unaffected by the luck stat in general.\nThe cooldown reduction can only reduce skills' cooldowns to a minimum 0.5s.\n\n\n== Lore ==\nIt looks like starseed, tanning in dirt.\n\nIt smells like hot stone, and tall grass.\n\nIt tastes like spiced fruit, sweet and hot.\n\nIt feels like solar winds, and solar chimes.\n\nIt sounds like two brothers, chasing glass frogs in the sun.\n\n\n== Trivia ==\nThe shape of the Purity is a great stellated dodecahedron, being an icosahedron with triangular pyramids on every face.\n                      \n\nThe logbook for   Helminth Hatchery likely refers to the making of  Purity, indicating that it was originally a Morning Star given as a gift to   Mithrix by Providence. However,   Mithrix snapped off the head and sent it back down, likely corrupting it.\n\n\n== Version History ==\nPC Patch v1.0.1.1 (Build ID No.5440050)\nBug Fixes\nRemove luck from  Artifact Key drop calculation since it can cause soft-locks with Purity\nEarly Access Content Update 5\nMajor Content\nAdded new Lunar Item: Purity\nAdded New Item Lore Entry: Purity\nAdded New Challenge:  The Calm",
    "url": "https://riskofrain2.wiki.gg/wiki/Purity",
    "img_file": "Purity.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Lunar\\Purity",
    "rarity_raw": "Lunar"
}