{
    "name": "Death Mark",
    "id": "Death_Mark",
    "desc": "Enemies with 4 or more debuffs are marked for death , increasing damage taken by 50% from all sources for 7 (+7 per stack) seconds.",
    "notes": "The Death Mark is an item in Risk of Rain 2.\nWhen the holder damages an enemy that has 4 or more unique debuffs, it is  marked for death for 7 seconds (+7 seconds per stack), causing it to take 50% more damage from all sources.\n\n\n== Notes ==\nPlayers without the Death Mark will still deal bonus damage to marked enemies.\nIt is possible to inflict Marked for Death on the same hit that inflicts the 4th debuff. This is because a landing hit procs some debuffs before Marked for Death is checked, while others are checked after. See On-Hit Procs for more details and the order of checks.\nThe 4 debuffs do not need to be applied by the same player, but a player holding a Death Mark must damage the enemy to mark it.\nThe debuff cannot be caused by an attack with a proc coefficient of 0.0, so damage-over-time effects can never apply the mark, even if the victim has enough debuffs.\nThe duration of the mark cannot be extended or reset after it has been applied, but it can be reapplied as normal once it expires.\nOnce applied, the mark persists for its full duration even if the victim's debuffs expire such that it no longer has 4 debuffs.\n  Lunar Ruin counts as 2 debuffs, as it has both a damage boost and a very minor damage over time effect.\nAll debuffs that can be applied to enemies count towards the activation requirement, including the   Clay Templar's self-inflicted   50% Slow.\nStunning an enemy, such as with   Commando's   Suppressive Fire or with a  Stun Grenade, does not contribute to the Death Mark.\nSimilarly, freezing an enemy with   Artificer's   Cast Nano-Spear or   Snapfreeze or   Railguneer's   Cryocharge will not contribute to the Death Mark.\n\n\n== Tips ==\n\n\n=== Survivor Debuffs ===\n  Huntress inflicts   50% Slow with   Arrow Rain.\n  Bandit inflicts   Hemorrhage with   Serrated Dagger and   Serrated Shiv.\n  Engineer inflicts   50% Slow with   TR58 Carbonizer Turrets.\n  Artificer inflicts   Ignite with   Flame Bolt and   Flamethrower.\n  Mercenary inflicts   Expose with   Laser Sword,   Focused Assault and   Slicing Winds.\n  REX inflicts   Weak with   DIRECTIVE: Inject and   DIRECTIVE: Disperse, and can also inflict either   Entangle with   Tangling Growth or   Fruiting with   DIRECTIVE: Harvest.\n  Acrid inflicts either   Poison or   Blight.\n  Heretic inflicts   Lunar Root with   Slicing Maelstrom and   Ruin while   Ruin is not on cooldown.\n  Void Fiend inflicts   50% Slow with   Drown.\n  Seeker inflicts   50% Slow with   Spirit Punch.\n  False Son inflicts   Lunar Ruin with   Lunar Spikes and   Lunar Stakes.\n  CHEF inflicts   Weak with   Glaze,   Burn with   Sear,   Stronger Burn on Glazed enemies or while holding an  Ignition Tank, and   Bleed with   Roll boosted by   Yes, CHEF!.\n  Operator inflicts   Nano Bug with   Ejection Core and   Burn with critical hits from   CMD-SWARM. Depending on the drones he has purchased,   ADMIN-OVERRIDE can also inflict   Burn with an   Incinerator Drone,   50% Slow with a   Cleanup Drone,   Jailed with a   Jailer Drone, and   Frost with a   Freeze Drone.\n  Drifter can inflict an extremely wide variety of debuffs using   Cleanup,   Discard (from   Repossess), and   Tinker.\n  Cleanup can apply   Hemorrhage or   Burn depending on the random projectile she rolls.\nThrowing an object with   Discard can apply   Nullify Stack if she throws a Void Cradle,   Cripple if she throws a Lunar Pod or Cleansing Pool, and   Burn if she throws a   Lesser Wisp,   Greater Wisp, or Lunar Chimera   Exploder or   Wisp.\n  Tinker can inflict one of 22 different debuffs to any enemy it hits. 10 of these are unused or otherwise impossible to inflict with survivors or items, 6 can be inflicted by other survivors, and 6 can only be inflicted by items or equipments.\n\n\n=== Item Debuffs ===\nWhile the Death Mark is best used with Survivors who can inflict debuffs naturally, there are many items that inflict debuffs as well:\n\n Tri-Tip Dagger,  Noxious Thorn,  Shatterspleen and  Sawmerang inflict   Bleed.\nThe  Tri-Tip Dagger and  Shatterspleen require multiple stacks and high critical chance for reliability, respectively.\nThe  Needletick inflicts   Collapse, but corrupts Tri-Tip Daggers. Bleed can still be inflicted with the Noxious Thorn, Shatterspleen, Sawmerang or by other players, however.\n Gasoline, the  Molten Perforator, and the  Molotov (6-Pack) will   ignite enemies.\n Ifrit's Distinction allows the holder to ignite enemies with all their skills and items.\nThe  Ignition Tank changes Ignite into   Stronger Burn. While this does not add debuffs, it does mean that a player with the Ignition Tank can inflict Stronger Burn while their allies can still inflict regular Ignite, which count separately. This can be facilitated with an   Incinerator Drone.\n Chronobauble inflicts   60% Slow, which can be maintained easily with even a single stack.\nThe  Tentabauble inflicts   Nullified, but corrupts Chronobaubles. 60% Slow can still be inflicted by other players who have Chronobaubles, however.\n Runald's Band inflicts   80% Slow when activated, though this can make the Death Mark tied to the Elemental Bands cooldown.\n Breaching Fin inflicts   Breaching Fin Debuff, though this can make the Death Mark tied to the Breaching Fin cooldown.\n Shattering Justice inflicts   Pulverize Buildup and   Pulverized (though never at the same time), which both count towards Death Mark.\n Symbiotic Scorpion inflicts   Permanent Armor Reduction.\n Frost Relic inflicts   80% Slow.\n Networked Suffering inflicts computer virus.\n Hooks of Heresy allow the holder to inflict   Lunar Root using   Slicing Maelstrom.\n Essence of Heresy allows the holder to inflict   Ruin on hit, as long as the   Ruin skill is not on cooldown.\n Mired Urn inflicts   Tar on one nearby enemy per stack.\n Helfire Tincture inflicts the invisible   Helfire debuff, which does contribute towards the Death Mark.\n Her Biting Embrace and the  Spectral Circlet allow the holder to apply   80% Slow on hit.\n N'kuhana's Retort allows the holder to   disable healing on hit.\n Shared Design and  Effigy of Grief inflict   Cripple.\n\n\n== Lore ==\nOrder: “Death Mark”\n\nTracking Number: 66******\n\nEstimated Delivery: 02\\22\\2056\\\n\nShipping Method:  High Priority\n\nShipping Address: 421 Lane, Lab [72], Mars\n\nShipping Details:\n\nEveryone said that I was crazy to search for lost artifacts on Mars. Idiots. There hasn’t been any proof of a previous civilization - but I’ve always trusted my gut. This skull proves that I’m right - that something did exist here before.\n\nThat smug professor at the university... always disparaging my research. I loved seeing the look on his face as I shook his hand. Idiot. Karma must have been working overtime - I heard he fell ill shortly after. I suppose my success was just too much for him.\n\n...In fact, everyone I’ve shown seems to not be returning my calls. Are they avoiding me? Are they scared this news would shake up their academic communities? Too proud to admit I’m right?\n\nI’ll find someone who will give me the recognition I deserve. I’ve worked too hard and done too much. If I don’t keep going, I think I might just die.\n\n\n== Version History ==\nEarly Access Content Update 5\nGameplay Changes\nDebuff Duration: 7s ⇒ 7s (+7s per stack)\n🌧Remove text stating that the damage bonus scaled with stacks\nEarly Access Artifacts Content Update\nMajor Content\nAdded New Item: Death Mark\nAdded New Item Lore Entry: Death Mark\n\n\n== Gallery ==\n\n\t\t\n\n\n== Trivia ==\nCollapse used to erroneously count as 2 debuffs and not 1; this is due to how damaging debuffs are programmed. Each debuff actually has 2 components: an invisible debuff that deals the damage, and a visible positive buff that creates the icon and indicates that the debuff is inflicted. This is why the Helfire debuff counts towards the Death Mark, even though it is invisible: it has the debuff component, just not the visible buff. However, due to a programming error, both components of Collapse were treated as debuffs.\nThis has been fixed as of Patch 1.2.3.",
    "url": "https://riskofrain2.wiki.gg/wiki/Death_Mark",
    "img_file": "Death_Mark.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Uncommon\\Death_Mark",
    "rarity_raw": "Uncommon"
}