{
    "name": "Wake of Vultures",
    "id": "Wake_of_Vultures",
    "desc": "Gain the power of any killed elite monster for 8s (+5s per stack) .",
    "notes": "The Wake of Vultures is an item in Risk of Rain 2. \nUpon killing an Elite enemy, the holder gains that same Elite power for 8 seconds (+5 seconds per stack).\nFor more information on what powers each Elite type gives, see Elite Status Effects. \n\n\n== Notes ==\nSince it is possible to gain any Elite power with this item, it synergizes with any items that its respective equipment may synergize with.\n Ignition Tank drastically increases the damage over time from the {  Blazing power.\n Chronobauble's slow effect stacks with the damage over time from the {  Glacial power.\n Plasma Shrimp benefits from the extra shield provided by the {  Overloading and {  Perfected elite powers, as the item is only reliant on having some shield.\nThis benefit is redundant with the presence of  Transcendence, as those effects provide no extra shield with it active.\nIt is possible to gain every single Elite power at once.\nThe Artifact of Honor makes this item more effective, with every kill granting the player an Elite power.\nActivating the  Forgive Me Please while holding the Wake of Vultures will not give any Elite effect, even if the Artifact of Honor  is active.\nBe wary that this item may interfere with healing-based strategies, as killing an {  Overloading or {  Perfected Elite will temporarily replace half or all of the player's health with shields, respectively. Since shields cannot heal through normal means, this can be an unwanted nuisance for players who are in the fray often and require that healing to stay alive.\nHowever, getting the Overloading buff will also instantly grant 50% shield, even if the holder's current health is below 50% of its max. Similarly, getting the Perfected buff will turn the holder's health into shield and immediately grant 100% shield. In either case, when the effect ends, the holder is also healed for the amount of health originally turned into shields: 50% for Overloading and 100% for Perfected (regardless of how much or little shield the player had right before the effect expired). The  Rejuvenation Rack increases this post-buff restoration, but items like  Corpsebloom and  N'kuhana's Opinion are not affected.\nThere is a bug involving this item and  Safer Spaces, which allows the shield to recharge instantly. This happens when a character kills a {  Voidtouched enemy and the elite buff expires while Safer Spaces is still on {  on cooldown. This is because when the elite buff expires it removes a stack of the cooldown debuff and when the timed debuff expires, it removes another stack, bringing the total number of stacks to -1. When that character is then hit and loses the {  shield, it will add one stack for the cooldown debuff, but since it will only be at 0 stacks and therefore \"not present\", the shields will be enabled on the next frame. When the cooldown debuff later expires, it will bring the debuff stacks to -1, conserving the corrupted state.\nThere is a secondary bug involved here, where the shields behavior is not granted/removed when the character gains/loses the Voidtouched elite buff, but when there is a change in the character's inventory and it makes a check for the elite buff's existence. Therefore, the Safer Spaces shields must be on cooldown while the elite buff shields behavior is removed and not when the elite buff technically expires. Other than adding/removing/transforming an item in the character's inventory, an inventory change check can also be triggered when the character picks up an  Infusion orb. As such, the easiest way to trigger the bug is to hold Wake of Vultures, Safer Spaces, and Infusion. Note that holding an Infusion is an insufficient condition when the character has reached the max bonus health for the currently held stacks and the inventory change needs to be triggered by another method.\nThis bug fixes itself when the character is revived, or advances to the next stage as all buffs are reset.\nEven though the character is impervious to most sources of damage, the shield technically goes on cooldown until the next frame, so if the character is hit by multiple sources of damage in the same frame, only the first one will be protected from the shields, while the rest will go through.\nA different way to trigger this same bug is to have the   final boss steal  Safer Spaces while it is on cooldown. When the player retrieves the item, they will gain the same instant recharge behaviour for the rest of the stage.\n\n\n== Lore ==\nOrder: Unique Leather Belt\n\nTracking Number: 40***********\n\nEstimated Delivery: 10/23/2056\n\nShipping Method:  High Priority / Biological\n\nShipping Address: Auckland, New Zealand, Earth\n\nShipping Details: \n\n“The mind rules over its body from a fortress of bone, learning of the world around it through fleshy portals. The heart is just an extension of the body, which finds its root in your head.” \n\nSomebody said this, I can’t remember who. Anyway, make sure to take great care of it. It’s incredibly rare.\n\n\n== Version History ==\nPC Patch v1.2.3\n(Undocumented) Wake of Vultures can now grant the {  Voidtouched affix\nAnniversary Update\nMajor Content\nAdded New Lore Entry: Wake of Vultures\n\n\n== Trivia ==\nThe Wake of Vultures is a reference to the Headhunter Belt in the ARPG Path of Exile, which has a similar appearance and effect.\nThe order description is \"Unique Leather Belt\", which is the item type of the Headhunter.\nThe tracking number \"40***********\" is likely a reference to the required level to wear the Headhunter.\nThe estimated delivery \"10/23/2056\" is a reference to Path of Exile's launch date, October 23, 2013\nThe shipping address \"Auckland, New Zealand, Earth\" is the location of the studio Grinding Gear Games, which develops Path of Exile.\nThe quote in the shipping details is a paraphrase of the Lore/Flavor text on the Headhunter item card.\nThe closing remark \"It's incredibly rare.\" is a reference to the rarity of the Headhunter in Path of Exile, with many players going to great lengths to hold one some day.\nThe internal name is \"HeadHunter\"",
    "url": "https://riskofrain2.wiki.gg/wiki/Wake_of_Vultures",
    "img_file": "Wake_of_Vultures.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Legendary\\Wake_of_Vultures",
    "rarity_raw": "Legendary"
}