{
    "name": "Ifrit's Distinction",
    "id": "Ifrit_s_Distinction",
    "desc": "Blazing Blazing (Affix Buff) Gain the power of a Blazing Elite. Leave a fire trail that hurts enemies, and apply a 50% total damage burn on hit.",
    "notes": "Ifrit's Distinction is an Elite equipment in Risk of Rain 2. It can only be found as a rare drop from a   Blazing Elite. The drop chance is 1/4000 from each Blazing Elite, but this chance is affected by the  57 Leaf Clover and  Purity.\nA player equipped with Ifrit's Distinction gains the power of a Blazing Elite; their attacks will   burn enemies for 50% total damage over time, and a trail of fire will follow them and hurt any enemy that makes contact with it. \nAlthough Ifrit's Distinction is held in the equipment slot, it works passively and cannot be activated. Equipment cooldown reduction and additional equipment charges from  Fuel Cells do not affect its behavior.\n\n\n== Tips ==\nMelee Survivors such as   Loader and   Acrid make somewhat better use of Ifrit's Distinction, since they will generally be close enough to enemies to burn them with their fire trail. However, the large amount of extra burn damage will benefit all Survivors to some degree.\nEquipping Ifrit's Distinction on Acrid will allow them to   poison and burn enemies simultaneously. This gives an easy way to Acrid to finish off enemies that have been poisoned, since poison can only bring them to 1 health but they will die from burning.\nHaving the  Ignition Tank makes this equipment drastically more powerful. Even a single stack will raise the total damage over time to a whopping 200% total damage, tripling the holder's overall damage output. Further Ignition Tank stacks will make the damage even more severe.\nSince Ifrit's Distinction guarantees the Burn debuff on hit, it can be contributed towards the activation of  Death Mark.\n\n\n== Trivia ==\nThe name \"Ifrit's Distinction\" is a reference to a boss from the first Risk of Rain, Ifrit. Known as the \"Scion of the Infernal King,\" Ifrit was a large flaming beast that summoned pillars to trap players and attacked with fire.\n\n\n== Gallery ==",
    "url": "https://riskofrain2.wiki.gg/wiki/Ifrit%27s_Distinction",
    "img_file": "Ifrit_s_Distinction.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Equipment\\Ifrit_s_Distinction",
    "rarity_raw": "Equipment"
}