{
    "name": "Wax Quail",
    "id": "Wax_Quail",
    "desc": "Jumping while sprinting boosts you forward by 10m (+10m per stack) .",
    "notes": "The Wax Quail is an item in Risk of Rain 2. It is unlocked and starts appearing in runs after completing the Going Fast Recommended Challenge.\nThe item grants a 10m (+10m per stack) boost forward whenever the holder jumps while sprinting.\n\n\n== Notes ==\nThis item affects all base jumps a Survivor has, but it does not affect additional jumps granted by  Hopoo Feather.\nSince the  H3AD-5T v2 increases the holder's jump height, using it in conjunction with the Wax Quail allows the player to jump forward much further than the normal 10m per stack.\nStacking multiple copies of this item can cause the player to launch off slopes unpredictably, due to how the game calculates momentum. This effect is significantly amplified by the H3AD-5T v2.\n\n\n== Trivia ==\n\nThe icon for this item's unlock challenge, Going Fast Recommended, actually displays a different model than the item itself. This is possibly the original model for the item before being changed for unknown reasons.\n\n\n== Lore ==\nOrder: Wax Quail\n\nTracking Number: 15******\n\nEstimated Delivery: 12/18/2056\n\nShipping Method: Priority\n\nShipping Address: Research Center, Polarity Zone, Neptune\n\nShipping Details:\n\nHello Buu,\n\nHow are you doing? This is Mama. \n\nThe weather here has been dreadful. It is raining every day. We have recently found a new bakery nearby that has delicious sandwiches. Papa has recently taken up whittling. He uses wax because it is softer. I have attached one of his favorites. Hopefully it has not been dinged in the mail :-)\n\nAnyways, I will leave Buu alone. Hope to see you soon!\n\nMama\n\n\n== Version History ==\nEarly Access Content Update 5\nBug Fixes\nFixed immobilization from   Void Reavers and   REX’s   Tangling Growth becoming permanent if using Wax Quail while affected, which would also sometimes lead to a crash upon getting killed",
    "url": "https://riskofrain2.wiki.gg/wiki/Wax_Quail",
    "img_file": "Wax_Quail.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Uncommon\\Wax_Quail",
    "rarity_raw": "Uncommon"
}