{
    "name": "Stone Flux Pauldron",
    "id": "Stone_Flux_Pauldron",
    "desc": "Increase max health by 100% (+100% per stack) . Reduce movement speed by 50% (+50% per stack) .",
    "notes": "The Stone Flux Pauldron is a lunar item in Risk of Rain 2, added in the Survivors of the Void expansion.\nThis item increases the holder's maximum health by 100% (+100% per stack). However, it also decreases the holder's movement speed by 50% (+50% per stack).\n\nBug: The speed reduction is applied twice, reducing speed by 33% on first stack as a result.\n\n\n== Notes ==\nCorrection: The description that it halves movement speed is inaccurate. The effect is reciprocal as it multiplies the movement speed by 1/(1+stacks). One stack will indeed halve movement speed, but additional stacks will have a diminishing effect. However, even this is not the complete picture, as movement speed is actually calculated as baseValue×sumOfIncreases/sumOfDecreases. As such, if the player has already accrued a lot of other sources of negative contributions, one stack of this item will not halve the overall stat value but have a diminishing effect.\n\n\n== Tips ==\nFor most characters and builds, keep in mind that the movement speed penalty of Stone Flux Pauldron will generally be far more troublesome than the accompanying health bonus is worth. The vast majority of enemy attacks come in the form of close-range melee, projectiles with a travel time, and telegraphed area-of-effect attacks. All these attacks also generally will not track a moving player and instead lag behind. As such, the loss of one's ability to effectively dodge these attacks and/or flee from unfavorable fights will more than likely end up meaning they'll take a lot of damage that they could have otherwise avoided. Often, the player may end up taking far more damage than the extra health of the Pauldron can defend them from.\nThis speed penalty also complicates one's ability to get around each stage in order to search for interactables, and as such, might make it difficult to keep up with the time-based scaling of the game's difficulty. This may be exacerbated in multiplayer games, where a player with one or more Stone Flux Pauldron(s) could have trouble getting to chests and other sources of items before the faster player(s) can pick the stage clean.\nThe \"suffocation\" effects presented by the   Void Fields,   Void Locus,   The Planetarium, and Void Seeds are also made far more dangerous, as their damage scales with the player's maximum health anyways. The Pauldron will not make the player survive any longer inside the void, and the movement penalty will leave them slowly trudging through ever-damaging fog.\nSimilarly, the implosion attacks of dying   Void Reavers,   Void Jailers, and other such Void enemies will kill in one hit regardless of health, making a swift escape more or less the only option to survive them.\nDue to the mathematics of how a player's movement speed is calculated, it is generally a losing battle to try to overcome the Pauldron's speed penalty by taking items which give movement speed bonuses, especially when taking more than one Pauldron. Each one taken will more than double the number of  Mocha,  Paul's Goat Hooves, and  Energy Drinks necessary to break even and return to normal movement speed.\nA notable quirk revealed by the exceptionally low movement speeds possible by stacking Stone Flux Pauldrons is the fact that a player's friction with the ground is directly tied to their movement speed. As such, stacking many Pauldrons will make the player incredibly slippery, making it rather difficult to manage the knockback caused by enemy attacks (especially explosions like the   Jellyfish's self-detonation) or the recoil from their own skills (such as   Railgunner's   XQR Smart Round System).\nWith all these factors in mind, it may be better to cut losses with respect to movement speed and instead focus on alternative means of movement that are unaffected by the movement speed stat.\nA skilled   Loader can make great use of this item, as she can rely on the momentum from her   Charged Gauntlet or   Thunder Gauntlet to get moving, and use her   Grapple Fist or   Spiked Fist to redirect her momentum and close gaps between herself and nearby enemies.\n  MUL-T's high base health and innate ability to grant itself considerable amounts of armor with its assorted skills makes it an excellent candidate for leveraging the benefits of the Stone Flux Pauldron. The push it receives from the ending burst of   Auto-Nailgun also offers a means to compensate for the loss in movement speed, especially when used in conjunction with   Power Mode. Timing the release of two Auto-Nailgun bursts along with a simultaneous jump allows for a directed leap that can carry the player a considerable distance, and the nailguns will usually be ready to fire again just a moment or two after hitting the ground, even without any boosts to firing speed.\n  False Son makes great use of Stone Flux Pauldron's health benefit courtesy of his Growth, as it is a very easy method of obtaining more health at a negligible speed deficit, given his already slow movement speed.\nPicking up a  Wax Quail or two will grant the player an alternate means of movement regardless of their chosen Survivor, as the boost it gives when a sprinting player jumps is calculated to send them a certain distance forwards, regardless of the player's movement speed. Do keep in mind that having too many Quails may make it difficult to make precise movements, especially with the implicit reduction in friction.\nWith the  H3AD-5T v2, the item's ability to crash down to the ground after holding the interact key will allow for the player to halt their momentum in mid-air, should they need to. The item's extra effect of negating all fall damage is also especially helpful in this scenario: The player's low traction and reliance on less-controllable means of movement will make falling off of ledges much more common, and fall damage is calculated as a percentage of the player's health, making it hit harder for high-health players.\nOn all survivors, jumping without providing any directional input (WASD/movement stick) will completely halt any non-vertical momentum. This gives a player with several Stone Flux Pauldrons a consistent means to slow down without having to rely on their immensely reduced friction, so long as they are on the ground to start with.\nThe Stone Flux Pauldron's health boost synergizes best with items and abilities that benefit from the player taking damage, help the extra health last longer, aid with healing, and/or scale positively with the player's maximum health.\nThe  Roll of Pennies and especially  Razorwire are quintessential for their ability to benefit from the player being damaged, supplying a tanky player with exceptional sources of gold and damage output, respectively.\nAlthough helpful at first, items that grant flat healing, such as  Harvester's Scythe and  Leeching Seed, will quickly be outstripped by the comparatively massive pool of maximum health that stacking several Stone Flux Pauldrons can offer. Instead, it's generally better to focus on items and equipment that heal for a percentage of maximum health, such as  Medkit,  Interstellar Desk Plant,  Strides of Heresy, and  Foreign Fruit.\nSimilarly, the flat damage reduction of  Repulsion Armor Plate and  Planula will be dwarfed by the damage of heftier blows that are normally much easier to dodge; for this, consider pursuing items that instead boost armor, such as the  Jade Elephant.\n Helfire Tincture and  N'kuhana's Opinion are uniquely powerful in combination with Stone Flux Pauldron, as they are the only means of offense with a damage output that scales with the user's maximum health instead of their base damage stat. A massive health pool from the Pauldron will give a correspondingly massive damage boost for both of these items.\nSince this is the only item that reduces movement speed (excluding  Tonic Affliction), the Stone Flux Pauldron can be used in long runs where a player is overwhelmed by extreme levels of speed, making movement much easier to manage.\n\n\n== Lore ==\n\"Much like the earth, you must be sturdy and inflexible. Completely and utterly immovable, in both body and mind. Fear not the sword of your enemy, visualize it shattering against your skin. Focus, and make it true. Fear not the tumbling avalanche, visualize it yielding to your will. But heed, and do not fight without reason. Those who remain rooted will quickly find themselves alone.\"\n\n-Will of Combat, First Excerpt\n\n\n== Version History ==\nSurvivors of the Void\n(Undocumented) Added New Item: Stone Flux Pauldron",
    "url": "https://riskofrain2.wiki.gg/wiki/Stone_Flux_Pauldron",
    "img_file": "Stone_Flux_Pauldron.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Lunar\\Stone_Flux_Pauldron",
    "rarity_raw": "Lunar"
}