{
    "name": "Visions of Heresy",
    "id": "Visions_of_Heresy",
    "desc": "Replace your Primary Skill with Hungering Gaze . Fire a flurry of tracking shards that detonate after a delay, dealing 120% base damage . Hold up to 12 charges (+12 per stack) that reload after 2 seconds (+2 per stack) .",
    "notes": "The Visions of Heresy are a lunar item introduced in the Hidden Realms Update and a part of the Heresy Set. They are unlocked and start appearing in runs after completing the Blockade Breaker Challenge.\nObtaining the Visions of Heresy will replace the Survivor's primary attack (M1 by default) with the Hungering Gaze skill.\n\n\n== Synergies ==\nOn very long runs, this item can be useful for   Acrid,   Loader, and   Mercenary, since enemies will be so powerful that being in melee range is dangerous. However, on a normal-length run, the Visions of Heresy are a downgrade for these Survivors.\nHungering Gaze also removes Loader's main way to activate her   Scrap Barrier passive. Gather other items to make up for the lost survivability.\nOn Survivors with primary attacks that have high fire rates and/or many projectiles, such as   Commando,   Captain and   MUL-T, Hungering Gaze is a direct downgrade due to its recharge cooldown.\nOn   Artificer, replacing her primary with Hungering Gaze is generally better when holding a lot of on-hit items, such as AtG Missile Mk. 1, and more of a toss-up when holding none.\nThe only case when replacing Artificer's primary could be detrimental is when the {  Burn from   Flame Bolt is contributing to a  Death Mark, or is being boosted by  Ignition Tank.\nAs with most items, Visions of Heresy will affect   Engineer's turrets as well as himself. This means that Engineer can use Hungering Gaze instead of the clunky   Bouncing Grenades, and his turrets will also gain Hungering Gaze. This increases Engineer's damage output as well as his turrets', making it an all-around excellent choice.\nBecause Hungering Gaze has a cooldown, attack speed items are reduced in effectiveness. Bonus attack speed does increase the rate at which the 12 bullets are fired, but will not modify the cooldown at all, resulting in a lower expected increase in damage output.\nCooldown reduction items such as the  Bandolier and  Brainstalks can help mitigate this downside.\n\n\n== Notes ==\nThe delayed explosions can trigger on-hit items independently of the initial hits.\nThis item has a special interaction with the   final boss.\nObtaining this item along with the other three Heresy items will turn the holder into the   Heretic.\n\n\n== Lore ==\n\"…and for her betrayal, and her lies, and her scheming ways, the Heretic was violently separated into four distinctive pieces, each to be scattered across the farthest depths of the Moon. \n\nFirst, her many eyes were plucked from her skull and sealed in boiling glass, forced to gaze upon her failure...”\n\n-The Evisceration of Kur-skan the Heretic, III\n\n\n== Version History ==\nPC Patch v1.0.1.1 (Build ID No.5440050)\nBug Fixes\nFix Visions of Heresy interacting with   Captain’s orbital drop\nEarly Access Content Update 5\nBug Fixes\nFixed Visions of Heresy allowing   Huntress’   Ballista to exceed three shots\nPC Early Access Patch (Build ID No.4892828)\nBug Fixes\nFix the   Hungering Gaze being reset by   Thermal Harpoons\nEarly Access Hidden Realms Content Update\nMajor Content\nAdded New Lunar Item: Visions of Heresy\nAdded New Item Lore Entry: Visions of Heresy",
    "url": "https://riskofrain2.wiki.gg/wiki/Visions_of_Heresy",
    "img_file": "Visions_of_Heresy.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Lunar\\Visions_of_Heresy",
    "rarity_raw": "Lunar"
}