{
    "name": "Lens-Maker's Glasses",
    "id": "Lens_Maker_s_Glasses",
    "desc": "Your attacks have a 10% (+10% per stack) chance to ' Critically Strike ', dealing double damage .",
    "notes": "The Lens-Maker's Glasses are a returning item in Risk of Rain 2. \nThe item increases the player's critical strike chance by 10% (+10% per stack). \n\n\n== Notes ==\nCritical strikes are reflected by a sharper hit sound and a red tint on the damage numbers, if they are enabled.\nLens-Maker's Glasses have an effective stacking limit of 10. At 10 stacks a critical strike chance is guaranteed, effectively doubling all damage output.\nAcquiring more than 10 stacks will bring no additional benefit unless the player is planning to eventually corrupt it to  Lost Seer's Lenses.\nCritical strike chance is affected by Luck.\nCritical strikes applies to the damage dealt by equipment, such as the  Royal Capacitor.\nCritical strike chance is not affected by the damage source's proc coefficient. As an example, those using   MUL-T's   Auto-Nailgun will not have to collect additional Lens-Maker's Glasses to compensate for the skill's lowered chance to proc.\nCritical strikes are calculated after items like  Focus Crystal and  Shaped Glass, doubling their effectiveness.\n  Railgunner has a unique synergy with this item due to her   Magnetic Accelerator passive. Any critical strike chance is converted directly into critical strike damage, meaning this item would instead increase her critical strike damage by 10%. As such, this item can be stacked past 10 stacks and beyond for increased damage.\n\n\n== Tips ==\nWhile the effective limit for regular critical hit chance is 10 Lens-Maker's Glasses, it is wise to stop stacking at 9. The first stack of  Predatory Instincts,  Harvester's Scythe and  Shatterspleen all grant a 5% increase to critical strike chance, so holding at least two of the three items acts a substitute for a single Lens-Maker's Glasses.\n\n\n== Lore ==\n…What I didn’t see was that the golem was aiming its laser at my back. I managed to barely dodge it - just by pure luck - but the blast knocked me to the ground. My glasses flew off my face and I was on my back, stunned, barely able to make sense of myself…\n\nAnd then... well, I can’t really explain what happened next. Adrenaline, some kind of divine intervention, I dunno. But I reached out, and managed to grab my glasses, raise ‘em up to my eyes so I could see, and BAM! Fired the last of my bullets.\n\nAnd, well... I guess I managed to hit something vital in its head. Exploded in red stone and glass. It stopped moving after that. \n\nIf it wasn’t for that shot, I wouldn’t be here telling this story.”\n\n-Signal echoes, UES Contact Light\n\n\n== Version History ==\nAnniversary Update\nMajor Content\nAdded New Lore Entry: Lens-Maker's Glasses\n\n\n== Trivia ==\n Predatory Instincts' lore entry alludes to players stacking Lens-Maker's Glasses in Risk of Rain 1, claiming that the creature that killed Providence, the final boss of the game, had \"22 unblinking, crimson eyes.\"\nIn Risk of Rain 1, Lens-Maker's Glasses did not grant a 10% increase to Critical Strike chance, but rather 7%. Reaching 100% critical strike chance required 14 Lens-Maker's Glasses.\nDuring the development of Risk of Rain 2, the Lens-Maker's Glasses had a different appearance than they do in the current version of the game.",
    "url": "https://riskofrain2.wiki.gg/wiki/Lens-Maker%27s_Glasses",
    "img_file": "Lens_Maker_s_Glasses.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Common\\Lens_Maker_s_Glasses",
    "rarity_raw": "Common"
}