{
    "name": "Sawmerang",
    "id": "Sawmerang",
    "desc": "Throw three large saw blades that slice through enemies for 3x400% damage . Also deals an additional 3x100% damage per second while bleeding enemies. Can strike enemies again on the way back.",
    "notes": "The Sawmerang is a returning equipment in Risk of Rain 2. \nWhen activated, it shoots three saw blades in a fan that travel a set distance before returning to the player, each dealing 400% damage with a proc coefficient of 1.0 and inflicting   Bleed. The initial shot and the return trip count as separate attacks, allowing each blade to hit twice. Additionally, after the initial strike, each saw blade deals 140% damage rapidly with a proc coefficient of 0.2 and inflicts Bleed each tick.\n\n\n== Tips ==\nCorrection: The in-game description of 100% damage is incorrect.\nUsing this equipment to hit enemies at close range is risky but rewarding, as it is likely that all 3 saw blades will hit.\nKeep in mind that the saw blades do not travel through terrain, and each will immediately return upon striking terrain.\nThis can be used to return the saw blades early in order to get the second hit for each blade faster, although this requires some setup.\nThis also means that it's possible to get a saw blade stuck on its return trip, if the player moves such that there is geometry between them and the saw blade before it returns. When this happens, the stuck saw blade will continuously hurt any enemies near it.\n\n\n== Lore ==\nI'm so happy they let me bring my trusty disc toy on this trip! Trees need cutting? Disc toy. Baddies getting a little too close? Disc toy. Fun after-hours game of catch? Disc toy... but only if you're trained to catch it.\n\n\n== Version History ==\nPS4 & Xbox One Patch\nBug Fixes\nSolved an issue where the Sawmerang would not deal damage upon hit.\nEarly Access Artifacts Content Update\nMajor Content\nAdded New Equipment: Sawmerang\nAdded New Item Lore Entry: Sawmerang\n\n\n== Gallery ==",
    "url": "https://riskofrain2.wiki.gg/wiki/Sawmerang",
    "img_file": "Sawmerang.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Equipment\\Sawmerang",
    "rarity_raw": "Equipment"
}