{
    "name": "Oddly-shaped Opal",
    "id": "Oddly_shaped_Opal",
    "desc": "Increase armor by 100 (+100 per stack) while out of danger.",
    "notes": "The Oddly-shaped Opal is an item in Risk of Rain 2, added in the Survivors of the Void expansion.\nAfter 7 seconds of not taking damage, the holder gets the {  Opal Armor buff, increasing armor by 100 (+100 per stack) until they take damage again.\n\n\n== Math ==\nThe amount of damage that the Opal mitigates can be quickly found with Opals/(Opals+1). One Opal reduces damage by 50%, two by 66.66%, so on and so forth. This value differs slightly depending on the character's base armor, however.\n\nBecause armor stacks hyperbolically, having more than a few Opals quickly becomes redundant; for instance, having 5 Opals gives 83.33% damage reduction, while having 6 gives 85.71% damage reduction.\n\n\n== Notes ==\nIf a hit is negated by  Tougher Times or  Safer Spaces, the Opal Armor buff is not lost.\nDamage taken from the Shrine of Blood or   REX's \"plant\" skills that consume health will also cause the Opal Armor buff to be lost. These damage sources are also not reduced by armor, so the Opal will not decrease the costs.\n\n\n== Tips ==\nThis item pairs exceptionally well with Safer Spaces, allowing the player to completely negate 1 incoming hit and then greatly mitigate another.\n\n\n== Lore ==\n//--AUTO-TRANSCRIPTION FROM UES [Redacted] --//\n\n\"...You think this planet is as bad as they say?\"\n\nLiz sat in silence among her fellow soldiers. She, like the rest of her squadron, had been taken from the middle of a firefight in the galactic outback and brought before an old UES veteran. Liz was used to debriefing by now, it all blended together in her head. Something about monsters, and the missing UES Contact Light.\n\n\"...Dunno.\" Liz murmured as she turned a small, oddly-shaped hunk of opal in her hand. It was one of the only things she had that reminded her of Parker. Of when things were calm, and peaceful.\n\n\"...Heh, I don't think a shiny rock will do much,\" A soldier joked. Liz's brow furrowed under her helmet. \"Yeah, probably not... but...\"\n\nLiz took a deep breath and slipped the opal back into her pocket. \"It just helps.\"\n\n\n== Version History ==\nSurvivors of the Void\n(Undocumented) Added New Item: Oddly-Shaped Opal",
    "url": "https://riskofrain2.wiki.gg/wiki/Oddly-shaped_Opal",
    "img_file": "Oddly_shaped_Opal.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Common\\Oddly_shaped_Opal",
    "rarity_raw": "Common"
}