{
    "name": "His Spiteful Boon",
    "id": "His_Spiteful_Boon",
    "desc": "Twisted Seekers of the Storm - DLC Content This content is part of the Seekers of the Storm DLC. It is only available if the DLC is enabled when starting a run. Click for more info. Twisted (Affix Buff) Gain the power of a Twisted Elite. Tether to up to 5 allies within a 35m radius. Tethered allies gain 300 armor. If tethered allies are hit 10 times, a lunar spike ball is fired which homes onto a nearby enemy, dealing 100% damage and inflicting Lunar Ruin . After launching a spike ball, tethering is disabled for 10s . Lunar Ruin is applied twice .",
    "notes": "His Spiteful Boon is an Elite equipment in Risk of Rain 2, added in the Seekers of the Storm expansion. It can only be found as a rare drop from a   Twisted Elite. The drop chance is 1/4000 from each Twisted Elite, but this chance is affected by  57 Leaf Clover and  Purity.\nA player equipped with His Spiteful Boon gains the power of a Twisted Elite; they tether to 5 nearby allies within a 35 meter radius. Tethered allies gain 300 additional armor and, when hit, will charge a lunar spike ball that floats over the player's head. After tethered allies are hit 10 times, the spike ball will home onto a nearby enemy, dealing 100% damage and inflicting   Lunar Ruin.\nAlthough His Spiteful Boon is held in the equipment slot, it works passively and cannot be activated. Equipment cooldown reduction and additional equipment charges from  Fuel Cell do not affect its behaviour.\n\n\n== Notes ==\nAfter the spike ball is fully charged and begins to home onto an enemy, the ability goes on cooldown for 10 seconds, which includes tethering and buffing allies.\n \n\n\n== Version History ==\nUpdate Notes V1.3.6\n(Undocumented) Reworked to match reworks to Twisted Elites\nSeekers of the Storm\n(Undocumented) Added new item: His Spiteful Boon\n\n\n== Gallery ==",
    "url": "https://riskofrain2.wiki.gg/wiki/His_Spiteful_Boon",
    "img_file": "His_Spiteful_Boon.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Equipment\\His_Spiteful_Boon",
    "rarity_raw": "Equipment"
}