{
    "name": "Substandard Duplicator",
    "id": "Substandard_Duplicator",
    "desc": "Picking up an item gives you a temporary copy of itself. Temporary items last an additional 10 (+10 per stack) seconds",
    "notes": "The Substandard Duplicator is a returning item in Risk of Rain 2, added in the Alloyed Collective expansion.\nWhen the user picks up an item, they also gain a temporary version of the same item, and all temporary items last an additional 10 (+10 per stack) seconds.\n\n\n== Notes ==\nItems dropped by printers do not grant temporary copies.\nThis is because it could lead to infinite temp items if allowed.\nRegular Items that are blacklisted from being temporary grant a random temporary of that tier instead.\n Regenerating Scrap,  Sale Star,  Prayer Beads are most notable.\nWorldUnique and Quest items, that can't be temporary, simply do nothing on pickup.\nMost notably;  Item Scrap, White\nAs all Lunars are blacklisted, they are unable to be rerolled into another.\nHowever if one was added (through modding), they will be rerolled into that.\n\n\n== Tips ==\nThis functions with  Sentry Key, allowing for half the normally necessary amount to be collected. Temporary stacks will be prioritized when they are consumed, meaning you can also save one for creating an  Exposed Cerebellum.\n\n\n== Lore ==\nOrder: Duplicator \n\nTracking Number: 2788************ \n\nEstimated Delivery: 12/7/2056 \n\nShipping Method: High Priority/Fragile \n\nShipping Address: Nevenstraat 2, Central Way, Jupiter \n\nShipping Details: \n\nA designer delight. Or so it would be if it worked like it should... Out of all my birthday presents this is what I was the happiest about, yet all its dupes are... Terrible! They don't last a minute without breaking apart. Can you help me out please?\n\n\n== Version History ==\nAlloyed Collective\n\nAdded New Item: Substandard Duplicator\n\n\n== Trivia ==\nThe Substandard Duplicator is the first item from Risk of Rain Returns to be added to Risk of Rain 2. It is also the first returning item added by an expansion.\nUnlike other returning items, the logbook entry for Substandard Duplicator is identical to its logbook entry in its original game.",
    "url": "https://riskofrain2.wiki.gg/wiki/Substandard_Duplicator",
    "img_file": "Substandard_Duplicator.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Legendary\\Substandard_Duplicator",
    "rarity_raw": "Legendary"
}