{
    "name": "Soldier's Syringe",
    "id": "Soldier_s_Syringe",
    "desc": "Increases attack speed by 15% (+15% per stack) .",
    "notes": "The Soldier's Syringe is a returning item in Risk of Rain 2.\nThe item increases attack speed by 15% (+15% per stack), decreasing the intervals between individual attacks and increasing the animation speed of all skills. This also means that any attack that needs to charge, such as Artificer's   Charged Nano-Bomb will charge faster as well.\n\n\n== Notes ==\nThe Soldier's Syringe only increases the animation speed of skills; it does not affect their cooldowns. Most primary skills have no cooldown, the exceptions being   Artificer,   Bandit,   MUL-T, and  Heretic. This does not mean that Syringes are useless on these Survivors, though. Their primary skills will still be used faster (aside from Bandit who will reload faster instead), and there are other tangible benefits such as Artificer's Primary reloading faster.\nHigher attack speed will shorten the charge time for Artificer's   Charged Nano-Bombs  and   Cast Nano-Spears  and increase the number of times   Flamethrower hits. Even a slight increase in attack speed can drastically enhance Flamethrower and allow faster bombs and spears.\n  Captain's   Vulcan Shotgun, narrows its spread more rapidly with greater attack speed, in addition to having reduced ending lag between shots.\nNotably, attack speed does not affect how long it takes for   Orbital Probe,   OGM-72 'DIABLO' Strike, or   Orbital Supply Beacon to land.\nBandit's primaries   Burst and   Blast can be used as fast as the player can press the button, which is not affected by attack speed boosts. However, more attack speed will allow them to reload faster.\nHigher attack speed also speeds up the animations for   Lights Out and   Desperado, reducing the delay between activating the skill and dealing damage.\nMUL-T's   Scrap Launcher  can be fired faster with greater attack speed, and the Syringe applies to both of MUL-T's selected primary attacks.\nBoth   Railgunner's   Supercharge and   Cryocharge will prepare to fire and fire faster with increased attack speed, and Supercharge's reboot time is shortened by attack speed improvements.\nRailgunner's   Active Reload presents a larger perfect reload window with increased attack speed.\nHeretic's   Slicing Maelstrom secondary will charge faster with Syringes, allowing her to dispose of groups of monsters more quickly.\nThis also applies for any Survivor equipped with the  Hooks of Heresy.\nAs a consequence of the game engine, the max attack speed is capped at 60 attacks per second, but it may vary depending on the survivor.\n\n\n== Lore ==\n\"I ain't much for drugs... but hell, when fortune is knockin', ya gotta greet that door with a smile and a nod. Salud!\"\n\n-Signal echoes, UES Contact Light\n\n\n== Version History ==\nAnniversary Update\nQuality of Life\nUpdate visuals to match other assets\nEarly Access Scorched Acres Content Update\nMajor Content and Changes\nAdded New Lore Entry: Soldier's Syringe",
    "url": "https://riskofrain2.wiki.gg/wiki/Soldier%27s_Syringe",
    "img_file": "Soldier_s_Syringe.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Common\\Soldier_s_Syringe",
    "rarity_raw": "Common"
}