{
    "name": "Voidsent Flame",
    "id": "Voidsent_Flame",
    "desc": "Upon hitting an enemy at full health , spawn a lava pillar in a 12m (+2.4m per stack) radius for 260% (+156% per stack) base damage . Corrupts all Will-o'-the-wisps .",
    "notes": "The Voidsent Flame is a void item in Risk of Rain 2, added in the Survivors of the Void expansion, and the corruption of the  Will-o'-the-wisp. \nWhen the holder attacks an enemy that is at full health, the enemy is struck with a fiery blast. The blast has a 12m (+2.4m per stack) radius and deals 260% (+156% per stack) base damage. This damage suffers from sweet spot damage falloff.\n\n\n== Tips ==\nThis item's effect triggers 0.2 seconds after the initial hit, meaning this item won't benefit from  Crowbar's damage boost unless the triggering hit deals less than 10% of the target's health (including other instances of Voidsent Flame).\nSimilar to the Crowbar, this item becomes harder to use with offensive drones and other players, as a single hit from anyone other than the holder will prevent Voidsent Flame from activating.\nSince barrier does not count towards full health, if an enemy has any barrier while being at full health, e.g., a Scavenger with Topaz Brooch and activating it with Thqwibs, it is possible for the item to be triggered multiple times for the same target.\nDespite slightly reduced damage, this item can easily become more deadly to enemies in groups than  Will-o'-the-wisp.\nInstead of needing to kill one enemy, the player can simply damage any target to set off a chain reaction of explosions that can wipe out groups of small enemies and heavily damage or even kill larger ones.\nWhen paired with  Gasoline, this effect is even more pronounced, as any enemies that die as a result of Voidsent Flame will also activate Gasoline and strengthen the chain. Afterburn from the Gasoline can even cause enemies to die after a delay, and potentially even trigger against enemies who weren't there for the initial wave of explosions.\n Helfire Tincture can trigger Voidsent Flame's effect on yourself and allies. However, the resulting explosions only damages enemies, resulting in a huge damage boost as long as you stay at or above full health, which can be done using  Repulsion Armor Plate and regeneration,  Planula,  Topaz Brooch,  Aegis, et cetera.\nThis combo is particularly powerful on   Loader due to her ability to counter damage from Helfire Tincture with barrier generated by her primary attack.\n\n\n== Lore ==\n========================================\n====   MyBabel Machine Translator   ====\n====     [Version 12.45.1.009 ]   ======\n========================================\nTraining... <100000000 cycles>\nTraining... <100000000 cycles>\nTraining... <100000000 cycles>\nTraining... <102515 cycles>\nComplete!\nDisplay result? Y/N\nY\n========================================\n\nWe take kindling and throw it in the fire.\n\nThe fire is pleased. The fire grows.\n\nWe take fruit and throw it in the fire.\n\nThe fire loves this gift. Embers pop from the fire and perform dances of joy before fading. Compounds inside the fruit are undone, returning to their base components. There are so many colors. So much energy.\n\nWe take a body and throw it into the fire. It will not be missed. He has more to spare.\n\nThe fire loves this gift. Fat in the body burns, producing a rainbow of beautiful hues in the flame. Muscles contract and snap, stimulated by the gnawing heat. The fire claims its meal, and returns it to energy.\n\nSo much energy. I believe I can work with this.\n\n\n== Version History ==\nSurvivors of the Void\n(Undocumented) Added New Item: Voidsent Flame",
    "url": "https://riskofrain2.wiki.gg/wiki/Voidsent_Flame",
    "img_file": "Voidsent_Flame.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Void\\Voidsent_Flame",
    "rarity_raw": "Void"
}