{
    "name": "Primordial Cube",
    "id": "Primordial_Cube",
    "desc": "Fire a black hole that draws enemies within 30m into its center . Lasts 10 seconds",
    "notes": "The Primordial Cube is an equipment in Risk of Rain 2. \nWhen activated, it launches a slow-moving black hole that pulls in monsters in a 30m radius. The black hole lasts 10 seconds.\n\n\n== Tips ==\nUse the black hole to pull enemies away from the player, or to group them together for area-of-effect damage, such items like  Will-o'-the-wisp and skills like   Orbital Probe,   Arrow Rain, and   Charged Nano-Bomb.\nThe Cube is useful for the challenge The Demons And The Crabs, since the  Hermit Crabs can be pulled off of ledges by the black hole.\nThis equipment makes clearing the Artificer: Massacre challenge easier, since the player can group up enemies to finish them off all at once.\nEnemies can be dragged into the air by the black hole, essentially disabling the movement of ground based enemies.\nPrimordial Cube has no limit to the number of black holes, and can be activated every frame; this can cause significant lag when paired with very large numbers of  Gesture of the Drowned and  Fuel Cell.\nPrimordial Cube makes getting Pots onto the Pressure Plates in Abandoned Aqueduct exponentially easier, as you only need to get a pot nearby and spawn a black hole atop the plate.\nWith enough black holes, you can make a gravitational force strong enough to fling enemies and some bosses into oblivion and kill them via fall damage.\nHowever sometimes this is not recommended as it can softlock your run.\n\n\n== Lore ==\n“Professors Mia Thatcher and Jared Malik report that the galaxy’s first singularity containment lattice – or SCL, for short – has finished tests and is confirmed to be perfectly safe. \n\nWhile this is a historic scientific breakthrough, multiple scientists have spoken out about the implications of such a discovery - and what it could mean for the future of the humanity.”\n\n- The Saturn Reporter, Front Page Headline\n\n\n== Version History ==\nAnniversary Update\nMajor Content\nAdded New Lore Entry: Primordial Cube",
    "url": "https://riskofrain2.wiki.gg/wiki/Primordial_Cube",
    "img_file": "Primordial_Cube.png",
    "local_path": "C:\\Users\\Kinny\\Documents\\TEST\\PYTHON_TOOLBOX\\PROGRAMS\\ROR2\\ROR2_Architect\\ROR2_Data\\Equipment\\Primordial_Cube",
    "rarity_raw": "Equipment"
}